export default {
  name: '一脉相承',
  list: [
    {
      name: '拳掌',
      list: ['罗汉拳 → 大力金刚掌'],
    },
    {
      name: '指腿',
      list: ['天竺佛指 → 无相劫指'],
    },
    {
      name: '剑法',
      list: ['北斗剑法 → 参合剑气', '玉女剑法 → 玉女素心剑', '一字电剑 → 周公剑法'],
    },
    {
      name: '刀法',
      list: ['柴刀十八路 → 庖丁解牛刀'],
    },
    {
      name: '奇门',
      list: ['杨家枪法 → 岳家枪法'],
    },
    {
      name: '内功',
      list: [
        '古墓心法 → 玉女心经',
        '全真心法 → 先天功',
        '少林心法 → 易筋经',
        '莲花功 (丐帮)→ 擒龙功',
        '华山心法 (华山派)→ 紫霞神功 → 五岳剑决',
        '嵩山心法 → 寒冰真气',
        '血刀心法 → 血河神鉴 → 天魔功',
        '地火功 → 圣火神功',
        '武当心法 → 太极神功',
        '少林九阳功、武当九阳功、峨眉九阳功 → 九阳神功',
        '龟息功 → 不老长春功',
        '神照功 → 长生诀',
        '蛤蟆功 → 鲸息功',
        '狮子吼 → 金刚狮子吼',
        '小周天功 → 大周天功',
      ],
    },
  ],
};
