export default {
  name: '白马啸西风',
  normal: [
    {
      map: '破庙（北部）',
      event: [
        {
          list: ['进入场景，正邪分支'],
          reward: [],
        },
      ],
    },
  ],
  good: [
    {
      map: '破庙（北部）',
      event: [
        {
          list: ['剧情后，选择『是』进入正线，触发战斗：', 'VS 陈达海+铁掌帮众', '胜利后得 [黑血神针]*3', '李文秀入队，得[白马]、[手帕]'],
          reward: ['道德+2', '手帕[剧情道具]', '白马[坐骑]', '李文秀[队友]入队'],
        },
      ],
    },
    {
      map: '沙漠废墟（北部）',
      event: [
        {
          list: ['进入场景后触发战斗：', 'VS 瓦尔拉齐+一群喽啰'],
          reward: [],
        },
        {
          list: [
            '战斗胜利后，点击废墟内的柜子，开启密道进入高昌迷宫',
            '身上有[玄铁剑]、[屠龙刀]、[倚天剑]三把兵器之一即可劈开石门',
            '迷宫内开宝箱获得：',
            '《白马啸西风》、[天山雪莲]、银两*1000、【玄虚刀法】',
          ],
          reward: ['白马啸西风[十四天书之一]', '天山雪莲[丹药]', '银两*1000', '玄虚刀法[刀法秘籍]'],
        },
      ],
    },
  ],
  evil: [
    {
      map: '破庙（北部）',
      event: [
        {
          list: ['剧情后，选择『否』进入邪线，触发战斗：', 'VS 陈达海'],
          reward: ['道德-3', '手帕[剧情道具]', '白马[坐骑]', '黄沙万里鞭[奇门秘籍]'],
        },
      ],
    },
    {
      map: '沙漠废墟（北部）',
      event: [
        {
          list: ['进入场景后触发战斗：', 'VS 瓦尔拉齐+一群喽啰'],
          reward: [],
        },
        {
          list: [
            '战斗胜利后，点击废墟内的柜子，开启密道进入高昌迷宫',
            '身上有[玄铁剑]、[屠龙刀]、[倚天剑]三把兵器之一即可劈开石门',
            '迷宫内开宝箱获得：',
            '《白马啸西风》、[天山雪莲]、银两*1000、【玄虚刀法】',
          ],
          reward: ['白马啸西风[十四天书之一]', '天山雪莲[丹药]', '银两*1000', '玄虚刀法[刀法秘籍]'],
        },
      ],
    },
  ],
};
