export default {
  name: '飞狐外传',
  normal: [
    {
      map: '沧州（北部）',
      event: [
        {
          list: ['剧情后，触发战斗：', 'VS 范兴汉'],
          reward: ['道德+1'],
        },
        {
          list: ['深夜进入上方有间客栈后，触发剧情'],
          reward: [],
        },
        {
          list: ['进入左边阎基房间，触发剧情'],
          reward: [],
        },
        {
          list: ['进入沧州右下角房间，触发剧情'],
          reward: [],
        },
        {
          list: ['回客栈同胡一刀对话后返回自己房间（胡一刀房间对面）'],
          reward: ['道德+1'],
        },
        {
          list: ['客栈大堂剧情后，触发战斗：', 'VS 苗人凤（坚持200时序即可）'],
          reward: [],
        },
      ],
    },
    {
      map: '商家堡（中原）',
      event: [
        {
          list: ['进入商家堡后，触发战斗：', 'VS 商剑鸣+商夫人'],
          reward: [],
        },
      ],
    },
    {
      map: '沧州（北部）',
      event: [
        {
          list: ['进入客栈后，触发剧情'],
          reward: [],
        },
        {
          list: ['返回客栈自己房间，剧情后触发战斗：', 'VS 范兴汉+天龙门弟子*2+丐帮弟子*2'],
          reward: [],
        },
        {
          list: ['客栈大堂剧情后，触发战斗：', 'VS 苗人凤（坚持200即可）'],
          reward: [],
        },
        {
          list: ['剧情后，触发战斗：', 'VS 阎基', '胜后得【千金方】'],
          reward: ['千金方[杂学]'],
        },
        {
          list: [
            '返回客栈自己房间后，再进入大堂，触发胡一刀中毒剧情',
            '根据队伍中是否有三大神医之一（薛慕华、平一指、胡青牛）触发袁紫衣线跟程灵素线',
            '*袁紫衣线需开启闯王藏宝洞宝箱才能拿到飞狐外传'
          ],
          reward: [],
        },
      ],
    },
  ],
  good: [
    {
      map: '沧州（北部）',
      event: [
        {
          list: ['若队伍中有三大神医之一（薛慕华、平一指、胡青牛），会医好胡夫人，剧情后获得黄金包袱', '进入袁紫衣线'],
          reward: ['黄金包袱[剧情道具]'],
        },
        {
          list: ['客栈后方对话苗人凤'],
          reward: [],
        },
      ],
    },
    {
      map: '商家堡（中原）',
      event: [
        {
          list: ['进入商家堡，遇胡斐，剧情后：', 'VS 商夫人+商宝震', '战斗胜利后，胡斐入队'],
          reward: ['胡斐入队[队友]'],
        },
        {
          list: ['进入商家堡，剧情后：', 'VS 王剑杰 '],
          reward: [],
        },
        {
          list: ['剧情后被困商家堡，点击右侧蒲团开门，剧情后：', 'VS 商夫人+商宝震'],
          reward: [],
        },
      ],
    },
    {
      map: '佛山（江南）',
      event: [
        {
          list: ['佛山客栈触发剧情，剧情后前往地图右上方五虎门，对话看门人：', 'VS 五虎门人'],
          reward: ['道德+1'],
        },
        {
          list: ['入内对话凤天南，触发剧情：', 'VS 凤天南'],
          reward: ['道德+2'],
        },
        {
          list: ['出门后触发剧情：', 'VS 袁紫衣'],
          reward: [],
        },
        {
          list: ['返回五虎门，触发剧情：', 'VS 御前侍卫*2+带刀官兵*2'],
          reward: ['道德+1'],
        },
      ],
    },
    {
      map: '衡阳（江南）',
      event: [
        {
          list: ['韦陀门触发剧情：', 'VS 刘鹤真'],
          reward: [],
        },
        {
          list: ['战斗后直接出去（进入屋内会卡空气墙出不去）对话韦陀门外马，触发剧情：', '获得[绝群]', '袁紫衣入队'],
          reward: ['绝群[坐骑]', '袁紫衣入队[队友]'],
        },
        {
          list: ['回雁楼触发剧情：', 'VS 蓝秦+御前侍卫+带刀官兵', '胜利后获得【八仙剑法】', '剧情后袁紫衣离队'],
          reward: ['道德+2', '八仙剑法[剑法秘籍]'],
        },
      ],
    },
    {
      map: '药王庙（中原）',
      event: [
        {
          list: ['进入药王庙触发剧情：', 'VS 蓝秦+御前侍卫*2'],
          reward: [],
        },
      ],
    },
    {
      map: '北京（北部）',
      event: [
        {
          list: ['对话福康安府看门人，剧情后触发战斗：', 'VS 汤沛'],
          reward: [],
        },
        {
          list: ['继续剧情后触发战斗：', 'VS 汤沛+田归农+王剑杰+王剑英+范兴汉+赛尚鄂+一群官兵'],
          reward: [],
        },
        {
          list: ['剧情后收袁紫衣入队', '获得[闯王军刀] [冷月宝刀]'],
          reward: ['闯王军刀[武器]', '冷月宝刀[武器]', '袁紫衣入队[队友]'],
        },
      ],
    },
  ],
  evil: [
    {
      map: '沧州（北部）',
      event: [
        {
          list: ['若队伍中没有三大神医之一（薛慕华、平一指、胡青牛），胡夫人会死亡', '进入程灵素线'],
          reward: [],
        },
        {
          list: ['客栈后方对话苗人凤', '获得【苗家剑法】'],
          reward: ['苗家剑法[剑法秘籍]'],
        },
      ],
    },
    {
      map: '商家堡（中原）',
      event: [
        {
          list: ['进入商家堡，遇胡斐，剧情后：', 'VS 商夫人+商宝震', '战斗胜利后，胡斐入队'],
          reward: ['胡斐入队[队友]'],
        },
        {
          list: ['进入商家堡，剧情后：', 'VS 王剑杰 '],
          reward: [],
        },
        {
          list: ['剧情后被困商家堡，点击右侧蒲团开门，剧情后：', 'VS 商夫人+商宝震'],
          reward: [],
        },
      ],
    },
    {
      map: '苗家庄（中原）',
      event: [
        {
          list: ['进入苗家庄，剧情后：', 'VS 御前侍卫*2+带刀官兵*2', '战斗胜利后，过剧情'],
          reward: ['道德+2'],
        },
      ],
    },
    {
      map: '衡阳-药王庄（江南）',
      event: [
        {
          list: ['与程灵素对话，程灵素会要求去找[七心海棠]'],
          reward: [],
        },
      ],
    },
    {
      map: '阎基居（江南）',
      event: [
        {
          list: ['胡斐在队时，进入左上房间，触发剧情，我方全员中毒内力全失进入战斗：', 'VS 阎基', '胜后得[两页刀法][七心海棠]'],
          reward: ['道德+2 ', '两页刀法[剧情道具] ', '七心海棠[剧情道具]', '千金方[医书] 阎基身上偷取 '],
        },
      ],
    },
    {
      map: '衡阳-药王庄（江南）',
      event: [
        {
          list: [
            '与程灵素对话，给程灵素[七心海棠]，得到[苗人凤眼毒解药]',
            '胡斐在队伍时，再次与程灵素对话，可邀请程灵素入队',
            '获得【药王神篇】',
          ],
          reward: ['苗人凤眼毒解药[剧情道具]', '药王神篇[医书]', '程灵素[队友] 加入'],
        },
      ],
    },
    {
      map: '苗家庄（中原）',
      event: [
        {
          list: ['给苗人凤[苗人凤眼毒解药]，剧情后胡斐离队', '再次与胡斐对话，收胡斐入队'],
          reward: [],
        },
        {
          list: ['再次与苗人凤对话，选是触发战斗：', 'VS 苗人凤', '获得《飞狐外传》【苗家剑法】'],
          reward: ['道德+2', '飞狐外传[十四天书之一]', '苗家剑法[剑法秘籍]'],
        },
      ],
    },
    {
      map: '北京（北部）',
      event: [
        {
          list: ['对话福康安府看门人触发剧情：', 'VS 汤沛'],
          reward: [],
        },
        {
          list: ['继续剧情后触发战斗：', 'VS 汤沛+田归农+王剑杰+王剑英+范兴汉+赛尚鄂+一群官兵'],
          reward: [],
        },
        {
          list: ['剧情后收袁紫衣入队', '获得[闯王军刀] [冷月宝刀]'],
          reward: ['闯王军刀[武器]', '冷月宝刀[武器]', '袁紫衣入队[队友]'],
        },
      ],
    },
  ],
};
