export default {
  name: '江湖轶事',
  normal: [
    {
      map: '云岭洞（西部）',
      event: [
        {
          list: ['对话中间的NPC，畅想和特殊人物可选择是否学习迷踪步（轻功，不建议学，自动战斗也需手动点位移）'],
          reward: [],
        },
        {
          list: ['右侧山洞可捡起千年冰蚕，触发战斗：', 'VS 游坦之', '胜后获得【千年冰蚕】【冰蚕毒掌】'],
          reward: ['千年冰蚕[丹药]', '冰蚕毒掌[拳掌秘籍]'],
        },
      ],
    },
    {
      map: '西部农村（西部）',
      event: [
        {
          list: ['对着房子里的人使用[铁铲]，选择『是』，教小孩武功', '之后再选择『否』拒绝收银子'],
          reward: ['道德+2'],
        },
        {
          list: ['对着房子里的人使用[铁铲]，选择『是』，教小孩武功', '之后再选择『是』拒绝收银子'],
          reward: ['银两*5'],
        },
        {
          list: ['对着房子里的黑衣人使用[铁铲]，选择『否』，不教小孩武功'],
          reward: ['道德-10'],
        },
      ],
    },
    {
      map: '天台山（中原）',
      event: [
        {
          list: ['在天龙八部正线剧情乔峰离开丐帮剧情之前（邪线无时间限制）', '道德≥75时，与智光大师对话可获得【慈悲刀法】'],
          reward: ['慈悲刀法[刀法秘籍]'],
        },
      ],
    },
    {
      map: '冲霄洞（西部）',
      event: [
        {
          list: [
            '在天龙八部正线剧情乔峰离开丐帮剧情之前（邪线无时间限制）',
            '山洞里面与谭婆对话，',
            '选【不去】，获得【渔叟钓法】',
            '选【出去】，再找赵钱孙对话孙可获得【修罗刀谱】',
            '选【不知道】，获得【去烦恼指法】',
          ],
          reward: ['渔叟钓法[奇门秘籍]三选一', '修罗刀谱[刀法秘籍]三选一', '去烦恼指法[指法秘籍]三选一'],
        },
      ],
    },
    {
      map: '武当派（中原）',
      event: [
        {
          list: [
            '与张三丰对话，再次与其对话：',
            '获得【绕指柔剑法】',
            '主角道德≥65时，获得【太极拳】',
            '主角道德≥75时，获得【龟息功】',
            '主角道德≥85时，获得【太极剑法】',
          ],
          reward: ['绕指柔剑法[剑法秘籍]', '太极拳[拳掌秘籍]', '龟息功[内功秘籍]', '太极剑法[剑法秘籍]', ''],
        },
        {
          list: ['获得武当三宝后，对话张三丰，可以选择挑战', '张三丰血量降低50%或坚持200时序后获得【太极神功】'],
          reward: ['太极神功[内功秘籍]'],
        },
        {
          list: [
            '与宋远桥对话接受龙门镖局人物，前往杭州龙门镖局，对尸体空格，触发剧情：',
            'VS少林铜人*3+空性',
            '胜利后返回武当对话宋远桥，获得【武当九阳功】',
          ],
          reward: ['武当九阳功[内功秘籍]'],
        },
        {
          list: ['与右边武当弟子对话，触发战斗：', 'VS 武当弟子', '胜后获得【武当心法】'],
          reward: ['武当心法[内功秘籍]'],
        },
        {
          list: ['开启张三丰上边房间的宝箱：', 'VS 真武七截阵', '获胜后获得【神门剑谱】【梯云纵横】'],
          reward: ['道德-5', '神门剑谱[剑法秘籍]', '梯云纵横[轻功秘籍]'],
        },
      ],
    },
    {
      map: '少林寺（中原）',
      event: [
        {
          list: ['道德≥80时，与玄慈对话，获得【燃木刀法】'],
          reward: ['燃木刀法[刀法秘籍]'],
        },
        {
          list: ['打开佛堂宝箱，获得【伏魔杖法】，触发战斗：', 'VS 空性+少林弟子*7'],
          reward: ['道德-2', '伏魔杖法[奇门秘籍]'],
        },
        {
          list: ['调查般若堂书架，获得【多罗叶指】'],
          reward: ['道德-2', '多罗叶指[指法秘籍]'],
        },
        {
          list: ['打开左下房间宝箱，获得【大智无定指】，触发战斗：', 'VS 十八铜人'],
          reward: ['道德-2', '大智无定指[指法秘籍]'],
        },
        {
          list: [
            '与少林木人巷门口弟子对话，选择『是』，挑战木人阵：',
            'VS 十八木人',
            '胜后开启木人巷宝箱，获得【须弥山神掌】',
            '*可败，但不可重复挑战',
          ],
          reward: ['须弥山神掌[拳掌秘籍] '],
        },
        {
          list: [
            '与少林铜人巷门口弟子对话，选择『是』，挑战铜人巷：',
            'VS 方证',
            '胜利后获得【般若掌】',
            '*可败，但不可重复挑战',
            '通过木人巷及铜人巷后，可开启宝箱，触发战斗：',
            'VS 玄澄',
            '胜后获得【伏魔禅杖】',
          ],
          reward: [' 般若掌[拳掌秘籍]', '伏魔禅杖[武器]'],
        },
      ],
    },
    {
      map: '重阳宫（中原）',
      event: [
        {
          list: ['与右下方全真弟子对话，触发战斗：', 'VS 全真弟子', '胜后获得【全真心法】'],
          reward: ['全真心法[内功秘籍]'],
        },
        {
          list: ['打开重阳宫左下房间的宝箱，触发战斗：', 'VS 孙不二+郝大通+全真弟子', '胜后获得【全真剑法【三花聚顶掌】'],
          reward: ['道德-3', '全真剑法[剑法秘籍]', '三花聚顶掌[拳掌秘籍]'],
        },
      ],
    },
    {
      map: '扬州（江南）',
      event: [
        {
          list: ['包里有[溪山行旅图]，和渡口旅人对话后开放灵鳖岛'],
          reward: [],
        },
      ],
    },
    {
      map: '灵鳖岛（海外）',
      event: [
        {
          list: ['与梁萧对话，触发战斗：', 'VS 梁萧', '胜后获得【鲸息功】'],
          reward: ['鲸息功[内功秘籍]'],
        },
      ],
    },
    {
      map: '丐帮（中原）',
      event: [
        {
          list: ['对话守门弟子，挑战打狗阵法，触发战斗：', 'VS 若干丐帮弟子', '胜后获得【莲花功】'],
          reward: ['莲花功[内功秘籍]'],
        },
        {
          list: ['对话解风，挑战真·打狗阵法，触发战斗：', 'VS 萧峰+洪七公+解风+史火龙', '胜后获得【擒龙功】'],
          reward: ['擒龙功[内功秘籍]'],
        },
      ],
    },
    {
      map: '华山下-华山后山（中原）',
      event: [
        {
          list: ['包里有【玄铁剑法】或【独孤九剑】，且主角御剑≥320时，', '对话独孤求败，战胜可选择习得九剑真传或剑魔再临'],
          reward: [],
        },
      ],
    },
    {
      map: '铁掌山（江南）',
      event: [
        {
          list: ['从传国玉玺宝箱处进入岳王墓，调查书架触发战斗：', 'VS 岳云+上官剑南', '胜后获得【武穆遗书】【岳王散手】【岳家枪法】'],
          reward: ['武穆遗书[内功秘籍]', '岳王散手[指法秘籍]', '岳家枪法[奇门秘籍]'],
        },
      ],
    },
    {
      map: '洛阳（中原）',
      event: [
        {
          list: ['洛阳客栈对话白展堂，可花10000两购买【葵花点穴手】', '如选择不卖则白展堂离开'],
          reward: ['葵花点穴手[指法秘籍]'],
        },
        {
          list: ['洛阳客栈再次对话白展堂，触发战斗', 'VS白展堂', '胜后可花20000两购买【龟息功】，战斗失败则损失20000两', ''],
          reward: ['龟息功[内功秘籍]'],
        },
      ],
    },
    {
      map: '药王庙（中原）',
      event: [
        {
          list: ['对房屋后坟墓使用铁铲，触发战斗：', 'VS 寇仲', '胜后获得【井月八法】'],
          reward: ['井月八法[刀法秘籍]'],
        },
        {
          list: ['获得【井月八法】后，背包有【神照功】时对话徐子陵触发战斗：', 'VS 徐子陵', '胜后获得【长生诀】'],
          reward: ['长生诀[内功秘籍] '],
        },
      ],
    },
    {
      map: '晋阳-中条山（北部）',
      event: [
        {
          list: ['获得【井月八法】后，前往晋阳上方中条山，对话宋缺：', 'VS 寇仲', '胜后获得【天刀九问】'],
          reward: ['天刀九问[刀法秘籍]'],
        },
      ],
    },
    {
      map: '五毒教（西部）',
      event: [
        {
          list: ['调查五毒教左上房间衣柜，触发战斗：', 'VS 何红药+何铁手+五毒教众', '胜后获得【五毒神功】'],
          reward: ['五毒神功[内功秘籍]'],
        },
      ],
    },
    {
      map: '南少林（江南）',
      event: [
        {
          list: ['与大痴和尚对话，触发战斗', 'VS 大痴和尚', '胜利后获得【达摩剑法】'],
          reward: ['达摩剑法[剑法秘籍]'],
        },
        {
          list: ['与天虹对话，触发战斗：', 'VS 天虹', '天虹半血后获得【大力金刚掌】'],
          reward: ['大力金刚掌[拳掌秘籍]'],
        },
      ],
    },
    {
      map: '峨眉派-峨眉金顶（西部）',
      event: [
        {
          list: ['对话萧秋水，剧情后：', 'VS 萧秋水', '胜利后获得【忘情天书】'],
          reward: ['忘情天书[内功秘籍]'],
        },
      ],
    },
  ],
};
