export default {
  name: '连城诀',
  normal: [
    {
      map: '唐诗山洞（江南）',
      event: [
        {
          list: ['与狄云对话，选是狄云入队，得[乌蚕衣]', '开启狄云身后的箱子的[唐诗选集]'],
          reward: ['道德+2', '唐诗选集[剧情道具]', '乌蚕衣[防具]', '狄云[队友]加入'],
        },
      ],
    },
    {
      map: '破庙（北部）',
      event: [
        {
          list: ['狄云在队时，点击丁典的坟触发剧情后进入破庙里，触发战斗：', 'VS 宝象', '胜后得【血刀心法】、银两*200'],
          reward: ['银两*200', '血刀心法[内功秘籍]'],
        },
      ],
    },
    {
      map: '龙门客栈（西部）',
      event: [
        {
          list: ['进入客栈后触发剧情，狄云被血刀老祖掳走'],
          reward: [],
        },
      ],
    },
  ],
  good: [
    {
      map: '雪山（北部）',
      event: [
        {
          list: ['剧情后，选择『否』进入正线，触发战斗：', 'VS 血刀老祖', '胜后得【鬼头刀法】'],
          reward: ['道德+2', '鬼头刀法[刀法秘籍]'],
        },
        {
          list: ['剧情后狄云神照功大成属性提升', '与狄云对话后收狄云入队，得【血刀经】'],
          reward: [
            '血刀经[刀法秘籍]',
            '狄云[队友] 加入',
            '狄云奖励：',
            '攻击+30、防御+30、轻功+30',
            '五系兵器值+10 ',
            '第二格武功洗血刀大法 1级',
          ],
        },
        {
          list: ['对着水盆使用[唐诗选集]，得知连城诀的秘密', '狄云学会连城剑法，获得【连城剑法】'],
          reward: ['连城剑法[剑法秘籍]', '狄云奖励：', '第三格武功洗连城剑法 1级'],
        },
      ],
    },
    {
      map: '江陵-天宁寺（江南）',
      event: [
        {
          list: ['进入场景后触发战斗：', 'VS 一群喽啰'],
          reward: [],
        },
        {
          list: ['若狄云不在队或道德<80：', '点击天宁寺内佛像背后获得《连城诀》'],
          reward: ['连城诀[十四天书之一]'],
        },
        {
          list: [
            '若道德≥80且狄云在队：',
            '点击天宁寺内佛像背后获得《连城诀》【神照经】',
            '出门触发剧情，狄云被戚长发偷袭，进入战斗：',
            'VS 戚长发',
          ],
          reward: ['道德+1', '连城诀[十四天书之一]', '神照经[内功秘籍]'],
        },
      ],
    },
    {
      map: '雪山（北部） 需在天宁寺拿到神照经',
      event: [
        {
          list: ['狄云在队时，与水笙对话，可收水笙入队'],
          reward: ['水笙[队友] 加入'],
        },
      ],
    },
  ],
  evil: [
    {
      map: '雪山（北部）',
      event: [
        {
          list: ['剧情后，选择『是』进入邪线，触发战斗：', '1、VS 落花流水+水笙', '2、VS 水笙（暴走版）'],
          reward: ['道德-2', '中平枪法[奇门秘籍] （花铁干身上偷取）'],
        },
        {
          list: [
            '战斗后花铁干向主角求饶命，若选择不杀花铁干',
            '可收花铁干入队，获得【中平枪法】',
            '*若之前有偷取中平枪法秘籍，则无法重复获得',
          ],
          reward: ['道德-1', '中平枪法[奇门秘籍]', '花铁干[队友] 加入'],
        },
        {
          list: [
            '血刀老祖给予【血刀经】，再次与其对话，选『是』触发战斗：',
            'VS 血刀老祖',
            '胜后获得[血刀]、【血河神鉴】',
          ],
          reward: ['血刀经[刀法秘籍]', '血刀[武器]', '血河神鉴[内功秘籍]'],
        },
        {
          list: ['对着水盆使用[唐诗选集]，得知连城诀的秘密', '同时获得【连城剑法】'],
          reward: ['连城剑法[剑法秘籍]'],
        },
      ],
    },
    {
      map: '江陵-天宁寺（江南）',
      event: [
        {
          list: ['进入场景后触发战斗：', 'VS 一群喽啰'],
          reward: [],
        },
        {
          list: ['点击天宁寺内佛像背后获得《连城诀》'],
          reward: ['连城诀[十四天书之一]'],
        },
      ],
    },
  ],
};
