export default {
  name: '书剑恩仇录',
  normal: [
    {
      map: '凤阳（中原）',
      event: [
        {
          list: ['进入场景，进入场景触发战斗：', 'VS 御前侍卫+带刀官兵', '胜后获得【迷踪连环腿】'],
          reward: ['道德+2', '迷踪连环腿[指法秘籍]'],
        },
      ],
    },
    {
      map: '杭州（江南）',
      event: [
        {
          list: ['对话客栈丐帮弟子后，进入六和塔，触发剧情分支'],
          reward: [],
        },
      ],
    },
  ],
  good: [
    {
      map: '杭州-六合塔（江南）',
      event: [
        {
          list: ['选择『霍青桐线』，触发战斗：', 'VS 红花会', '胜后获得【百花错拳】【三分剑术】'],
          reward: ['百花错拳[拳掌秘籍]', '三分剑术[剑法秘籍]'],
        },
      ],
    },
    {
      map: '回族部落（西部）',
      event: [
        {
          list: ['进入屋子，触发战斗：', 'VS 五毒教徒若干'],
          reward: [],
        },
        {
          list: ['与霍青桐对话，可收其入队，获得【三分剑术】'],
          reward: ['三分剑术[剑法秘籍]', '霍青桐[队友] 加入'],
        },
        {
          list: ['对话左上角卫兵后，可进入清兵大营'],
          reward: [],
        },
        {
          list: ['从左上角小路进入清兵大营触发战斗：', 'VS 官兵*5'],
          reward: [],
        },
        {
          list: ['进入帐篷，霍青桐离队，触发战斗：', 'VS 张召重+官兵*2', '胜后获得【柔云剑谱】【纯阳无极功】'],
          reward: ['纯阳无极功[内功秘籍]', '柔云剑谱[剑法秘籍]', '霍青桐[队友]离队'],
        },
        {
          list: ['返回回族部落，对话木卓伦'],
          reward: [],
        },
      ],
    },
    {
      map: '沙漠废墟（北部）',
      event: [
        {
          list: ['进入左边房间，触发剧情'],
          reward: [],
        },
        {
          list: ['再次对话霍青桐触发剧情，包里需要有一颗[天王保命丹]'],
          reward: ['天王保命丹[丹药] -1'],
        },
        {
          list: ['通过密道进入高昌迷宫后，调查右侧石像进入楼兰遗迹'],
          reward: [],
        },
        {
          list: ['调查房间里的尸骨，获得【庖丁解牛刀】【庄子】'],
          reward: ['庖丁解牛刀[刀法秘籍]', '庄子[内功秘籍]'],
        },
        {
          list: ['原路离开遗迹，对话关东六魔，触发战斗：', 'VS 关东六魔'],
          reward: [],
        },
      ],
    },
    {
      map: '回族部落（西部）',
      event: [
        {
          list: ['进入场景，触发战斗：', 'VS 精锐骑兵*4'],
          reward: [],
        },
        {
          list: ['与霍青桐对话，可收其入队'],
          reward: ['霍青桐[队友] 加入'],
        },
      ],
    },
    {
      map: '杭州-六合塔（江南）',
      event: [
        {
          list: ['左上房间对话文泰来，我方内力全失，触发战斗：', 'VS 张召重+大内高手*4', '胜后获得【奔雷手】[凝碧剑]', '骆冰、文泰来入队'],
          reward: ['奔雷手[拳掌秘籍]', '凝碧剑[武器]', '骆冰[队友]加入', '文泰来[队友]加入'],
        },
      ],
    },
    {
      map: '南少林（江南）',
      event: [
        {
          list: ['进入场景，触发战斗：', '1、VS 元伤+元悲+元痛', '2、VS 南少林众僧'],
          reward: [],
        },
        {
          list: ['调查藏经阁调查藏经阁右边第二排从上数第二格书架', '获得《书剑恩仇录》【袈裟伏魔功】【追魂夺命剑】', '骆冰、文泰来离队前往小村'],
          reward: ['书剑恩仇录[十四天书之一]', '袈裟伏魔功[奇门秘籍]', '追魂夺命剑[剑法秘籍]'],
        },
      ],
    },
    {
      map: '回族部落（西部）',
      event: [
        {
          list: ['与陈家洛对话，可收其入队，获得【百花错拳】'],
          reward: ['陈家洛[队友] 加入', '百花错拳[拳掌秘籍]'],
        },
      ],
    },
  ],
  evil: [
    {
      map: '杭州-六合塔（江南）',
      event: [
        {
          list: ['选择『李沅芷线』，触发战斗：', 'VS 陈正德', '胜后获得【百花错拳】【三分剑术】'],
          reward: ['百花错拳[拳掌秘籍]', '三分剑术[剑法秘籍]'],
        },
      ],
    },
    {
      map: '龙门客栈（西部）',
      event: [
        {
          list: ['进入客栈左上角房间，战斗：', 'VS 霍青桐'],
          reward: [],
        },
        {
          list: ['客栈门口对话张召重，战斗：', 'VS 张召重+官兵若干', '胜后获得【纯阳无极功】'],
          reward: ['纯阳无极功[内功秘籍]'],
        },
        {
          list: ['第二天客栈门口与李沅芷对话，可收其入队'],
          reward: ['李沅芷[队友] 加入'],
        },
      ],
    },
    {
      map: '回族部落（西部）',
      event: [
        {
          list: ['左上角小路进入清军大营'],
          reward: [],
        },
        {
          list: ['对话李可秀，触发战斗：', 'VS 红花会众人'],
          reward: [],
        },
        {
          list: ['左上角帐篷对话李可秀，触发战斗：', 'VS 张召重', '胜后获得【柔云剑谱】', '胜后与李沅芷对话，可收其入队'],
          reward: ['柔云剑谱[剑法秘籍]', '李沅芷[队友]加入'],
        },
        {
          list: ['回到回族部落，对话霍青桐，触发剧情：', 'VS 精锐骑兵*4'],
          reward: ['道德+2'],
        },
      ],
    },
    {
      map: '乌鞘岭（西部）',
      event: [
        {
          list: ['对话陈家洛，触发剧情'],
          reward: [],
        },
      ],
    },
    {
      map: '回族部落（西部）',
      event: [
        {
          list: ['对话霍青桐，触发剧情'],
          reward: [],
        },
        {
          list: ['进入左上角帐篷，触发剧情'],
          reward: ['道德+2'],
        },
      ],
    },
    {
      map: '凉州（北部）',
      event: [
        {
          list: ['进入左上角客栈二楼房间，剧情后触发战斗：', 'VS 关中三魔'],
          reward: [],
        },
        {
          list: ['右下角房间，与李沅芷对话，可收其入队'],
          reward: ['李沅芷[队友] 加入'],
        },
        {
          list: ['对话城门口阿凡提，触发战斗：', 'VS 阿凡提', '胜后获得[毛驴]'],
          reward: ['毛驴[坐骑] '],
        },
      ],
    },
    {
      map: '沙漠废墟（北部）',
      event: [
        {
          list: ['进入左边房间，对话霍青桐'],
          reward: [],
        },
        {
          list: ['出房间，触发战斗：', 'VS 袁士宵', '胜后与霍青桐对话，可收其入队 获得【三分剑术】'],
          reward: ['三分剑术[剑法秘籍]', '霍青桐[队友] 加入'],
        },
        {
          list: ['通过密道进入高昌迷宫后，调查右侧石像进入楼兰遗迹'],
          reward: [],
        },
        {
          list: ['调查房间里的尸骨，获得【庖丁解牛刀】【庄子】'],
          reward: ['庖丁解牛刀[刀法秘籍]', '庄子[内功秘籍]'],
        },
      ],
    },
    {
      map: '回族部落（西部）',
      event: [
        {
          list: ['对话木卓伦'],
          reward: [],
        },
      ],
    },
    {
      map: '龙门客栈（西部）',
      event: [
        {
          list: ['进客栈，触发战斗：', 'VS 张召重+关东三魔+四大名捕', '胜后获得【无极玄功拳】[青冥剑]'],
          reward: ['无极玄功拳[拳掌秘籍]', '青冥剑[武器]'],
        },
      ],
    },
    {
      map: '武当山（中原）',
      event: [
        {
          list: ['与张召重对话，可收其入队'],
          reward: ['凝碧剑[武器]', '张召重[队友] 加入'],
        },
      ],
    },
    {
      map: '南少林（江南）',
      event: [
        {
          list: ['进入场景，触发战斗：', 'VS 南少林众僧'],
          reward: [],
        },
        {
          list: ['调查藏经阁右边第二排从上数第二格书架', '获得《书剑恩仇录》【袈裟伏魔功】【追魂夺命剑】', '骆冰、文泰来前往小村'],
          reward: ['书剑恩仇录[十四天书之一]', '袈裟伏魔功[奇门秘籍]', '追魂夺命剑[剑法秘籍]'],
        },
      ],
    },
  ],
};
