export default {
  name: '武道大会',
  normal: [
    {
      map: '武道大会（中原）',
      event: [
        {
          list: ['与楼梯前的谢无悠对话，选择『是』则开始挑战'],
          reward: [],
        },
        {
          list: [
            '挑战20大：',
            '风清扬、扫地老僧、东方不败、天山童姥、张三丰、',
            '李秋水、鸠摩智、王重阳、洪七公、黄药师、',
            '周伯通、无崖子、阿凡提、慕容博、萧远山、',
            '林朝英、欧阳锋、天虹、萧峰、一灯',
            '胜利后传送到密室对话NPC放书，再开启宝箱，获得[神杖]，可选择直接通关或挑战天关',
          ],
          reward: ['神杖[武林盟主的标志]'],
        },
      ],
    },
  ],
};
