export default {
  1: {
    name: '罗汉拳',
    move: ['童子摘葱', '童子拜佛'],
  },
  2: {
    name: '逍遥游',
    move: ['逍遥游'],
  },
  3: {
    name: '五毒神掌',
    move: ['五毒摧心', '五毒俱全'],
  },
  4: {
    name: '鹰爪功',
    move: ['锁喉', '探目', '撩阴'],
  },
  5: {
    name: '寒冰绵掌',
    move: ['寒冰封体', '冰雪严寒', '冰厚三尺', '冰销蚀骨', '寒凝千峰'],
  },
  6: {
    name: '美女拳法',
    move: ['红玉击鼓', '文姬归汉'],
  },
  7: {
    name: '绵掌',
    move: ['连绵不绝', '连绵不断'],
  },
  8: {
    name: '天山六阳掌',
    move: ['阳歌天钧', '阳春白雪', '阳关三叠', '阳煦山立', '朝阳初升', '暖阳融冰'],
  },
  9: {
    name: '灵蛇拳',
    move: ['雪山白驼', '飞鸿踏雪', '雪上加霜'],
  },
  10: {
    name: '百花错拳',
    move: ['红花天梦', '天池缭乱', '走马观花'],
  },
  11: {
    name: '九阴白骨爪',
    move: ['探微索隐', '摧敌首脑', '如穿腐土', '六阴已极', '冥华幻灭', '犹鬼神幽'],
  },
  12: {
    name: '落英神剑掌',
    move: ['珞樱缤纷', '雨急风狂', '江城飞花', '落英逐水', '樱风破阵'],
  },
  13: {
    name: '铁掌',
    move: ['壁立千仞', '斩钉截铁', '铁掌莲花'],
  },
  14: {
    name: '天山折梅手',
    move: ['踏雪折梅', '望梅止渴', '别有洞天', '天山灵鹫', '平淡无奇', '寒梅映雪'],
  },
  15: {
    name: '空明拳',
    move: ['深藏若虚', '天马行空', '空穴来风', '空空如也', '虚怀若谷'],
  },
  16: {
    name: '太极拳',
    move: ['野马分鬃', '提步探马', '双峰贯耳', '揽雀尾', '白鹤晾翅', '金鸡独立'],
  },
  17: {
    name: '一阳指',
    move: ['颐指气使', '梵指南天', '指矢天日', '紫微伏龙', '一指破玄关'],
  },
  18: {
    name: '弹指神通',
    move: ['弹指一瞬', '踏月香华', '弹冠相庆', '日月如梭', '弹雨穿空', '指破苍穹'],
  },
  19: {
    name: '幻阴指',
    move: ['魔幻天阴', '梦幻泡影', '诪张为幻', '冥狱幻影', '阴幻锁脉'],
  },
  20: {
    name: '龙爪手',
    move: ['捉影式', '捕风式', '鼓瑟式', '抱残式', '龙爪裂石'],
  },
  21: {
    name: '玄冥神掌',
    move: ['玄冥侵体', '天地幽冥', '天梦冥蒙', '冰毒缭绕', '飞鸿冥冥', '通幽洞明'],
  },
  22: {
    name: '大力金刚掌',
    move: ['大梵炼狱', '九仪崩乱', '地火燃穹', '金诚所至', '金刚碎岳'],
  },
  23: {
    name: '七伤拳',
    move: ['五行阴阳', '损心催肝', '藏离精失', '三焦齐逆', '意恍惚诀', '经脉俱伤'],
  },
  24: {
    name: '须弥山神掌',
    move: ['色空四显', '无色无相', '慑伏外道', '众佛参禅', '莲花佛相', '须弥芥子'],
  },
  25: {
    name: '黯然销魂掌',
    move: ['想入非非', '饮恨吞声', '倒行逆施', '穷途末路', '六神不安', '行尸走肉', '无中生有'],
  },
  26: {
    name: '降龙十八掌',
    move: [
      '见龙在田',
      '飞龙在天',
      '神龙摆尾',
      '双龙出水',
      '亢龙有悔',
      '潜龙勿用',
      '时乘六龙',
      '震惊百里',
    ],
  },
  27: {
    name: '松风剑法',
    move: ['平沙落雁', '碧渊腾蛟'],
  },
  28: {
    name: '雷震剑法',
    move: ['轰雷掣电', '雷霆万钧'],
  },
  29: {
    name: '三分剑术',
    move: ['冰河倒泻', '雪中奇莲', '千岩竞秀'],
  },
  30: {
    name: '万花剑法',
    move: ['万花齐放', '万卉争艳', '清澈梅花'],
  },
  31: {
    name: '泰山十八盘',
    move: ['五大夫剑', '岱宗如何', '七星落长空'],
  },
  32: {
    name: '云雾十三式',
    move: ['泉鸣芙蓉', '鹤翔紫盖', '天柱云气'],
  },
  33: {
    name: '万岳朝宗',
    move: ['叠翠浮青', '玉进天池', '天外玉龙'],
  },
  34: {
    name: '太岳三青峰',
    move: ['苍松迎客', '金雁横空', '天坤倒悬'],
  },
  35: {
    name: '雪山剑法',
    move: ['雪泥鸿爪', '梅雪争春'],
  },
  36: {
    name: '柔云剑术',
    move: ['杏花春雨', '满天花雨', '玉带围腰'],
  },
  37: {
    name: '两仪剑法',
    move: ['金针渡劫', '峭壁断云', '仪静体闲', '阴阳相济', '两仪归真'],
  },
  38: {
    name: '玉箫剑法',
    move: ['山外清音', '金声玉振', '凤曲长鸣', '响隔楼台', '箫剑和鸣'],
  },
  39: {
    name: '全真剑法',
    move: ['素月分辉', '疏星淡月', '星河欲转'],
  },
  40: {
    name: '金蛇剑法',
    move: ['金光蛇影', '金蛇化龙', '蛇困愁城', '灵蛇吐信', '蛇影迷踪'],
  },
  41: {
    name: '倚天剑法',
    move: ['玉碎昙香', '天劫俱灭', '倚天照海', '天外飞仙', '剑定乾坤'],
  },
  42: {
    name: '玉女剑法',
    move: ['清饮小酌', '举案齐眉', '冷月窥人'],
  },
  43: {
    name: '斗转星移',
    move: ['斗转星移'],
  },
  44: {
    name: '苗家剑法',
    move: ['苏秦背剑式', '黄龙吐须式', '反劈华山式', '怀中抱月式', '苗岭飞虹式'],
  },
  45: {
    name: '玄铁剑法',
    move: ['逆击', '倒劈', '顺刺', '横削', '重剑无锋', '大巧不工'],
  },
  46: {
    name: '太极剑法',
    move: ['钟馗仗剑', '青龙出水', '白蛇吐信', '野马跳涧', '仙人指路', '三环套月'],
  },
  47: {
    name: '独孤九剑',
    move: [
      '破掌式',
      '破气式',
      '破剑式',
      '破刀式',
      '破枪式',
      '朝天阙',
      '木马流',
      '无剑取',
      '总决式',
    ],
  },
  48: {
    name: '辟邪剑法',
    move: ['指打奸邪', '飞燕穿柳', '花开见佛', '锺馗抉目', '扫荡群魔', '紫气东来'],
  },
  49: {
    name: '六脉神剑',
    move: ['少商剑', '商阳剑', '中冲剑', '关冲剑', '少冲剑', '少泽剑'],
  },
  50: {
    name: '柴刀十八路',
    move: ['砍', '劈'],
  },
  51: {
    name: '万劫刀法',
    move: ['百劫式', '肆劫式'],
  },
  52: {
    name: '鬼头刀法',
    move: ['鬼见愁', '鬼见忧', '鬼见糗'],
  },
  53: {
    name: '南山刀法',
    move: ['燕子入巢', '采菊东篱'],
  },
  54: {
    name: '鸳鸯刀法',
    move: ['云蕾花开', '玲珑偃月', '只羡鸳鸯'],
  },
  55: {
    name: '狂风刀法',
    move: ['狂风大作', '飞沙走石', '风卷残云'],
  },
  56: {
    name: '奇门三才刀',
    move: ['带醉脱靴式', '摇头摆尾式'],
  },
  57: {
    name: '慈悲刀法',
    move: ['放下屠刀', '立地成佛'],
  },
  58: {
    name: '修罗刀',
    move: ['恨意绵绵', '饮恨而终', '含恨九泉'],
  },
  59: {
    name: '五虎断门刀',
    move: ['白虎跳涧', '剪扑自如', '生龙活虎'],
  },
  60: {
    name: '反两仪刀法',
    move: ['辗转反复', '两小无猜', '万劫不复', '两仪转承', '反刃破仪'],
  },
  61: {
    name: '金乌刀法',
    move: ['梅雪逢夏', '赤日炎炎', '锄禾当午'],
  },
  62: {
    name: '夫妻刀法',
    move: ['女貌郎才', '丽质眷属', '清风引佩', '明月照妆', '琴瑟和鸣'],
  },
  63: {
    name: '血刀大法',
    move: ['呕心沥血', '批纸削腐', '流星经天', '血海刀风', '血刃封喉'],
  },
  64: {
    name: '玄虚刀法',
    move: ['莫测高深', '故弄玄虚', '神而明之', '玄天虚若', '虚刃藏锋'],
  },
  65: {
    name: '燃木刀法',
    move: ['钻木取火', '无名孽火', '飞蛾扑火', '无明业火', '燃木焚天'],
  },
  66: {
    name: '火焰刀法',
    move: ['炽炎破军', '昊火焚天', '五内如焚', '烟焱张天', '炉火纯青', '星火燎原'],
  },
  67: {
    name: '胡家刀法',
    move: ['参拜北斗式', '沙鸥掠波式', '闭门铁扇刀', '缠身摘心刀', '拜佛听经式', '八方藏刀式'],
  },
  68: {
    name: '杨家枪法',
    move: ['回马枪', '春雷震怒'],
  },
  69: {
    name: '毒龙鞭法',
    move: ['毒龙出洞', '毒龙钻风'],
  },
  70: {
    name: '中平枪法',
    move: ['吊四平枪势', '中四平枪势', '稳四平枪势'],
  },
  71: {
    name: '裴将军帖',
    move: ['大君制六合', '猛将清九垓', '战马若龙虎'],
  },
  72: {
    name: '棋盘招式',
    move: ['紧气', '提子', '大飞'],
  },
  73: {
    name: '持摇琴',
    move: ['素手摘星', '歌尽影生', '高山流水', '琴音扰心', '摇琴破气'],
  },
  74: {
    name: '鹤蛇八打',
    move: ['冲天一鹤', '仙鹤穿云', '鹤啸九天'],
  },
  75: {
    name: '大剪刀',
    move: ['我咔', '我嚓', '我剪'],
  },
  76: {
    name: '海叟钓法',
    move: ['寒江垂钓', '江枫渔火'],
  },
  77: {
    name: '阴阳倒乱刃',
    move: ['假刀非刀', '假剑非剑', '白马非马', '坤悬倒刺', '乱刃阴阳'],
  },
  78: {
    name: '黄沙万里鞭',
    move: ['血染黄沙', '飞沙万里', '黄粱一梦'],
  },
  79: {
    name: '银索金铃',
    move: ['水银泻地', '金枝玉叶', '银索缠身'],
  },
  80: {
    name: '打狗棒法',
    move: ['棒打狗头', '反截狗臀', '獒口夺杖', '棒打双犬', '恶狗拦路', '天下无狗'],
  },
  81: {
    name: '灵蛇杖法',
    move: ['怪蟒翻身', '毒蛇吐信', '蛇己旧人', '打草惊蛇', '蛇蝎心肠', '灵蛇之珠'],
  },
  82: {
    name: '金刚伏魔圈',
    move: ['祗园精舍', '诸行无常', '娑罗双树', '幻梦一场', '佛陀割肉', '金刚伏魔'],
  },
  83: {
    name: '无上大力杵',
    move: ['力战千钧', '拔山填海', '千钧压顶', '推象伏虎', '杵定山河'],
  },
  84: {
    name: '倚天屠龙功',
    move: ['武林至尊', '宝刀屠龙', '号令天下', '莫敢不从', '倚天不出', '谁与争锋'],
  },
  85: {
    name: '北冥神功',
    move: ['北冥神功'],
  },
  86: {
    name: '伏魔杖法',
    move: ['天魔降伏', '佛怒唐莲', '祸福倚伏', '摩诃无量', '佛高一尺', '佛魔摄道'],
  },
  87: {
    name: '化功大法',
    move: ['化功大法'],
  },
  88: {
    name: '吸星大法',
    move: ['吸星大法'],
  },
  89: {
    name: '紫霞神功',
    move: ['紫霞神功'],
  },
  90: {
    name: '混元功',
    move: ['混元功'],
  },
  91: {
    name: '金刚狮子吼',
    move: ['金刚狮子吼'],
  },
  92: {
    name: '狮子吼',
    move: ['狮子吼'],
  },
  93: {
    name: '圣火神功',
    move: ['圣火神功'],
  },
  94: {
    name: '神照功',
    move: ['神照功'],
  },
  95: {
    name: '蛤蟆功',
    move: ['蛤蟆功'],
  },
  96: {
    name: '罗汉伏魔功',
    move: ['罗汉伏魔功'],
  },
  97: {
    name: '乾坤大挪移',
    move: ['乾坤大挪移'],
  },
  98: {
    name: '小无相功',
    move: ['小无相功'],
  },
  99: {
    name: '纯阳无极功',
    move: ['纯阳无极功'],
  },
  100: {
    name: '先天功',
    move: ['先天功'],
  },
  101: {
    name: '八荒六合功',
    move: ['八荒六合功'],
  },
  102: {
    name: '太玄神功',
    move: ['太玄神功'],
  },
  103: {
    name: '龙象般若功',
    move: ['龙象般若功'],
  },
  104: {
    name: '逆运经脉',
    move: ['逆运经脉'],
  },
  105: {
    name: '葵花神功',
    move: ['葵花神功'],
  },
  106: {
    name: '九阳神功',
    move: ['九阳神功'],
  },
  107: {
    name: '九阴神功',
    move: ['九阴神功'],
  },
  108: {
    name: '易筋神功',
    move: ['易筋神功'],
  },
  109: {
    name: '野球拳',
    move: ['石头', '剪子', '布', '拳打脚踢', '乱拳捶打', '野劲横生'],
  },
  110: {
    name: '神山剑法',
    move: ['神洲移山剑', '神洲镇山剑', '神洲擎山剑', '神洲劈山剑', '神洲锁山剑', '神洲归山剑'],
  },
  111: {
    name: '西瓜刀法',
    move: ['切瓜', '剁瓜', '砍瓜', '削瓜', '劈瓜', '旋瓜'],
  },
  112: {
    name: '犽月流空',
    move: ['月樱流', '月犽流', '月骁流', '月霜流', '月驰流', '月隐流'],
  },
  113: {
    name: '闪电貂手',
    move: ['闪电貂', '貂影瞬袭'],
  },
  114: {
    name: '连城剑法',
    move: ['西辞黄鹤楼', '三月下扬州', '远影碧空尽', '长江天际流', '连城破阵'],
  },
  115: {
    name: '三花聚顶掌',
    move: ['炼精化气', '炼气化神', '炼神还虚'],
  },
  116: {
    name: '妙手空空',
    move: ['探云手', '揽月手'],
  },
  117: {
    name: '分筋错骨手',
    move: ['腋底偷桃', '截肘扣带', '分筋错骨'],
  },
  118: {
    name: '化骨绵掌',
    move: ['积毁销骨', '挫骨扬灰', '敲骨吸髓', '百鬼恸哭', '绵掌化骨'],
  },
  119: {
    name: '满洲摔跤',
    move: ['拿臂踹', '倒臂踹', '背負投'],
  },
  120: {
    name: '冰蚕毒掌',
    move: ['冰消瓦解', '鲸吞蚕食', '如履薄冰', '冰毒缭绕', '蚕毒噬心'],
  },
  121: {
    name: '铁指诀',
    move: ['长风染指', '指东话西'],
  },
  122: {
    name: '天竺佛指',
    move: ['戟指怒目', '指天画地'],
  },
  123: {
    name: '夺魄指',
    move: ['迷魂夺魄', '惊魂夺魄'],
  },
  124: {
    name: '去烦恼指',
    move: ['烦心倦目', '灰身泯智', '牛山下涕'],
  },
  125: {
    name: '袖中指',
    move: ['斫头谢天', '临溪观鱼', '井底之蛙'],
  },
  126: {
    name: '兰花拂穴手',
    move: ['春深芳草尽', '夏闲独兰馨', '秋酣菊霜清'],
  },
  127: {
    name: '透骨打穴',
    move: ['封穴结脉', '透骨打穴', '戳穴截血'],
  },
  128: {
    name: '一指禅',
    move: ['一指头禅', '一指破天', '一指圆寂'],
  },
  129: {
    name: '旋风扫叶腿',
    move: ['风起涟漪', '落叶知秋', '天旋地转', '旋风裂地', '扫叶惊鸿'],
  },
  130: {
    name: '玄天指',
    move: ['剖玄析微', '钩玄提要', '玄裳缟衣'],
  },
  131: {
    name: '黑风指',
    move: ['阴风愁肠', '捕风捉影', '凄风苦雨'],
  },
  132: {
    name: '多罗叶指',
    move: ['佛陀问路', '雷音佛声', '五丁开山'],
  },
  133: {
    name: '大智无定指',
    move: ['三体顶天', '托佛珈蓝', '无踪无定', '大智若愚', '无定破疑'],
  },
  134: {
    name: '凝血神爪',
    move: ['风驰电掣', '阴凝坚冰', '黄石纳履', '逆挽天华', '凝血封脉'],
  },
  135: {
    name: '大力金刚指',
    move: ['金刚揭谛', '正骨松筋', '金刚菩提', '铁指拔钉', '金刚震脉', '金刚般若'],
  },
  136: {
    name: '无相劫指',
    move: ['天保九如', '天马行空', '天地玄黄', '千劫不动', '金刚无相', '天火焚城'],
  },
  137: {
    name: '拈花指',
    move: ['花供佛残', '折花修佛', '拈花一笑', '佛拜昙花', '拈花点穴'],
  },
  138: {
    name: '参合指',
    move: ['国破山河在', '感时花溅泪', '锋火连三月', '兵败参合陂', '顾盼子孙贤', '铭记复国志'],
  },
  139: {
    name: '玉女素心剑',
    move: ['清饮小酌', '浪迹天涯', '举案齐眉', '皓腕玉镯', '冷月窥人', '竹帘临池'],
  },
  140: {
    name: '达摩剑法',
    move: ['万事随缘往', '来去若梦行', '浮世沧桑远', '轮回法舟轻', '达摩渡厄'],
  },
  141: {
    name: '百胜刀法',
    move: ['却月天戈', '孤月寒江', '寒光百刃', '百战百胜', '胜刃断锋'],
  },
  142: {
    name: '妙笔丹青',
    move: ['妙笔生花', '神笔马良', '神封太渊', '铁血丹心', '丹青点穴'],
  },
  143: {
    name: '铁剑诀',
    move: ['铁面无私', '铁树开花', '铁证如山', '铁杵磨针', '铁剑破甲'],
  },
  144: {
    name: '金刚不坏体',
    move: ['金刚不坏体'],
  },
  145: {
    name: '飞天神行',
    move: ['飞天神行'],
  },
  146: {
    name: '神行百变',
    move: ['神行百变'],
  },
  147: {
    name: '凌波微步',
    move: ['凌波微步'],
  },
  148: {
    name: '天罗地网',
    move: ['天罗地网'],
  },
  149: {
    name: '梯云纵横',
    move: ['梯云纵横'],
  },
  150: {
    name: '瞬息千里',
    move: ['瞬息千里'],
  },
  151: {
    name: '斩流剑术',
    move: ['一念无量', '现世执妄', '悟入幻想', '草木成佛', '天人五衰', '六根清净'],
  },
  152: {
    name: '太虚剑意',
    move: ['太虚剑意'],
  },
  153: {
    name: '沧溟刀法',
    move: ['冷月分辉', '银河共影', '沧海遗珠', '陵谷沧桑', '溟思苦想', '溟顽不灵'],
  },
  154: {
    name: '玉女心经',
    move: ['玉女心经'],
  },
  155: {
    name: '火枪',
    move: ['射击', '齐射', '钓瓶击', '三段击', '飞鸟击', '乱射'],
  },
  156: {
    name: '越女剑法',
    move: ['电照长空', '仙猿剑舞', '越畔之思', '天女散花', '诛天凌神', '天仙剑影'],
  },
  157: {
    name: '枣核钉',
    move: ['囫囵吞枣', '付之梨枣', '透骨腐肉', '瞬狱一杀', '枣核透心'],
  },
  158: {
    name: '五轮大转',
    move: ['天高云淡', '天灾人祸', '天魔降伏', '天移日易', '天罡震烈', '天舞宝轮'],
  },
  159: {
    name: '苍狼战戟',
    move: ['苍髯如戟', '染苍染黄', '鬼哭狼嚎', '狼烟四起', '魔澜惊炽', '罗摩沌灭'],
  },
  160: {
    name: '天魔功',
    move: ['天魔功'],
  },
  161: {
    name: '玄女剑法',
    move: ['碧落穹苍', '飞花逐蝶', '月下花前'],
  },
  162: {
    name: '狂风快剑',
    move: ['一叶扁舟', '天外飞龙', '风驰云卷', '长风破浪', '狂风裂剑'],
  },
  163: {
    name: '血河神鉴',
    move: ['血河神鉴'],
  },
  164: {
    name: '白蟒鞭法',
    move: ['残烛引月', '杯弓蛇影', '白璧微瑕', '晦蟒否塞', '蟒鞭缠喉'],
  },
  165: {
    name: '呼延枪法',
    move: ['呼颈举踵', '冲锋陷阵'],
  },
  166: {
    name: '天池心法',
    move: ['天池心法'],
  },
  167: {
    name: '青莲剑法',
    move: ['长风万里', '对酣高楼', '蓬莱文章', '小谢清发', '青天览月', '对酒当歌'],
  },
  168: {
    name: '逍遥神剑',
    move: [
      '既不回头',
      '何必不忘',
      '既然无缘',
      '何需誓言',
      '今日种种',
      '似水无痕',
      '明夕何夕',
      '君已陌路',
    ],
  },
  169: {
    name: '瑜伽密乘',
    move: ['瑜伽密乘'],
  },
  170: {
    name: '三阴腐尸掌',
    move: ['行尸走肉', '尸居余气', '三尸五鬼', '阴风蚀骨', '绝阴断脉', '尸山血海'],
  },
  171: {
    name: '太极神功',
    move: ['太极神功'],
  },
  172: {
    name: '潮汐神功',
    move: ['潮汐神功'],
  },
  173: {
    name: '千手如来掌',
    move: ['清风拂桂', '仰月承霖', '风满长空', '四方散花', '如来托掌'],
  },
  174: {
    name: '阴风刀',
    move: ['鬼魅魍魉', '尸鬼封尽', '阴风阵阵', '利刃寒锋', '阴刀索命'],
  },
  175: {
    name: '五岳剑诀',
    move: ['五岳剑诀'],
  },
  176: {
    name: '归藏八剑',
    move: ['乾剑道', '坤剑道', '离剑道', '艮剑道', '同人剑', '小畜剑', '大有剑', '明夷剑'],
  },
  177: {
    name: '忘情天书',
    move: ['忘情天书'],
  },
  178: {
    name: '浣花剑法',
    move: ['浣花剑法', '花影随行', '浣溪剑舞', '花刃破风', '浣花逐影'],
  },
  179: {
    name: '碧海惊涛掌',
    move: ['长风破浪', '碧波汹涌', '惊涛骇浪', '白浪滔天', '波谲云诡', '碧海长空'],
  },
  180: {
    name: '鲸息功',
    move: ['鲸息功'],
  },
  181: {
    name: '井月八法',
    move: ['不攻', '击奇', '兵诈', '方圆', '守拙'],
  },
  182: {
    name: '小李飞刀',
    move: ['探花一掷', '寒星一点', '柳叶飞梭', '飞花连珠', '天地一刀', '探花绝响'],
  },
  183: {
    name: '不老长春功',
    move: ['不老长春功'],
  },
  184: {
    name: '九霄仙息',
    move: ['九霄仙息'],
  },
  185: {
    name: '阳春白雪曲',
    move: ['宫', '商', '角', '徵', '羽', '清角'],
  },
  186: {
    name: '一苇渡江',
    move: ['一苇渡江'],
  },
  187: {
    name: '擒龙手',
    move: ['羚羊挂角', '倏然而至', '手到擒来', '徒手擒龙', '龙擒九霄'],
  },
  188: {
    name: '猿公剑法',
    move: ['剑气长空', '剑灵寰宇', '剑主天地', '剑破苍穹', '猿啸剑鸣'],
  },
  189: {
    name: '般若掌',
    move: ['童子拜佛', '礼戒四参', '一拍两散', '观照般若', '妄想皆无', '大梵般若'],
  },
  190: {
    name: '大周天功',
    move: ['大周天功'],
  },
  191: {
    name: '奔雷手',
    move: ['轰雷贯耳', '雷鸣瓦釜', '平地风雷', '电闪雷鸣', '雷手破山'],
  },
  192: {
    name: '追魂夺命剑',
    move: ['孟婆灌汤', '一剑封喉', '神驼骏足', '勾魂摄魄', '目断魂销', '追魂夺命'],
  },
  193: {
    name: '庖丁解牛刀法',
    move: ['族庖月更刀', '良庖岁更刀', '无厚入有间'],
  },
  194: {
    name: '袈裟伏魔功',
    move: ['菩提上首', '处众人天', '龙披免难', '得成佛道', '袈裟镇魔'],
  },
  195: {
    name: '迷踪连环腿',
    move: ['灭景追风', '驷马不追', '穷追不舍', '追云逐电', '迷踪踏雪'],
  },
  196: {
    name: '铁布衫',
    move: ['铁布衫'],
  },
  197: {
    name: '无极玄功拳',
    move: ['冲天炮', '铁牛耕地', '仙鹤亮翅'],
  },
  198: {
    name: '岳王散手',
    move: ['黑虎剪尾', '上动不停', '饱虎登山', '黑虎剪', '岳王破阵'],
  },
  199: {
    name: '武穆遗书',
    move: ['武穆遗书'],
  },
  200: {
    name: '岳家枪法',
    move: ['锁喉枪', '一夫当关', '枕戈待旦', '烽火连城', '满江红', '踏破龙城'],
  },
  201: {
    name: '寒袖拂穴',
    move: ['春寒乍暖', '寒泉滞骨', '独立寒秋', '寒月笼纱', '袖拂寒穴'],
  },
  202: {
    name: '白虹掌力',
    move: ['隐若白虹起', '呼气成白虹', '白虹为贯日', '薄暮垂虹去', '虹力裂空'],
  },
  203: {
    name: '长生诀',
    move: ['长生诀'],
  },
  204: {
    name: '擒龙功',
    move: ['擒龙功'],
  },
  205: {
    name: '震天铁掌',
    move: ['震响十里', '隔山打牛', '熔金碎石', '如雷贯耳', '铁掌震天'],
  },
  206: {
    name: '呼延十八鞭',
    move: ['毒龙出洞', '行步蹬虎'],
  },
  207: {
    name: '枯荣禅功',
    move: ['枯荣禅功'],
  },
  208: {
    name: '少林心法',
    move: ['少林心法'],
  },
  209: {
    name: '武当心法',
    move: ['武当心法'],
  },
  210: {
    name: '全真心法',
    move: ['全真心法'],
  },
  211: {
    name: '古墓心法',
    move: ['古墓心法'],
  },
  212: {
    name: '华山心法',
    move: ['华山心法'],
  },
  213: {
    name: '嵩山心法',
    move: ['嵩山心法'],
  },
  214: {
    name: '血刀心法',
    move: ['血刀心法'],
  },
  215: {
    name: '莲花功',
    move: ['莲花功'],
  },
  216: {
    name: '寒冰真气',
    move: ['寒冰真气'],
  },
  217: {
    name: '地火功',
    move: ['地火功'],
  },
  218: {
    name: '峨眉心法',
    move: ['峨眉心法'],
  },
  219: {
    name: '小星罗功',
    move: ['小星罗功'],
  },
  220: {
    name: '五毒神功',
    move: ['五毒神功'],
  },
  221: {
    name: '阴阳无极功',
    move: ['阴阳无极功'],
  },
  222: {
    name: '天道剑势',
    move: ['道亦不变', '天道恢恢', '天地无极', '道不相谋', '无我无剑', '八荒归元'],
  },
  223: {
    name: '金雁功',
    move: ['金雁功'],
  },
  224: {
    name: '蛇行狸翻',
    move: ['蛇行狸翻'],
  },
  225: {
    name: '小周天功',
    move: ['小周天功'],
  },
  226: {
    name: '葵花点穴手',
    move: ['势如疾风', '快如闪电', '葵藿倾阳', '拔葵去织', '葵花向日', '点穴封脉'],
  },
  227: {
    name: '龟息功',
    move: ['龟息功'],
  },
  228: {
    name: '疯魔棍法',
    move: ['托枪上阵', '提膝托棍', '仆步摔棍', '摘心挖眉', '疯魔扫棍'],
  },
  229: {
    name: '金蛇缠丝手',
    move: ['杯弓蛇影', '灵蛇之珠', '引蛇出洞', '龙蛇飞动', '缠丝锁脉'],
  },
  230: {
    name: '八卦掌',
    move: ['倚马文路', '鸿雁出群', '闭门推月'],
  },
  231: {
    name: '八卦刀法',
    move: ['叶底藏花', '凤凰回窝', '夹马势按刀', '八卦旋刀', '刀走八卦'],
  },
  232: {
    name: '五虎棍法',
    move: ['猛虎下山', '饿虎扑食', '虎啸山林'],
  },
  233: {
    name: '神足经',
    move: ['神足经'],
  },
  234: {
    name: '五行六合掌',
    move: ['利金', '清水', '玄木', '烈火', '厚土'],
  },
  235: {
    name: '八卦心法',
    move: ['八卦心法'],
  },
  236: {
    name: '神门十三剑',
    move: ['似攻非攻', '张弛有度', '剑断长川', '华光流转', '神门点剑'],
  },
  237: {
    name: '灵鳖步',
    move: ['灵鳖步'],
  },
  238: {
    name: '浮游功',
    move: ['浮游功'],
  },
  239: {
    name: '扶摇九天',
    move: ['扶摇九天'],
  },
  240: {
    name: '流云飞袖',
    move: ['流水击石', '白云出岫', '云淡风轻', '流云四散', '袖卷流云'],
  },
  241: {
    name: '武当九阳功',
    move: ['武当九阳功'],
  },
  242: {
    name: '峨眉九阳功',
    move: ['峨眉九阳功'],
  },
  243: {
    name: '少林九阳功',
    move: ['少林九阳功'],
  },
  244: {
    name: '虎爪绝户手',
    move: ['猛虎出涧', '虎头铁尾', '饿虎扑食', '虎啸生风', '虎爪封喉'],
  },
  245: {
    name: '绕指柔剑',
    move: ['鱼跃龙门', '白猿献果', '柔月穿空'],
  },
  246: {
    name: '芙蓉金针',
    move: ['芙蓉金针', '金针穿叶', '芙蓉映月', '针影随行', '金针刺穴'],
  },
  247: {
    name: '莲花落',
    move: ['借花献佛', '莲藕同根', '步步莲花'],
  },
  248: {
    name: '铜锤手',
    move: ['剥肤锤髓', '棉裹秤锤', '击鞭锤镫', '铜锤碎骨', '锤震八方'],
  },
  249: {
    name: '回风落雁剑',
    move: ['一剑落九雁', '回风破长空', '神风划天翔'],
  },
  250: {
    name: '衡山五神剑',
    move: ['祝融剑', '紫盖剑', '石禀剑'],
  },
  251: {
    name: '镇岳诀',
    move: ['镇岳诀'],
  },
  252: {
    name: '无妄神功',
    move: ['无妄神功'],
  },
  253: {
    name: '大长和诀',
    move: ['大长和诀'],
  },
  254: {
    name: '伏魔剑法',
    move: ['韦陀宝杵', '霞光神兽', '神魔辟易'],
  },
  255: {
    name: '天长掌法',
    move: ['敬捧宝经', '春去秋来'],
  },
  256: {
    name: '春蚕掌法',
    move: ['春蚕结丝', '春蚕破茧', '千丝万绕'],
  },
  257: {
    name: '乞儿两式',
    move: ['伸手', '要饭'],
  },
  258: {
    name: '定神静心剑',
    move: ['以静制动', '心静则凉', '静由心生', '静剑守心', '定神破妄'],
  },
  259: {
    name: '古针禅功',
    move: ['古针禅功'],
  },
  260: {
    name: '五大夫剑',
    move: ['苍翠相掩', '虬枝斜出', '五大夫松'],
  },
  261: {
    name: '七星落长空',
    move: ['来鹤清泉', '石关回马', '长空星落'],
  },
  262: {
    name: '迷踪步',
    move: ['迷踪步'],
  },
  263: {
    name: '开山掌',
    move: ['愚公移山', '泰山压顶', '三山五岳'],
  },
  264: {
    name: '浑天气功',
    move: ['浑天气功'],
  },
  265: {
    name: '参合剑气',
    move: ['北斗移辰', '参商永合', '陨石星浪', '天幻星辰', '日月星光', '乾坤星阵'],
  },
  266: {
    name: '北斗剑法',
    move: ['天枢', '天璇'],
  },
  267: {
    name: '降魔刀法',
    move: ['戒杀', '破邪', '去妄'],
  },
  268: {
    name: '回风拂柳刀',
    move: ['回风剑拂柳', '狂风剑破空', '神风剑卷地'],
  },
  269: {
    name: '八卦游龙掌',
    move: ['猛虎伏桩', '游空探爪', '龙盘八卦'],
  },
  270: {
    name: '金刚伏虎刀',
    move: ['虎踞龙蟠', '游龙出水', '云起龙骧', '伏虎斩刃', '金刚镇虎'],
  },
  271: {
    name: '周公剑法',
    move: ['天如穹庐', '白雾茫茫', '斜风细雨', '暮短夜长', '周公解梦剑'],
  },
  272: {
    name: '大嵩阳掌',
    move: ['破山斧', '千掌环', '无影掌', '万丈烈阳', '嵩阳焚天'],
  },
  273: {
    name: '寒冰神掌',
    move: ['冰封千里', '天寒地冻', '连绵冰山'],
  },
  274: {
    name: '快慢十八路',
    move: ['快剑式', '慢剑式', '拖剑式'],
  },
  275: {
    name: '子午十二剑',
    move: ['开门见嵩', '千古人龙', '游剑子午'],
  },
  276: {
    name: '迅雷剑法',
    move: ['一字狂雷', '风雷雨急', '心雷万丈', '惊雷贯日', '雷剑破风', '迅雷不及'],
  },
  277: {
    name: '雨打飞花剑',
    move: ['泛舟听雨', '落雨散花', '乱花覆剑'],
  },
  278: {
    name: '三阴手',
    move: ['手三阴', '足三阴', '体三阴'],
  },
  279: {
    name: '落雁掌',
    move: ['雁纵如烟', '雁影若墨', '雁翼似刀'],
  },
  280: {
    name: '红砂掌',
    move: ['朱笔红砂', '处子红砂', '铸铁红砂'],
  },
  281: {
    name: '蝎尾钩',
    move: ['蝎尾钩', '蝎毒勾魂', '尾钩裂肤', '灵蝎摆尾', '钩锁经脉'],
  },
  282: {
    name: '喂毒丧门钉',
    move: ['如丧考妣', '丧魂失魄', '丧天害理'],
  },
  283: {
    name: '同归剑法',
    move: ['同归于尽', '生死两茫', '天地同寿', '同归破阵', '剑殉同归'],
  },
  284: {
    name: '一气化三清',
    move: ['元始', '灵宝', '太上', '三清归一', '道气长存', '清浊分明'],
  },
  285: {
    name: '履霜破冰拳',
    move: ['如履薄冰', '履霜坚冰', '破冰而行'],
  },
  286: {
    name: '昊天掌',
    move: ['肇化荒宇', '阴阳相克', '玄德乾坤', '其羽可用', '昊天罔极', '皇极生玄'],
  },
  287: {
    name: '飘雪穿云掌',
    move: ['水拍云崖', '云海明灯', '罡风推云', '雪落云飞', '穿云击雪', '雪锁云关'],
  },
  288: {
    name: '金顶绵掌',
    move: ['金顶佛光', '逆流捧沙'],
  },
  289: {
    name: '四象掌',
    move: ['太极生两仪', '两仪生四象', '四象生八卦'],
  },
  290: {
    name: '佛光普照',
    move: ['云开月明', '光芒普照', '佛光盛世', '佛光护体', '普照渡厄'],
  },
  291: {
    name: '金顶九式',
    move: ['金三式', '顶三式', '后三式', '金顶镇岳', '九式归宗'],
  },
  292: {
    name: '截手九式',
    move: ['侧截三式', '反截三式', '正截三式'],
  },
  293: {
    name: '霹雳雷火弹',
    move: ['雷火侵身', '天雷地火', '霹雳雷火', '雷火焚心', '火弹破阵', '霹雳惊天'],
  },
  294: {
    name: '抽髓掌',
    move: ['抽骨髓', '抽脑髓'],
  },
  295: {
    name: '连环腐尸毒',
    move: ['腐尸毒', '炼心弹', '碧焰滔天', '摧枯折腐', '腐毒连环'],
  },
  296: {
    name: '星宿心法',
    move: ['星宿心法'],
  },
  297: {
    name: '三笑逍遥散',
    move: ['似笑非笑', '宜笑宜颦', '先笑后号', '笑里藏毒', '逍遥笑杀'],
  },
  298: {
    name: '三无三不手',
    move: ['无孔不入', '无所不为', '无处不至'],
  },
  299: {
    name: '银拂尘功',
    move: ['拂尘扫天', '拂尘扫地', '拂尘扫人', '拂尘点穴', '尘影缠丝'],
  },
  300: {
    name: '玉蜂针',
    move: ['玉蜂针', '蜂影漫射', '寒针点穴'],
  },
  301: {
    name: '冰魄银针',
    move: ['冰魄银针', '冰魄蚀骨', '银针透寒', '寒针追影', '魄针封脉'],
  },
  302: {
    name: '宁氏一剑',
    move: ['巾帼须眉', '铿锵玫瑰', '无双无对'],
  },
  303: {
    name: '玉女十九式',
    move: ['玉女穿针', '银光飞舞', '青山隐隐'],
  },
  304: {
    name: '夺命三仙剑',
    move: ['苍松迎客', '有凤来仪', '白虹贯日', '仙剑夺命', '三剑归魂'],
  },
  305: {
    name: '劈石破玉拳',
    move: ['一叶扁舟', '天外飞龙', '劈石破玉', '玉碎拳鸣', '破石惊天'],
  },
  306: {
    name: '混元掌',
    move: ['引元归田', '灵元归天', '抱元归一', '元元融金', '混元破气'],
  },
  307: {
    name: '伏虎拳',
    move: ['倒扭金钟', '深入虎穴', '左伏右击'],
  },
  308: {
    name: '鹰蛇生死搏',
    move: ['鹰抓', '蛇缠', '鹰叼蛇咬', '鹰击蛇窜', '生死相搏'],
  },
  309: {
    name: '泼墨披麻剑',
    move: ['点墨剑式', '泼墨剑式', '沾墨剑式', '游墨剑式', '墨剑含锋'],
  },
  310: {
    name: '无影脚',
    move: ['声东击西', '扑朔迷离', '眼花缭乱', '虚无飘渺', '无影破风'],
  },
  311: {
    name: '丹青破穴',
    move: ['截脉点穴', '凌空打穴'],
  },
  312: {
    name: '葵元引魂针',
    move: ['黑雨初放', '毒针噬影', '暗血追魂', '黑芒封喉', '黑血骤雨'],
  },
  313: {
    name: '阴葵灭魂针',
    move: ['穿针引钱', '千劫连环', '心劫魔针', '万花归寂', '红线追魂', '百劫轮回'],
  },
  314: {
    name: '段家指法',
    move: ['大理段氏', '思平皇室'],
  },
  315: {
    name: '五罗轻烟掌',
    move: ['烟散', '烟起', '烟尽'],
  },
  316: {
    name: '碧海潮生曲',
    move: ['碧海无量', '滔滔不绝', '潮起潮落', '潮声扰心', '生曲破功'],
  },
  317: {
    name: '奇门五转',
    move: ['奇门五转'],
  },
  318: {
    name: '劈空掌',
    move: ['醋手浸空', '歪斜不称', '疏疏落落'],
  },
  319: {
    name: '碧波掌',
    move: ['掌势如波', '重重递进'],
  },
  320: {
    name: '落英剑法',
    move: ['催银箭', '玉漏银壶', '铁关金锁'],
  },
  321: {
    name: '一字电剑',
    move: ['如电', '如雷'],
  },
  322: {
    name: '连环十八破',
    move: ['青字九打', '城字九破', '打破连环'],
  },
  323: {
    name: '雷公轰',
    move: ['春雷乍动', '霹雷坠地', '地雷母纲', '雷公震怒', '轰天裂地'],
  },
  324: {
    name: '袖里乾坤',
    move: ['春雷乍动', '霹雷坠地', '地雷母纲', '袖藏天地', '乾坤一掷'],
  },
  325: {
    name: '逍遥心法',
    move: ['逍遥心法'],
  },
  326: {
    name: '八仙剑法',
    move: ['钟离扇风', '铁拐洞玄', '纯阳舞剑'],
  },
  327: {
    name: '天遁剑法',
    move: ['一剑相传', '天地山河', '六天成尘', '星辰月遁', '遁影藏锋', '天剑遁形'],
  },
  328: {
    name: '摧心掌',
    move: ['心力交瘁', '撕心裂肺', '呕心沥血', '摧心裂胆', '掌碎心脉'],
  },
  329: {
    name: '黑沙掌',
    move: ['黑沙式', '黑掌式', '毒沙式'],
  },
  330: {
    name: '毒龙锥',
    move: ['黑沙式', '黑掌式', '毒沙式'],
  },
  331: {
    name: '天机掌法',
    move: ['廉贞式', '天府式'],
  },
  332: {
    name: '三蜈五蟆烟',
    move: ['血矮栗', '鬼蝙蝠'],
  },
  333: {
    name: '自创武功',
    move: ['自创武功'],
  },
  334: {
    name: '千蛛万毒手',
    move: ['百毒侵', '千蛛劫', '万蛊流'],
  },
  335: {
    name: '天刀九问',
    move: ['上下未形', '阴阳三合', '地方九则', '增城九重', '焉有蛅龙', '天命反侧'],
  },
  336: {
    name: '上清快剑',
    move: ['无尘剑势', '无影剑势', '无意剑势', '无动剑势', '上清破尘'],
  },
  337: {
    name: '六合刀法',
    move: ['大圣劈卦', '二郎举卦'],
  },
  338: {
    name: '雁行刀',
    move: ['云中寄书', '片影相失', '木落南渡'],
  },
  339: {
    name: '华岳三神峰',
    move: ['粉石碎玉', '混沌一破', '两拳一刀', '岳峰压顶', '神峰破阵'],
  },
  340: {
    name: '大九天手',
    move: ['中天手', '从天手', '碎天手', '镇天手', '覆天手', '擎天手'],
  },
  341: {
    name: '狂风迅雷扇',
    move: ['狂风急雷', '狂风疾速', '狂风迅雨'],
  },
  342: {
    name: '大伏魔拳',
    move: ['道高一尺', '魔高一丈', '群魔乱舞', '伏魔卫道', '魔消道长', '伏魔归真'],
  },
  343: {
    name: '血饮魔刀',
    move: ['孽海茫茫', '饮恨滔天', '离经叛道', '舍神弃佛', '横行无忌', '血刃魔心'],
  },
  344: {
    name: '血刀刀法',
    move: ['血气上涌', '气血十足'],
  },
  345: {
    name: '血海魔功',
    move: ['血海魔功'],
  },
  346: {
    name: '大慈大悲手',
    move: ['培元固本', '天王托塔', '四象合一'],
  },
  347: {
    name: '韦陀掌',
    move: ['灵山礼佛', '山门护法', '只为韦陀'],
  },
  348: {
    name: '大阴阳手',
    move: ['嵩阳大悲赋', '嵩寒大悲赋', '阴阳大悲赋', '阳和大悲赋', '阴凝大悲赋', '阴阳相济赋'],
  },
  349: {
    name: '幻尘身法',
    move: ['幻尘身法'],
  },
  350: {
    name: '阿难破戒刀',
    move: ['断清净', '落红尘', '积业力'],
  },
  351: {
    name: '金龙鞭法',
    move: ['裂石式', '断川式'],
  },
  352: {
    name: '碧针清掌',
    move: ['松针细叶', '鼓荡松针', '随风而舞', '针掌合一', '清掌破邪'],
  },
  353: {
    name: '天机心法',
    move: ['天机心法'],
  },
  354: {
    name: '通幽诀',
    move: ['通幽诀'],
  },
  355: {
    name: '天龙心法',
    move: ['天龙心法'],
  },
  356: {
    name: '剑华皈壹',
    move: ['剑华皈壹'],
  },
  357: {
    name: '释迦掷象功',
    move: ['释迦掷象功'],
  },
  358: {
    name: '天王刀法',
    move: ['天大地大', '托塔天王', '天王老子', '天无二日', '王刀镇世'],
  },
  359: {
    name: '蓝砂手',
    move: ['蓝砂石', '蓝砂雾'],
  },
  360: {
    name: '云体风身',
    move: ['云体风身'],
  },
  361: {
    name: '峻岭横空',
    move: ['峻岭横空'],
  },
  362: {
    name: '灵犀分水功',
    move: ['灵犀分水功'],
  },
  363: {
    name: '太乙分光剑',
    move: ['一元复始', '二曰归藏', '三曰周易', '四象连山', '五行为卦', '万象天引'],
  },
  364: {
    name: '恒山身法',
    move: ['恒山身法'],
  },
  365: {
    name: '圣火令刀法',
    move: ['石火电光', '火中取栗', '明火执仗', '星火不息', '烽火连天', '圣火长明'],
  },
  366: {
    name: '雁行功',
    move: ['雁行功'],
  },
  367: {
    name: '东鳞西爪功',
    move: ['一鳞半爪', '鳞次栉比', '鸟集鳞萃', '鸿爪春泥', '鳞爪破功'],
  },
  368: {
    name: '普渡杖法',
    move: ['沙弥拜山', '罗汉睡梦'],
  },
  369: {
    name: '韦陀棍法',
    move: ['伏虎听风', '红霞贯日', '黄石纳履'],
  },
  370: {
    name: '北岳神剑',
    move: ['白云出岫', '有凤来仪', '天绅倒悬', '苍松迎客', '浪子回头', '白虹贯日'],
  },
  371: {
    name: '中岳神剑',
    move: ['却步抽剑', '拨云射日', '大鹏展翅', '野马跳涧', '临溪观渔', '长空雷隐'],
  },
  372: {
    name: '南岳神剑',
    move: ['金雁横空', '望牛折尾', '风雷不及', '竹林初虹', '峰回路转', '神女补天'],
  },
  373: {
    name: '东岳神剑',
    move: ['望天门', '上天梯', '踏虹桥', '伐桂树', '破九重', '射金鸟'],
  },
  374: {
    name: '西岳神剑',
    move: ['小楼听夜雨', '独自依阑干', '黑云欲摧城', '雷公行疾电', '鸿雁正回归', '冰河入梦来'],
  },
  375: {
    name: '穿花蝶影手',
    move: ['庄周梦蝶', '花须蝶芒', '镜花水月'],
  },
  376: {
    name: '太清剑法',
    move: ['察君神静', '一夕药成', '相与太清', '清虚无为', '太清归道', '道合太清'],
  },
  377: {
    name: '灵枢灵玄指',
    move: ['虚怀若无', '静若处子', '瞻忽在前', '微尘不惊', '瞻忽在后', '姑射仙人'],
  },
  378: {
    name: '玉碎掌',
    move: ['抛砖引玉', '碎琼乱玉', '金声玉振', '鼎铛玉石', '兰摧玉折'],
  },
  379: {
    name: '十方步',
    move: ['十方步'],
  },
  380: {
    name: '青城身法',
    move: ['青城身法'],
  },
  381: {
    name: '武当剑法',
    move: ['松沉自然', '松腰沉跨'],
  },
  382: {
    name: '屠龙刀法',
    move: ['叶公好龙', '鱼龙曼衍', '鳌愤龙愁', '烹龙炮凤', '屠龙斩刃'],
  },
  383: {
    name: '武当身法',
    move: ['武当身法'],
  },
  384: {
    name: '少林身法',
    move: ['少林身法'],
  },
  385: {
    name: '逍遥身法',
    move: ['逍遥身法'],
  },
  386: {
    name: '日月身法',
    move: ['日月身法'],
  },
  387: {
    name: '圣火身法',
    move: ['圣火身法'],
  },
  388: {
    name: '全真身法',
    move: ['全真身法'],
  },
  389: {
    name: '莲花身法',
    move: ['莲花身法'],
  },
  390: {
    name: '华山身法',
    move: ['华山身法'],
  },
  391: {
    name: '嵩山身法',
    move: ['嵩山身法'],
  },
  392: {
    name: '云龙三现',
    move: ['云龙三现'],
  },
  393: {
    name: '血刀身法',
    move: ['血刀身法'],
  },
  394: {
    name: '踏雪无痕',
    move: ['踏雪无痕'],
  },
  395: {
    name: '雪山身法',
    move: ['雪山身法'],
  },
  396: {
    name: '飞鸿雪泥',
    move: ['飞鸿雪泥'],
  },
  397: {
    name: '梅花桩',
    move: ['梅花桩'],
  },
  398: {
    name: '青龙刀法',
    move: [
      '关公提刀过霸桥',
      '白云盖顶逞英豪',
      '举刀磨旗怀抱月',
      '上三刀吓杀许褚',
      '下三刀惊退曹操',
      '白猿拖刀上九宵',
    ],
  },
  399: {
    name: '崆峒身法',
    move: ['崆峒身法'],
  },
  400: {
    name: '移形换影',
    move: ['移形换影'],
  },
  401: {
    name: '昆仑身法',
    move: ['昆仑身法'],
  },
  402: {
    name: '雷光疾影',
    move: ['雷光疾影'],
  },
  403: {
    name: '桃花身法',
    move: ['桃花身法'],
  },
  404: {
    name: '登萍渡水',
    move: ['登萍渡水'],
  },
  405: {
    name: '白驼身法',
    move: ['白驼身法'],
  },
  406: {
    name: '横行身法',
    move: ['横行身法'],
  },
  407: {
    name: '流星赶月',
    move: ['流星赶月'],
  },
  408: {
    name: '八卦身法',
    move: ['八卦身法'],
  },
  409: {
    name: '玄机步',
    move: ['玄机步'],
  },
  410: {
    name: '慕容身法',
    move: ['慕容身法'],
  },
  411: {
    name: '燕子三抄水',
    move: ['燕子三抄水'],
  },
  412: {
    name: '天龙身法',
    move: ['天龙身法'],
  },
  413: {
    name: '龙行虎步',
    move: ['龙行虎步'],
  },
  414: {
    name: '星宿身法',
    move: ['星宿身法'],
  },
  415: {
    name: '摘星揽月',
    move: ['摘星揽月'],
  },
  416: {
    name: '密宗身法',
    move: ['密宗身法'],
  },
  417: {
    name: '金刚幻相',
    move: ['金刚幻相'],
  },
  418: {
    name: '藏剑身法',
    move: ['藏剑身法'],
  },
  419: {
    name: '玉泉鱼跃',
    move: ['玉泉鱼跃'],
  },
  420: {
    name: '绝情刀法',
    move: ['断情斩', '孤影回锋', '绝念破山', '寒心刺骨', '无情连环'],
  },
  421: {
    name: '泰山身法',
    move: ['泰山身法'],
  },
  422: {
    name: '五毒身法',
    move: ['五毒身法'],
  },
  423: {
    name: '古墓身法',
    move: ['古墓身法'],
  },
  424: {
    name: '草上飞',
    move: ['草上飞'],
  },
  425: {
    name: '天机身法',
    move: ['天机身法'],
  },
  426: {
    name: '密宗心法',
    move: ['密宗心法'],
  },
  427: {
    name: '密宗刀法',
    move: ['宝瓶式', '银鱼式'],
  },
  428: {
    name: '峨眉身法',
    move: ['峨眉身法'],
  },
  429: {
    name: '魅影空蝉',
    move: ['魅影空蝉'],
  },
  430: {
    name: '天霜拳',
    move: ['踏云追风', '霜天击雪', '寒霜凝拳', '霜拳裂石', '天霜覆世'],
  },
  431: {
    name: '风神腿',
    move: ['风霜扑面', '霜寒抱月', '霜结中霄', '霜冷长河', '霜雪冰山'],
  },
  432: {
    name: '排云掌',
    move: ['捕风捉影', '风中劲草', '暴雨狂风', '雷厉风行', '风卷残云', '神风怒号'],
  },
  433: {
    name: '三分归元气',
    move: ['三分归元气'],
  },
  434: {
    name: '三分神指',
    move: ['一分破气', '二分裂脉', '三分锁魂', '神指点穴', '分劲御敌', '神指归宗'],
  },
  435: {
    name: '踏云追风',
    move: ['踏云追风'],
  },
  436: {
    name: '血神经',
    move: ['血神经'],
  },
  437: {
    name: '华山拳法',
    move: ['一分为二', '断玉分金'],
  },
  438: {
    name: '逍遥掌法',
    move: ['闲庭信步', '金玉凭栏'],
  },
  439: {
    name: '明教心法',
    move: ['明教心法'],
  },
  440: {
    name: '吐纳法',
    move: ['吐纳法'],
  },
  441: {
    name: '提纵术',
    move: ['提纵术'],
  },
  442: {
    name: '周流水元功',
    move: ['周流水元功'],
  },
  443: {
    name: '天机指法',
    move: ['乾坤断法', '怒指千夫'],
  },
  444: {
    name: '日月心法',
    move: ['日月心法'],
  },
  445: {
    name: '修罗阴煞功',
    move: ['修罗阴煞功'],
  },
  446: {
    name: '丐帮心法',
    move: ['丐帮心法'],
  },
  447: {
    name: '日月玄功',
    move: ['日月玄功'],
  },
  448: {
    name: '阴葵剑法',
    move: ['寒葵敛影', '阴葵望月', '葵水缠风', '阴丝绕剑', '寒葵腐骨'],
  },
};
