export default {
  1: {
    id: 1,
    name: '流血',
  },
  2: {
    id: 2,
    name: '封穴',
  },
  3: {
    id: 3,
    name: '灼烧',
  },
  4: {
    id: 4,
    name: '冰封',
  },
  5: {
    id: 5,
    name: '内伤',
  },
  6: {
    id: 6,
    name: '中毒',
  },
  7: {
    id: 7,
    name: '冻结',
  },
  8: {
    id: 8,
    name: '点燃',
  },
  9: {
    id: 9,
    name: '剧毒',
  },
  10: {
    id: 10,
    name: '眩晕',
  },
  11: {
    id: 11,
    name: '撕裂',
  },
  12: {
    id: 12,
    name: '虚弱',
  },
  13: {
    id: 13,
    name: '破防',
  },
  14: {
    id: 14,
    name: '无视系数',
  },
  15: {
    id: 15,
    name: '固定伤害',
  },
  16: {
    id: 16,
    name: '吸血',
  },
  17: {
    id: 17,
    name: '减防',
  },
  18: {
    id: 18,
    name: '减攻',
  },
  19: {
    id: 19,
    name: '破气防',
  },
  20: {
    id: 20,
    name: '范围伤害',
  },
  21: {
    id: 21,
    name: '再次行动',
  },
  22: {
    id: 22,
    name: '加速',
  },
  23: {
    id: 23,
    name: '加连击',
  },
  24: {
    id: 24,
    name: '加暴击',
  },
  25: {
    id: 25,
    name: '加暴伤',
  },
  26: {
    id: 26,
    name: '必中',
  },
  27: {
    id: 27,
    name: '防御',
  },
  28: {
    id: 28,
    name: '回气',
  },
  29: {
    id: 29,
    name: '锁足',
  },
  30: {
    id: 30,
    name: '反击',
  },
  31: {
    id: 31,
    name: '加格档',
  },
  32: {
    id: 32,
    name: '加命中',
  },
  33: {
    id: 33,
    name: '散功',
  },
  34: {
    id: 34,
    name: '外伤',
  },
  35: {
    id: 35,
    name: '混乱',
  },
  36: {
    id: 36,
    name: '恐惧',
  },
};
