export default {
  name: '攻略',
  exclusive: '',
  list: [
    {
      id: 'shi',
      name: '势',
      level: 4,
      content: `
适用于100周 地狱 开局 攻略  （适合新手，低难度 按照这个开局就随便玩）

开局 ：尽量选择阴内 ，前期阴内的经脉更强  ，除非是开局需要练阳内的武功

开局可以选择的 强力 天赋  ： 
TOP   白驹过隙（ 几乎必选）
      破苍穹
七星海棠 
剑心通明（剑法必中）
备选：碧海潮声 ，可以配合七星海棠
升一流和豪侠可以选择  冰骨玉肌 
升宗师 个人考虑了 千变万劫

秘技 选择
绝处逢生：海叟钓法+银锁金玲  （最高优先级，相当于15% 额外的闪避，必学）
素质三连：三分剑法+连城剑法  
毒布武林：五毒神功+五毒神掌+千蛛万毒手+连环腐尸毒+冰蚕毒掌
万象天引：北冥神功+吸星大法+乾坤大挪移  （高资 考虑）  

外功 选择（前者过度或者获取难度低）
剑法：玄铁剑法  ，后期独孤九剑
刀法：屠龙刀法 （商店买） 燃木刀法（阳内） ，后期天刀九问
拳法：须弥山神掌 （获取难度低，一直用到结束）
指法 :九阴白骨爪 ，后期 六脉神剑
奇门：银索金铃 ，后期打狗棒法或者灵蛇仗法  （奇门还没完， 应该目前最弱鸡）

内功 选择
初期小无相功， 中期龙象般若功
后期葵花宝典 天魔功 太玄经（目前弱）
其他需要点经脉的内功比如紫霞 神照

轻功：前期白嫖瞬息千里，后期凌波微步或者十方步（只能加入天机宫或者擂台习得）

中前期遇到防御过高的NPC ，可以考虑 龙象蓄力 ，然后大招爆发

开局简易流程：
1. 明霞岛拿千年灵芝， 如果直接搜刮灵芝变雪莲  ，不加门派扬州武馆可学武功，华山派就直接加入吧，因为初始笑傲剧情后就无法再加入
2. 江陵天宁寺 先偷窃10次，道德归零
3. 回家 全搜 + 开宝箱，（可关闭心魔和天气），龙门客栈买皮衣（减冰封）
4. 如果走射雕邪，进行到洪七公局，获得瞬息千里 可考虑直接练  ，然后天宁寺 捐献 慈悲 道德65
5. 古墓收龙女 ，装备拳套，第一格古墓心法，回家吃掉包里的 千年灵芝和大蟠桃，然后家里炼丹炉练12个 玉笛谁家听落梅 吃掉加血上限，剩下的 银两全部买食材 练腊八粥大 全部吃掉. 去扬州武馆第二格鱼叟钓法 ，有门派的话就要去冲宵洞。
6. 加道德事件 （无需战斗）
唐诗山洞 收狄云 装备乌蚕衣  +2
家里给祖千秋翡翠杯子 +1
大理 收温青青+1
家里给北丑5两银子，然后去西部农村用铁铲对话 教武功+1  ，不收钱+1  。 此时道德70
倚天如果走正线 朱府 选择告诉无忌 +1
7. 去少林派练功 ，把古墓心法练满， 属性界面 点古墓心法运功 ，并且第一次战斗开始 运功选择 外功古墓心法，之后战斗就不需要设置了， 开自动就能刷少林派弟子了，  实际青城派更弱，但是少林寺目前刷一次 送一本少林心法可以卖380左右。  
注：内功只有再第一格才能攻击，因为跟过和内力挂钩，并且是按照大招算伤害，所以前期第一格的低级内功伤害 能碾压高阶外功。
8.可以去打一些门派看门，4岳+凌霄城 +铁掌山 等 ，不需要全打，个别门派弟子有点强，主要加点经脉属性，开始不要点需要100武学点的，这些也可以不打
9. 加道德事件（需要战斗） 
沧州 打范兴汗 （随便吃点药就过了，并升二流）+1，之后飞雪剧情+1 
龙门客栈 帮叮当抢酒+1，
福州 开笑傲线+1，笑傲衡阳打青城四兽+1 ，  
10. 道德75收虚竹 ，擂鼓山剧情后学 第二格 小无相功  ，内功运小无，少林寺小无练到3到4级， 实测就可以去丐帮开自动战斗了，此时可以提升小无相功和点经脉 
11. 破庙  救李文秀 道德+2 装备白马
12. 继续走笑傲 ， 华山对话岳灵珊 ，后山 打冲哥 （可败），之后回华山派 打 封不平 （只要能出手就秒杀 ，升一流），此时可以去扬州武馆学学神照经， 之前也可以先去学海叟钓法。此时 主运神照经
13. 打丐帮开门弟子， 打完一次后进入丐帮，可以和丐帮左侧的弟子对话无限战斗，此阶段刷武学点，把经脉尽量点满
14. 华山 后山 打桃谷六仙，开局后退到小路逐个击杀，回华山派 对话，练紫霞神功，  可以点 2条经脉 
一条可以获得一个玄冰界（时序无敌）
另外一条 可以获得神照经被动复活。此时 就可以根据需要加入门派了 。有了神照经被动复活很多战斗会难度下降。主运小无
15. 桃花套招亲， 打欧阳克 （可败） ，打郭靖 （胜得 千年灵芝）
16. 程英居 打李莫愁   ，获得银锁金玲 （银锁金玲+海叟钓法=秘技 绝处逢生 ，打不过就继续刷丐帮点经脉）然后去绝情谷   打公孙止  ，开启蜘蛛洞
17. 蜘蛛洞 ，进出山洞可以无限刷新蜘蛛，可以刷食材做腊八粥， 这里尽量多刷，把实战 内力 和经脉都刷起来 。剧情 后 获得低资福利 左右互搏，  练玉女心经 一脉 古墓心法 ，外功运玉女心经
18. 凤阳 帮胡青牛 打金花婆婆，
之后回家收胡青牛 王难姑  ，练毒经可以点毒经脉，毒经脉一般人物只要点100武学点的就可以了。 医书基本不考虑练，但是包里有胡青牛医书 可以在家里练出 黑玉断续膏  。 所有药材都练黑玉 。
19.	此时 已经已初步成型，就要考虑去挑战豪侠，宗师，  目前而言此时可以考虑 刷点钱20000两龙门客栈买地灵丹转阳内，神雕邪 重阳宫 拿到龙象般若功，这是中期的神级内功。
      `,
    },
  ],
};
