Card = {}
--1 生命，2 内力，3 攻击， 4 防御， 5 速度， 6 外功， 8 内功， 9 轻功 ，10 阵营， 11 天赋， 12 武器， 13 防具， 14 坐骑，
Card[1] = { {hp = 100,mp = 200,gj = 50,fy = 50,sd = 50,wg = 16,ng = 115,qg = 135,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv1
            {hp = 200,mp = 400,gj = 70,fy = 70,sd = 70,wg = 16,ng = 115,qg = 135,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv2
            {hp = 300,mp = 600,gj = 90,fy = 90,sd = 90,wg = 16,ng = 115,qg = 135,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv3
            {hp = 400,mp = 800,gj = 110,fy = 110,sd = 110,wg = 16,ng = 115,qg = 135,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},   --lv4
            name = '张三丰',--姓名
            id = 5, --战斗贴图
            pic = 5, --头像
            dh = {[1] = {15,13,11},[2] = {9,7,4}}, --出招动画帧数
}
--1 生命，2 内力，3 攻击， 4 防御， 5 速度， 6 外功， 8 内功， 9 轻功 ，10 阵营， 11 天赋， 12 武器， 13 防具， 14 坐骑，
Card[2] = { {hp = 100,mp = 200,gj = 50,fy = 50,sd = 50,wg = 26,ng = 129,qg = 214,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv1
            {hp = 200,mp = 400,gj = 70,fy = 70,sd = 70,wg = 26,ng = 129,qg = 214,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv2
            {hp = 300,mp = 600,gj = 90,fy = 90,sd = 90,wg = 26,ng = 129,qg = 214,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv3
            {hp = 400,mp = 800,gj = 110,fy = 110,sd = 110,wg = 26,ng = 129,qg = 214,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},   --lv4
            name = '乔峰',--姓名
            id = 240,--战斗贴图
            pic = 50,--头像
            dh = {[1] = {9,6,4}},--出招动画帧数
}
--1 生命，2 内力，3 攻击， 4 防御， 5 速度， 6 外功， 8 内功， 9 轻功 ，10 阵营， 11 天赋， 12 武器， 13 防具， 14 坐骑，
Card[3] = { {hp = 100,mp = 200,gj = 50,fy = 50,sd = 50,wg = 206,ng = 105,qg = 174,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv1
            {hp = 200,mp = 400,gj = 70,fy = 70,sd = 70,wg = 206,ng = 105,qg = 174,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv2
            {hp = 300,mp = 600,gj = 90,fy = 90,sd = 90,wg = 206,ng = 105,qg = 174,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv3
            {hp = 400,mp = 800,gj = 110,fy = 110,sd = 110,wg = 206,ng = 105,qg = 174,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},   --lv4
            name = '东方不败',--姓名
            id = 262,--战斗贴图
            pic = 546,--头像
            dh = {[1] = {16,11,10}},--出招动画帧数
}
--1 生命，2 内力，3 攻击， 4 防御， 5 速度， 6 外功， 8 内功， 9 轻功 ，10 阵营， 11 天赋， 12 武器， 13 防具， 14 坐骑，
Card[4] = { {hp = 100,mp = 200,gj = 50,fy = 50,sd = 50,wg = 24,ng = 108,qg = 141,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv1
            {hp = 200,mp = 400,gj = 70,fy = 70,sd = 70,wg = 24,ng = 108,qg = 141,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv2
            {hp = 300,mp = 600,gj = 90,fy = 90,sd = 90,wg = 24,ng = 108,qg = 141,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv3
            {hp = 400,mp = 800,gj = 110,fy = 110,sd = 110,wg = 24,ng = 108,qg = 141,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},   --lv4
            name = '扫地僧',--姓名
            id = 114,--战斗贴图
            pic = 114,--头像
            dh = {[1] = {13,6,5}},--出招动画帧数
}

--1 生命，2 内力，3 攻击， 4 防御， 5 速度， 6 外功， 8 内功， 9 轻功 ，10 阵营， 11 天赋， 12 武器， 13 防具， 14 坐骑，
Card[4] = { {hp = 100,mp = 200,gj = 50,fy = 50,sd = 50,wg = 24,ng = 108,qg = 141,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv1
            {hp = 200,mp = 400,gj = 70,fy = 70,sd = 70,wg = 24,ng = 108,qg = 141,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv2
            {hp = 300,mp = 600,gj = 90,fy = 90,sd = 90,wg = 24,ng = 108,qg = 141,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},      --lv3
            {hp = 400,mp = 800,gj = 110,fy = 110,sd = 110,wg = 24,ng = 108,qg = 141,zy = 0,tf = 0,wq = 0,fj = 0,zq = 0},   --lv4
            name = '扫地僧', --姓名
            id = 114, --战斗贴图
            pic = 114,--头像
            dh = {[1] = {13,6,5}},--出招动画帧数
}