function SetPersonDEC()
Dec = {}

Dec[0] = {
    "",
}
--中庸之道1
Dec[1] = {
    "Ｗ◇达成条件：修炼中庸之道",
    "Ｗ◇需资质低于80且资质大于30",
    "Ｄ中庸之道壹 天命之谓性",
    "Ｗ◇每（资质-1）时序行动一次",
    "Ｎ",
}

--中庸之道2
Dec[2] = { 
    "Ｗ◇达成条件：修炼中庸之道",
    "Ｗ◇需资质低于80且资质大于30",
    "Ｄ中庸之道贰 率性之谓道",
    "Ｎ", 
    "Ｗ◇受到攻击后如果满怒，（资质-29）%几率结束对手攻击并反击",
    "Ｎ",
}

--斗转星移
Dec[3] = {
    "Ｗ◇达成条件：修炼斗转星移",
    "Ｗ◇需资质大于79",
    "Ｗ◇北斗移辰：总兵器值<240，被攻击时50%几率触发",
    "Ｗ◇北斗移辰：以60%的威力斗转反击，并追加300点气攻",
    "Ｗ◇斗转星移：240≤总兵器值<360，被攻击时50%几率触发",
    "Ｗ◇斗转星移：以85%的威力斗转反击，并追加600点气攻",
    "Ｗ◇离合参商：360≤总兵器值<520，被攻击时50%几率触发",
    "Ｗ◇离合参商：以110%的威力斗转反击，并追加1200点气攻",
    "Ｗ◇幻梦星辰：总兵器值≥520，发动离合参商反击时有几率变为幻梦星辰反击",
    "Ｗ◇幻梦星辰：几率为：（五系兵器值之和-520）%",
    "Ｗ◇幻梦星辰：反击伤害和气攻提高到115%，且反击范围为全屏锁定攻击",
    "Ｎ",
}

--左右互搏
Dec[4] = {
    "Ｗ◇达成条件：修炼左右互搏",
    "Ｗ◇（71-资质）%概率进行两次攻击",
    "Ｚ特别说明：",                                       
    "Ｗ◇需资质低于31",
    "Ｎ",
}

--桃花绝技
Dec[5] = {
    "Ｗ◇达成条件：同时修炼弹指神通/落英神剑掌/玉箫剑法到极",
    "Ｗ◇弹指神通/落英神剑掌/玉箫剑法威力+200",
    "Ｗ◇40%几率三连击，暴怒必出",
    "Ｗ◇弹指神通必暴击，气攻+1500",
    "Ｗ◇落英神剑掌攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
    "Ｗ◇玉箫剑法攻击距离提升至8格，有60%几率冰封",
    "Ｎ",
}
--紫气天罗
Dec[6] = {
    "Ｗ◇达成条件：同时学有灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌",
    "Ｗ◇紫气天罗：攻击随机附加1~3层“冰冻状态”，每层减缓1%集气速度，上限50层",
    "Ｗ◇紫气天罗：被攻击时冻结敌人5时序",
    "Ｗ◇紫气天罗：灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌威力提升300点",
    "Ｎ",
}
--我欲成仙
Dec[7] = {
}
--毒布武林
Dec[8] = {
    "Ｗ◇达成条件：同时修炼五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌",
    "Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
    "Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
    "Ｎ",
}
--慈悲为怀
Dec[9] = {
   "Ｗ◇达成条件：同时修炼慈悲刀法和大慈大悲手",
   "Ｗ◇慈悲为怀：道德高于60时，如果伤害大于100减伤（道德-60）点",
   "Ｎ",
}
--铁甲依然在
Dec[10] = {
   "Ｗ◇达成条件：同时修炼铁掌/铁剑/铁布衫并主运铁布衫",
   "Ｗ◇铁甲依然在：护甲提升20%，被攻击时20%几率抵挡生命最大值2%伤害",
   "Ｎ",
}
--五虎闹东京
Dec[11] = {
  "Ｗ◇达成条件：同时修炼五虎断门刀和五虎棍法",
  "Ｗ◇赞天虎身轻如燕：一虎在场，攻击时30%几率提升全队100集气",
  "Ｗ◇彻地虎是条好汉：二虎在场，被攻击时30%几率提高1000点气防",
  "Ｗ◇穿山虎铁臂神拳：三虎在场，攻击时30%几率增加100点伤害",
  "Ｗ◇翻江虎身手不凡：四虎在场，集气条30%几率跳跃10点集气速度",
  "Ｗ◇锦毛虎一身是胆：五虎在场，被攻击时30%几率反弹10%伤害",
  "Ｎ",
}
--十三太保
Dec[12] = {
}
--血战沙场
Dec[13] = {
  "Ｗ◇达成条件：同时修炼岳家枪法/岳王散手/武穆遗书",
  "Ｗ◇血战沙场：使用岳家枪法/岳王散手对周身7X7范围内的敌人造成10~20点伤害1次",
  "Ｗ◇根据击杀数和怒气值(每50点怒气增加1次，暴怒额外增加2次)增加伤害次数",
  "Ｚ特别说明：", 
  "Ｗ威力等于750+实战数值",
  "Ｎ",
}
--素质三连
Dec[14] = {
}
--血战沙场
Dec[15] = {
}
--洞虚玄门
Dec[16] = {
}
--寸长寸强
Dec[17] = {
  "Ｗ◇寸长寸强：同时修炼呼延枪法和呼延鞭法到极",
  "Ｗ◇寸长寸强：使用任意奇门武功攻击不随距离递减，距离每远一格伤害增加1%",
  "Ｚ特别说明：无",
  "Ｎ",
}
--剑胆琴心
Dec[18] = {
  "Ｗ◇达成条件：同时修炼独孤九剑和持瑶琴到极",
  "Ｗ◇剑胆琴心：战斗中受到的伤害会转化为临时的御剑系数提高",
  "Ｗ◇剑胆琴心： *持续整场战斗有效，系数加成后的总和不会超过320",
  "Ｗ◇剑胆琴心：使用持瑶琴攻击时，自身恢复5%当前血量并减少10点内伤",
  "Ｎ",
}
--举火燎原
Dec[19] = {
 "Ｗ◇达成条件：同时修炼金乌/燃木/火焰刀到极",
 "Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
 "Ｗ ◇举火燎原：*引燃状态下，每时序损失2%当前血量",
 "Ｎ",
}
--世尊降魔
Dec[20] = {
 "Ｗ◇达成条件<伏魔杖法><金刚伏魔圈><无上大力杵><罗汉伏魔功>领悟“世尊降魔”",
 "Ｗ◇世尊降魔：暴击率增加50%",
 "Ｗ◇世尊降魔： *如果造成的伤害<300,则伤害等于300，暴怒追加一定气攻伤害",
 "Ｗ◇世尊降魔： *如果造成的伤害>300则追加少量气攻值伤害暴怒则追加大量气攻值伤害",
 "Ｚ特别说明：无",
 "Ｎ",                                      
}
--金乌映雪
Dec[21] = {
}
--铁索横江
Dec[22] = {
    "Ｗ◇自身范围内一格15%概率不受到伤害。",
}
--双剑合壁
Dec[23] = {
 "Ｗ◇达成条件：同时学会武功全真剑法、玉女剑法、左右互搏",
 "Ｗ◇双剑合壁：连击率+30%",
 "Ｗ◇双剑合壁使用全真剑法/玉女剑法攻击时触发<双剑合壁.攻>，必击中对方破绽",
 "Ｗ◇双剑合壁防守时触发<双剑合壁.守>，免疫破绽，免疫被杀气到-100以下",
 "Ｗ◇双剑合壁使用玉女剑/全真剑法攻击范围+1",
  "Ｎ",
}
--利刃寒锋
Dec[24] = {
"Ｗ◇达成条件：同时修炼修罗/阴风/沧溟刀到极",
"Ｗ◇利刃寒锋：攻击时，有50%几率追加10时序的冻结状态，暴怒必触发",
"Ｗ ◇利刃寒锋：*冻结状态下，无法集气，亦无法时序回复状态",
 "Ｎ",
}
--逍遥御风
Dec[25] = {
"Ｗ◇达成条件：同时学有小无相功/北冥神功/八荒六合功，并完成特定剧情",
"Ｗ◇逍遥御风： *攻击与被攻击均有机会触发特效“逍遥御风”，累积点数",
"Ｗ◇逍遥御风：*当累积点数达到9点时，清空封穴",
"Ｗ ◇逍遥御风： *此状态不会被杀气或封穴，直到人物下次行动时累积归零",
"Ｗ◇逍遥御风：*单次攻击累积“逍遥御风”上限为3次",
 "Ｎ",
}
--罗汉金身
Dec[26] = {
"Ｗ◇达成条件：学会罗汉伏魔功、金刚不坏体",
"Ｗ◇罗汉金身：运功会罗汉伏魔功、金刚不坏体或易筋经",
"Ｗ◇罗汉金身受到第一次的伤害概率减伤50%",
 "Ｎ",
}
--以柔克刚
Dec[27] = {
"Ｗ◇达成条件：同时修炼柔云剑法和太极剑法到极",
"Ｗ◇以柔克刚：被攻击时有50%的几率触发，将所受杀气值的一半转化为回血",
 "Ｎ",
}
--青牛医疗
Dec[28] = {
}
--子午针灸
Dec[29] = {
}
--千金术
Dec[30] = {
}
--药王神篇
Dec[31] = {
}
--黄帝内经
Dec[32] = {
}
----毒经
Dec[33] = {
}
----盅术
Dec[34] = {
}

end