ItemInfo={}
--newkdef[0小还丹]=function()
   ItemInfo[0]={
   "Ｌ物品说明：可恢复少量生命",
   "Ｄ使用效果：+150生命 +15%生命",
                                       -- by 飘夜
   }

   --newkdef[1天香续命膏]=function()
   ItemInfo[01]={
   "Ｌ物品说明：可恢复较多生命",
   "Ｄ使用效果：+300生命 +30%生命",
                                       -- by 飘夜
   }

   --newkdef[2黑玉断续膏]=function()
   ItemInfo[02]={
   "Ｌ物品说明：可恢复大量生命",
   "Ｄ使用效果：+500生命 +50%生命",
                                       -- by 飘夜
   }

   --newkdef[3白云熊胆丸]=function()
   ItemInfo[03]={
   "Ｌ物品说明：可恢复少量内力",
   "Ｄ使用效果：+666内力",
                                       -- by 飘夜
   }

   ItemInfo[04]={
   "Ｌ物品说明：可恢复一些内力",
   "Ｄ使用效果：+888内力",
                                       -- by 飘夜
   }

   --newkdef[5九花玉露丸]=function()
   ItemInfo[05]={
   "Ｌ物品说明：可恢复较多内力",
   "Ｄ使用效果：+1250内力，中毒-20",
                                       -- by 飘夜
   }

   --newkdef[6九转熊蛇丸]=function()
   ItemInfo[06]={
   "Ｌ物品说明：可恢复大量内力",

   "Ｄ使用效果：+3000内力",
                                       -- by 飘夜
   }

   --newkdef[7无常丹]=function()
   ItemInfo[07]={
   "Ｌ物品说明：可恢复一些生命和内力",

   "Ｄ使用效果：+300生命，+30%生命，+800内力",
                                       -- by 飘夜
   }

   --newkdef[8天王保命丹]=function()
   ItemInfo[08]={
   "Ｌ物品说明：最好的药",

   "Ｄ使用效果：+50体力，+500生命，+50%生命，+1200内力，解毒-25",
                                       -- by 飘夜
   }

   --newkdef[9黄连解毒丸]=function()
   ItemInfo[09]={
   "Ｌ物品说明：可少量解毒",

   "Ｄ使用效果：解毒-20",
                                       -- by 飘夜
   }

   --newkdef[10牛黄血蝎丹]=function()
   ItemInfo[10]={
   "Ｌ物品说明：中等解毒药",

   "Ｄ使用效果：解毒-50",
                                       -- by 飘夜
   }

   --newkdef[11六阳正气丹]=function()
   ItemInfo[11]={
   "Ｌ物品说明：高等解毒药",

   "Ｄ使用效果：解毒-80",
                                       -- by 飘夜
   }

   --newkdef[12精气丸]=function()
   ItemInfo[12]={
   "Ｌ物品说明：可恢复一些体力",

   "Ｄ使用效果：恢复体力+40",
                                       -- by 飘夜
   }

   --newkdef[13玉灵散]=function()
   ItemInfo[13]={
   "Ｌ物品说明：可恢复大量体力",

   "Ｄ使用效果：恢复体力+66",
                                       -- by 飘夜
   }

   --newkdef[14千年灵芝]=function()
   ItemInfo[14]={
   "Ｌ物品说明：可增加人物体质",

   "Ｄ使用效果：人物体质+1",
                                       -- by 飘夜
   }

   --newkdef[15大蟠桃]=function()
   ItemInfo[15]={
   "Ｌ物品说明：可增加人物最大内力值",

   "Ｄ使用效果：人物最大内力值+100",
                                       -- by 飘夜
   }

   --newkdef[16千年人参]=function()
   ItemInfo[16]={
   "Ｌ物品说明：隨機增加人物屬性10點",

   "Ｄ使用效果：随机属性点数+10",
                                       -- by 飘夜
   }

   --newkdef[17天山雪莲]=function()
   ItemInfo[17]={
   "Ｌ物品说明：可增加人物最大生命值",

   "Ｄ使用效果：人物最大生命值+100",
                                       -- by 飘夜
   }

   --newkdef[18叫花鸡]=function()
   ItemInfo[18]={
   "Ｌ物品说明：可口的食物",

   "Ｄ使用效果：增加人物最大生命值20点",
                                       -- by 飘夜
   }

   --newkdef[19好逑汤]=function()
   ItemInfo[19]={
   "Ｌ物品说明：名菜",

   "Ｄ使用效果：增加人物最大内力值30点",
                                       -- by 飘夜
   }

   --newkdef[20玉笛谁家听落梅]=function()
   ItemInfo[20]={
   "Ｌ物品说明：名菜，",

   "Ｄ使用效果：增加人物最大生命值50点",
                                       -- by 飘夜
   }

   --newkdef[21腊八粥]=function()
   ItemInfo[21]={
   "Ｌ物品说明：名菜",

   "Ｄ使用效果：增加人物最大内力值100点",
                                       -- by 飘夜
   }

   --newkdef[22梨花酒]=function()
   ItemInfo[22]={
   "Ｌ物品说明：名酒",

   "Ｄ使用效果：解除冰封50点并时序恢复1点冰封，持续50时序",
                                       -- by 飘夜
   }

   --newkdef[23玉露酒]=function()
   ItemInfo[23]={
   "Ｌ物品说明：名酒",

   "Ｄ使用效果：解除灼烧20点并时序恢复1点灼烧，持续50时序",
                                       -- by 飘夜
   }

   --newkdef[24即墨老酒]=function()
   ItemInfo[24]={
   "Ｌ物品说明：名酒",

   "Ｄ使用效果：解除流血50点并时序恢复1点流血，持续100时序",
                                       -- by 飘夜
   }

   --newkdef[25五宝花蜜酒]=function()
   ItemInfo[25]={
   "Ｌ物品说明：名酒",

   "Ｄ使用效果：清除所有基础异常",
                                       -- by 飘夜
   }

   --newkdef[26莽牯朱蛤]=function()
   ItemInfo[26]={
   "Ｌ物品说明：万毒之王，百毒不侵，炼制地灵丹的材料之一",

   "Ｄ使用效果：+100抗毒",
                                       -- by 飘夜
   }

   --newkdef[27通犀地龙丸]=function()
   ItemInfo[27]={
   "Ｌ物品说明：西毒炼制，百毒不侵",

   "Ｄ使用效果：+100抗毒",
                                       -- by 飘夜
   }


   --newkdef[28飞蝗石]=function()
   ItemInfo[28]={
   "Ｌ物品说明：最普通的暗器",

   "Ｄ使用效果：-30生命",
                                       -- by 飘夜
   }

   --newkdef[29飞刀]=function()
   ItemInfo[29]={
   "Ｌ物品说明：飞是小李飞刀的刀",

   "Ｄ使用效果：-50生命",
                                       -- by 飘夜
   }

   --newkdef[30金蛇锥]=function()
   ItemInfo[30]={
   "Ｌ物品说明：金蛇郎君成名暗器",

   "Ｄ使用效果：-80生命",
                                       -- by 飘夜
   }

   --newkdef[31霹雳弹]=function()
   ItemInfo[31]={
   "Ｌ物品说明：一硫二硝三碳调制而成",

   "Ｄ使用效果：-100生命",
                                       -- by 飘夜
   }

   --newkdef[32毒蒺藜]=function()
   ItemInfo[32]={
   "Ｌ物品说明：球上有刺，刺上有毒",

   "Ｄ使用效果：-40生命，+40中毒",
                                       -- by 飘夜
   }

   ItemInfo[33]={
   "Ｌ物品说明：古墓派含毒之暗器",

   "Ｄ使用效果：-60生命，+60中毒",
                                       -- by 飘夜
   }

   --newkdef[34冰魄银针]=function()
   ItemInfo[34]={
   "Ｌ物品说明：古墓派含毒之暗器",

   "Ｄ使用效果：-70生命，+70中毒",
                                       -- by 飘夜
   }

   --newkdef[35黑血神针]=function()
   ItemInfo[35]={
   "Ｌ物品说明：日月神教暗器，含剧毒",

   "Ｄ使用效果：生命-80，中毒+80",
                                       -- by 飘夜
   }

   --newkdef[36玄铁剑]=function()
   ItemInfo[36]={
   "Ｇ装备效果；玄铁剑法威力+100",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：使用玄铁剑法时，增加50%暴击率",
   "Ｗ◇LV.2：使用玄铁剑法时，增加60%暴击率",
   "Ｗ◇LV.3：使用玄铁剑法时，增加70%暴击率",
   "Ｗ◇LV.4：使用玄铁剑法时，增加80%暴击率",
   "Ｗ◇LV.5：使用玄铁剑法时，增加90%暴击率",
   "Ｗ◇LV.6（MAX）：使用玄铁剑法时，必定暴击，并可发动“破尽天下”",                                  -- by 飘夜
   }

   --newkdef[37倚天剑]=function()
   ItemInfo[37]={
   "Ｇ装备效果；倚天剑法威力+200",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：攻击时50%几率造成流血效果",
   "Ｗ◇LV.2：攻击时60%几率造成流血效果",
   "Ｗ◇LV.3：攻击时70%几率造成流血效果",
   "Ｗ◇LV.4：攻击时80%几率造成流血效果",
   "Ｗ◇LV.5：攻击时90%几率造成流血效果",
   "Ｗ◇LV.6（MAX）：攻击时必定造成流血效果", 

   "Ｗ◇【倚天一出·谁于争锋】",
   "Ｗ◇御剑能力>=200，(御剑系数*0.1)%概率增加一次连击，",                         
   }

   --newkdef[38流星剑]=function()
   ItemInfo[38]={
   "Ｇ装备效果；连击率+10%",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：连击率+10%",
   "Ｗ◇LV.2：连击率+11%",
   "Ｗ◇LV.3：连击率+12%",
   "Ｗ◇LV.4：连击率+13%",
   "Ｗ◇LV.5：连击率+14%",
   "Ｗ◇LV.6（MAX）：连击率+15%",                                  -- by 飘夜
   }

   --newkdef[39白龙剑]=function()
   ItemInfo[39]={
   "Ｇ装备效果；苗家剑法威力+100",

   "Ｄ装备等级：无",                           -- by 飘夜
   }

   --newkdef[40金蛇剑]=function()
   ItemInfo[40]={
   "Ｇ装备效果；金蛇剑法威力+200",

   "Ｄ装备等级：无",                                             -- by 飘夜
   }

   --newkdef[41凝碧剑]=function()
   ItemInfo[41]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：无",
                                    -- by 飘夜
   }

   --newkdef[42白虹剑]=function()
   ItemInfo[42]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：无",
                                    -- by 飘夜
   }

   --newkdef[43屠龙刀]=function()
   ItemInfo[43]={
   "Ｇ装备效果；使用刀法武功攻击几率触发：",

   "Ｗ◇【武林至尊·宝刀屠龙】",
   "Ｗ◇必定造成流血且追加气攻,追加的气攻数值等于所使用刀法的威力",
   "Ｗ◇【号令天下·莫敢不从】",
   "Ｗ◇必定造成暴击",

   "Ｄ装备等级：无",
                                 -- by 飘夜
   }

   --newkdef[44血刀]=function()
   ItemInfo[44]={
   "Ｇ装备效果；血刀刀法威力+200",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：攻击时，恢复造成伤害5%的血量",
   "Ｗ◇LV.2：攻击时，恢复造成伤害6%的血量",
   "Ｗ◇LV.3：攻击时，恢复造成伤害7%的血量",
   "Ｗ◇LV.4：攻击时，恢复造成伤害8%的血量",
   "Ｗ◇LV.5：攻击时，恢复造成伤害9%的血量",
   "Ｗ◇LV.6（MAX）：攻击时，恢复造成伤害10%的血量",                                  -- by 飘夜
   }

   --newkdef[45冷月宝刀]=function()
   ItemInfo[45]={
   "Ｇ装备效果；胡家刀法威力+200",

   "Ｄ装备等级：无",
                                    -- by 飘夜
   }

   --newkdef[46绿波香露刀]=function()
   ItemInfo[46]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：无",
                                 -- by 飘夜
   }

   --newkdef[47金刀]=function()
   ItemInfo[47]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：无",
                                 -- by 飘夜
   }

   --newkdef[48雁翎刀]=function()
   ItemInfo[48]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：无",
                                    -- by 飘夜
   }

   --newkdef[49打狗棒]=function()
   ItemInfo[49]={
   "Ｇ装备效果；打狗棒法威力+200",

   "Ｄ装备等级：无",
                                    -- by 飘夜
   }

   --newkdef[50伏魔杵]=function()
   ItemInfo[50]={
   "Ｇ装备效果；伏魔杖法威力+100",

   "Ｄ装备等级：无",
                                 -- by 飘夜
   }

   --newkdef[51金龙鞭]=function()
   ItemInfo[51]={
   "Ｇ装备效果；黄沙万里鞭法威力+200",

   "Ｄ装备等级：无",
                                    -- by 飘夜
   }

   --newkdef[52鳄嘴剪]=function()
   ItemInfo[52]={
   "Ｇ装备效果；大剪刀威力+200",

   "Ｄ装备等级：无",
                                    -- by 飘夜
   }

   --newkdef[53判官笔]=function()
   ItemInfo[44]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：无",
                                 -- by 飘夜
   }

   --newkdef[54亮银枪]=function()
   ItemInfo[54]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：无",
                                    -- by 飘夜
   }

   --newkdef[55神山剑]=function()
   ItemInfo[55]={
   "Ｇ装备效果；神山剑法威力+200",

   "Ｄ装备等级：无",
                                 -- by 飘夜
   }

   --newkdef[56玄铁菜刀]=function()
   ItemInfo[56]={
   "Ｇ装备效果；西瓜刀法威力+200",

   "Ｄ装备等级：无",
                                 -- by 飘夜
   }

   --newkdef[57犽月]=function()
   ItemInfo[57]={
   "Ｇ装备效果；犽月流空威力+200",

   "Ｄ装备等级：无",
                                    -- by 飘夜
   }

   --newkdef[58软猬甲]=function()
   ItemInfo[58]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：减伤20点，被拳指系武功攻击时，使攻击方流血10点",
   "Ｗ◇LV.2：减伤22点，被拳指系武功攻击时，使攻击方流血10点",
   "Ｗ◇LV.3：减伤24点，被拳指系武功攻击时，使攻击方流血10点",
   "Ｗ◇LV.4：减伤26点，被拳指系武功攻击时，使攻击方流血10点",
   "Ｗ◇LV.5：减伤28点，被拳指系武功攻击时，使攻击方流血10点",
   "Ｗ◇LV.6（MAX）：减伤30点，被拳指系武功攻击时，使攻击方流血10点",                                  -- by 飘夜
   }

   --newkdef[59乌蚕衣]=function()
   ItemInfo[59]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：被攻击时，受到的内伤减少5点",
   "Ｗ◇LV.2：被攻击时，受到的内伤减少6点",
   "Ｗ◇LV.3：被攻击时，受到的内伤减少7点",
   "Ｗ◇LV.4：被攻击时，受到的内伤减少8点",
   "Ｗ◇LV.5：被攻击时，受到的内伤减少9点",
   "Ｗ◇LV.6（MAX）：被攻击时，受到的内伤减少10点",                                  -- by 飘夜
   }

   --newkdef[60金丝背心]=function()
   ItemInfo[60]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：被攻击时，受到的封穴减少5点",
   "Ｗ◇LV.2：被攻击时，受到的封穴减少6点",
   "Ｗ◇LV.3：被攻击时，受到的封穴减少7点",
   "Ｗ◇LV.4：被攻击时，受到的封穴减少8点",
   "Ｗ◇LV.5：被攻击时，受到的封穴减少9点",
   "Ｗ◇LV.6（MAX）：被攻击时，受到的封穴减少10点",                                  -- by 飘夜
   }

   --newkdef[61鳄皮护甲]=function()
   ItemInfo[61]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：每次行动结束后解毒25点",
   "Ｗ◇LV.2：每次行动结束后解毒35点",
   "Ｗ◇LV.3：每次行动结束后解毒45点",
   "Ｗ◇LV.4：每次行动结束后解毒55点",
   "Ｗ◇LV.5：每次行动结束后解毒65点",
   "Ｗ◇LV.6（MAX）：每次行动结束后解毒75点",                                  -- by 飘夜
   }

   --newkdef[62佛心甲]=function()
   ItemInfo[62]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：被攻击时，受到的灼烧减少50%",
   "Ｗ◇LV.2：被攻击时，受到的灼烧减少60%",
   "Ｗ◇LV.3：被攻击时，受到的灼烧减少70%",
   "Ｗ◇LV.4：被攻击时，受到的灼烧减少80%",
   "Ｗ◇LV.5：被攻击时，受到的灼烧减少90%",
   "Ｗ◇LV.6（MAX）：被攻击时，免疫灼烧状态"                                  -- by 飘夜
   }

   --newkdef[63皮衣]=function()
   ItemInfo[63]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：被攻击时，受到的冰封减少50%",
   "Ｗ◇LV.2：被攻击时，受到的冰封减少60%",
   "Ｗ◇LV.3：被攻击时，受到的冰封减少70%",
   "Ｗ◇LV.4：被攻击时，受到的冰封减少80%",
   "Ｗ◇LV.5：被攻击时，受到的冰封减少90%",
   "Ｗ◇LV.6（MAX）：被攻击时，免疫冰封状态"                                  -- by 飘夜
   }

   --newkdef[64北冥神功]=function()
   ItemInfo[64]={
   --"Ｌ习得内功：北冥神功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每3时序回复1点内伤",
   "Ｗ◇攻击时，50%几率吸取敌方7%当前内力（上限300）",
   "Ｗ◇被攻击时，50%几率发动“北冥神功.百川入海”吸取敌方200点内力",
   "Ｗ◇攻击时，30%几率吸取敌方7%当前内力（上限300）",
   "Ｗ◇被攻击时，50%几率触发“北冥真气”护体，提升800点气防（可叠加）",
   "Ｗ◇增加300点内力硬上限（与吸星大法同类效果不叠加）",
   "Ｗ *吸取内力时，提升自身内力上限",
   "Ｗ◇(15+实战/20)%机率发动“北冥.气吞山河”特效吸怒20点",

   "Ｄ秘技特效：",
   "Ｗ◇自在逍遥：同时学有小无相功/北冥神功/八荒六合功，并完成特定剧情",
   "Ｗ             *攻击与被攻击均有机会触发特效“自在逍遥”，累积点数",
   "Ｗ             *当累积点数达到9点时，清空封穴",
   "Ｗ             *此状态不会被杀气或封穴，直到人物下次行动时累积归零",
   "Ｗ             *单次攻击累积“自在逍遥”上限为3次"
   }

   --newkdef[65吸星大法]=function()
   ItemInfo[65]={
   --"Ｌ习得内功：吸星大法",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每3时序回复1点内伤",
   "Ｗ◇攻击时，50%几率吸取敌方7%当前内力（上限300）与少量体力",
   "Ｗ◇被攻击时，50%几率发动“万物相吸.吸星大法”吸取敌方200点内力并转移到",
   "Ｗ  自身100点",
   "Ｗ◇增加300点内力硬上限（与北冥神功同类效果不叠加）",
   }

   --newkdef[66化功大法]=function()
   ItemInfo[66]={
   --"Ｌ习得内功：化功大法",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每3时序回复1点内伤",
   "Ｗ◇攻击时，50%几率化去敌方5%当前内力（上限300，下限100），并强制上毒",
   "Ｗ  16~20点",
   "Ｗ◇被攻击时，50%几率发动“化功大法”化去敌方200点内力，并强制上毒",
   "Ｗ  10~15点",
   }

   --newkdef[67紫霞秘笈]=function()
   ItemInfo[67]={
   --"Ｌ习得内功：紫霞神功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每3时序回复1点内伤",
   "Ｗ◇行动结束后回复20%已消耗的内力（覆盖被动效果）",
   "Ｗ◇使用剑系武功有50%的几率触发“紫霞剑气”追加1000气攻",
   "Ｗ◇剑法出招概率+20%",
   "Ｗ◇蓄力必成功，且蓄力效果持续3回合",

   "Ｄ一脉相承",
   "Ｗ◇学习五岳剑诀一脉相承",
   }

   --newkdef[68混元功法]=function()
   ItemInfo[68]={
   --"Ｌ习得内功：混元功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每3时序回复1点内伤",
   "Ｗ◇每3时序回复1点体力",
   "Ｗ◇造成的封穴效果提高20%",
   "Ｗ◇攻击时50%追加“混元一气”，受击敌人混乱5~15时序",
   }

   --newkdef[69狮吼功法]=function()
   ItemInfo[69]={
   --"Ｌ习得内功：狮子吼",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇攻击时必定发动“狮子吼”，对全场内力低于自身的敌人杀退",
   "Ｗ  100点集气，且追加造成5-9点内伤",
   "Ｗ◇河东狮吼：女性角色发动“狮子吼”效果翻倍，消耗180点内力",
   "Ｄ一脉相承：",
   "Ｗ◇金刚禅狮子吼"
   }


   --newkdef[70圣火神功]=function()
   ItemInfo[70]={
   --"Ｌ习得内功：圣火神功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇奇门招式+30%，奇门武功破防+10%",
   "Ｗ◇被攻击，降低50%本次攻击所造成的封穴（与其他同类效果乘法叠加）",
   "Ｗ◇攻击时60%几率，无视对方集气条位置击中其破绽",
   "Ｗ◇进入战斗时的初始集气值+200~300",
   "Ｗ◇奇门大于200，攻击可造成‘观火’状态",
   "Ｗ◇如行动前未移动或者移动格数未消耗完，可在行动后获得一次移动机会",

   "Ｄ奇门武功：",
   "Ｗ◇使用圣火神功攻击算奇门系数"
   }

   --newkdef[71神照经]=function()
   ItemInfo[71]={
   --"Ｌ习得内功：神照功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇首次被击退时，100%发动“神照功起死回生”复活，之后有6%的几率发动",
   "Ｗ◇复活时回复（70+天书数量）%的生命/耗损内力/耗损体力以及异常状态、",
   "Ｗ  集气值+500",

   "Ｄ一脉相承：",
   "Ｗ◇长生诀",
   }

   --newkdef[72十八泥偶]=function()
   ItemInfo[72]={
   --"Ｌ习得内功：罗汉伏魔功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇行动结束后恢复10%已损失的生命值（上限200）",
   "Ｗ◇每时序额外回复1点流血",
   "Ｗ◇被攻击时，降低60%本次攻击所造成的内伤",
   "Ｗ◇攻击发动“罗汉伏魔”，根据以下公式提升伤害与杀气[高优先级]",
   "Ｗ  罗汉伏魔提升伤害和杀气效果为：[(当前内力值/30000)+(武功消耗内力/2000)]%",
   "Ｗ  同时学有易筋神功+罗汉伏魔功，主运【易筋神功】攻击时必出“罗汉伏魔”",

   "Ｄ世尊降魔(秘技特效)：",
   "Ｗ◇修炼<伏魔杖法><金刚伏魔圈><罗汉伏魔功>领悟“世尊降魔”",
   "Ｗ◇效果：暴击率增加50%",
   "Ｗ◇追加气功/20点伤害，暴怒追加气功/15点伤害",
   "Ｗ◇伤害低于100则伤害增加100",
   "Ｄ罗汉金身(秘技特效)：",
   "Ｗ◇学会罗汉伏魔功、金刚不坏体",
   "Ｗ◇主运罗汉伏魔功、金刚不坏体或易筋经神功。",
   "Ｗ◇受到第一次的伤害概率减伤50%",
   }

   --newkdef[73蛤蟆功法]=function()
   ItemInfo[73]={
   --"Ｌ习得内功：蛤蟆功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每5时序回复1点内伤",
   "Ｗ◇蓄力必成功，并同时执行防御指令，且下回合集气+300",
   "Ｗ◇强化蓄力效果，伤害加成从25%提升至50%，气攻加成从600提升至1200",
   "Ｗ◇每时序增加1点怒气",
   "Ｗ◇被攻击时，降低30%本次攻击所造成的内伤",
   "Ｗ◇无其他内功护体时，必定触发蛤蟆功护体气防提升900点",
   "Ｗ◇受攻击时触发“蛤蟆功.蓄力”，累计蓄力值",
   "Ｗ◇蓄力值满100后，下次攻击时可发动“蟾震九天”，根据蓄力值追加气攻",
   "Ｄ一脉相承：",
   "Ｗ◇鲸息功",
   }

   --newkdef[74乾坤大挪移]=function()
   ItemInfo[74]={
   --"Ｌ习得内功：乾坤大挪移",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇内力高于对方时,被攻击50%几率触发“乾坤大挪移反弹”反弹30%伤害",
   "Ｗ◇被攻击，降低50%本次攻击所造成的封穴（与其他同类效果乘法叠加）",
   "Ｗ◇每时序额外回复1点流血",
   "Ｗ◇被攻击时，降低40%本次攻击所造成的内伤",
   }

   --newkdef[75小无相功]=function()
   ItemInfo[75]={
   --"Ｌ习得内功：小无相功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇总气防提升30%",
   "Ｗ◇每5时序回复1点内伤",
   "Ｗ◇“无我无相”，攻击与被攻击时，兵器值判定必定不低于敌方",
   "Ｗ◇降低修炼武功兵器值需求10点、降低兵器装备需求兵器值10点",
   "Ｗ◇小无相功加力时，必定发动武功招式（降龙、六脉无效）",

   "Ｄ秘技特效：",
   "Ｗ◇自在逍遥：同时学有小无相功/北冥神功/八荒六合功，并完成特定剧情",
   "Ｗ             *攻击与被攻击均有机会触发特效“自在逍遥”，累积点数",
   "Ｗ             *当累积点数达到9点时，清空封穴",
   "Ｗ             *此状态不会被杀气或封穴，直到人物下次行动时累积归零",
   "Ｗ             *单次攻击累积“自在逍遥”上限为3次"
   }

   --newkdef[76纯阳无极功]=function()
   ItemInfo[76]={
   --"Ｌ习得内功：纯阳无极功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每时序回复1点中毒",
   "Ｗ◇降低武功内力消耗50%",
   "Ｗ◇每时序额外回复1点冰封",
   "Ｗ◇被攻击时，降低50%本次攻击所造成的冰封",
   "Ｗ◇【男性专属】减伤气防增加20%",
   }

   --newkdef[77先天功秘笈]=function()
   ItemInfo[77]={
   --"Ｌ习得内功：先天功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每5时序回复1点内伤",
   "Ｗ◇被攻击时，降低30%本次攻击所造成的内伤",
   "Ｗ◇行动前有60%几率发动“先天调息”，获得一次休息效果",
   "Ｗ◇【先天罡气】：攻击时清除目标的蓄力效果，对护盾目标造成双倍伤害",
   "Ｗ◇进入战场触发先天罡气护盾 抵消500点伤害，护盾被击破后5个回合后概率再次生成",
   "Ｗ◇被杀气到-100，清除全部内伤，并回复15%生命。",
   "Ｄ秘技特效：",
   "Ｗ◇同时学有先天功+玉女心经，每时序额外回复1点封穴",
   "Ｗ◇同时学有先天功+九阴神功，主运九阴神功被杀气到-100，清除全部内伤，并回复15%生命最大值。",
   }

   --newkdef[78辟邪剑谱]=function()
   ItemInfo[78]={
   --"Ｌ习得武功：辟邪剑法",

   "Ｗ武功威力：200",
   "Ｗ武功气攻：随招式变化",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：米 1+3格",

   "Ｄ秘技特效：",
   "Ｗ◇主运葵花神功，武功威力提高至1300",
   "Ｗ◇主运葵花神功，必定触发特效“真辟邪剑法·葵花刺目”",
   "Ｗ◇被刺目的敌人，本场战斗伤害和杀气均下降15%，攻击时有20%几率落空",

   "Ｚ特别说明：",
   "Ｗ◇飞燕穿柳，伤害+100，主运葵花必连击",
   "Ｗ◇花开见佛，命中目标虚弱状态50时序",
   "Ｗ◇锺馗抉目，必刺目，目标100%概率MISS",
   "Ｗ◇扫荡群魔，大范围面攻，如果有流血，则时序损失目标0.5%生命值",
   "Ｗ◇紫气东来，最小3连~最大4连击，下回合不可攻击，如果有击杀，则无负面影响",
   }

   --newkdef[79八荒六合功]=function()
   ItemInfo[79]={
   --"Ｌ习得内功：八荒六合功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每5时序回复1点内伤",
   "Ｗ◇被攻击时，60%几率触发护体气盾，吸收33.3%所受伤害，并回复等量内力",
   "Ｗ◇防御时的效果加成由25%提升至40%，气防由500提升至1000",
   "Ｗ◇免疫难5以上NPC根据伤害高低所追加的杀气及龙象的追加杀气",
   "Ｗ *触发八荒六合功护体时，必定发动护体气盾减伤",

   "Ｄ秘技特效：",
   "Ｗ◇自在逍遥：同时学有小无相功/北冥神功/八荒六合功，并完成特定剧情",
   "Ｗ◇自在逍遥：攻击与被攻击均有机会触发特效“自在逍遥”，累积点数，当累积点数达到9点时，清空封穴",
   "Ｗ◇自在逍遥：此状态不会被杀气或封穴，直到人物下次行动时累积归零",
   "Ｗ◇自在逍遥：单次攻击累积“自在逍遥”上限为3次"
   }

   --newkdef[80太玄经]=function()
   ItemInfo[80]={
   --"Ｌ习得内功：太玄神功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每3时序回复1点内伤",
   "Ｗ◇攻击时，有50+（天书数X2+实战/25）%的几率发动“太玄之重”，不造成怒气",
   "Ｗ◇发动“太玄之重”时，若敌方已暴怒，则有50+（天书数*2+实战/25）%的几率，发动“救赵挥金锤.邯郸先震惊”，使敌方怒气值降低20点",
   "Ｗ◇被攻击时，有40%的几率发动“太玄之轻”，将被杀气值转换成提升集气值",
   "Ｗ◇发动“太玄之轻”时，免疫内伤和普通中毒",
   "Ｗ◇攻击时造成的怒气降低50%",
   "Ｗ◇攻击时，体力消耗减少2点",
   "Ｗ◇高优先级提升战场五系系数40%",
   "Ｗ◇防御时触发“防御开始.太玄蓄力”，防御的同时执行蓄力指令",

   }

   --newkdef[81龙象般若功]=function()
   ItemInfo[81]={
   --"Ｌ习得内功：龙象般若功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每5时序回复1点内伤",
   "Ｗ◇高优先级提升10%伤害、降低10%所承受伤害",
   "Ｗ◇人物每次行动前自动进行蓄力",
   "Ｗ◇“龙之蓄力·象之防御”，蓄力必成功，并同时执行防御指令",
   "Ｗ◇攻击时有60%几率发动“龙象之力”，追加1000气攻",
   "Ｗ◇“龙象之力”追加气攻随自身怒气值提高；暴怒时，无视敌方绝对气防",
   "Ｄ秘技特效：",
   "Ｗ◇金刚般若：学会大力金刚掌、般若掌、龙象般若功，破防目标30%",
   "Ｗ◇大力金刚掌必暴击,般若掌攻击范围变成点，威力提高。",
   "Ｗ◇主运龙象般若功，概率触发【十龙十象】击晕目标。",
   }

   --newkdef[82逆运真经]=function()
   ItemInfo[82]={
   --"Ｌ习得内功：逆运经脉",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇被攻击时，降低30%本次攻击所造成的内伤",
   "Ｗ◇暴击率提高50%",
   "Ｗ◇暴击的攻击效果增加20%",
   "Ｗ◇每时序回复1点中毒",
   "Ｗ◇每3时序回复1点内伤",
   "Ｗ◇每6时序回复1点体力",
   "Ｗ◇免疫封穴10点",
   "Ｗ◇同时学有九阴神功+逆运经脉，被暴击时减少暴击伤害20%",
   "Ｗ◇集气概率向前跳跃25时序，学会九阴后跳跃50时序",
   }

   --wkdef[83九阳真经]=function()
   ItemInfo[83]={
   --"Ｌ习得内功：九阳神功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇【阳内专属】降低30%所承受伤害",
   "Ｗ◇【阳内专属】内力消耗降低75%",
   "Ｗ◇【阳内专属】每7时序自动解除自身封穴",
   "Ｗ◇【阳内专属】每时序回复6点内力值",
   "Ｗ◇【阳内专属】行动前发动“九阳.抱元守一” 清除自身所有不良状态",
   "Ｗ◇【阳内专属】灼烧系武功必出灼烧",
   "Ｗ◇【阳内专属】被攻击有（20+天书数×3）%几率，发动“九阳真气”提升",
   "Ｗ   650点气防（可叠加）",
   "Ｗ◇【氤氲紫气】伤害大于99时，如果伤害大于199减伤99点，否则减伤66点",
   "Ｗ◇每时序额外回复1点冰封",
   "Ｗ◇每时序回复1点中毒",
   "Ｗ◇每3时序回复1点内伤（内伤大于50时，效果加倍）",
   "Ｗ *同时学有九阳神功+九阴神功，可获得“森罗万象”的特效，免疫敌方暴击",
   "Ｗ  的额外伤害，以及会心一击的额外气攻"
   }

   --newkdef[84九阴真经]=function()
   ItemInfo[84]={
   --"Ｌ习得内功：九阴神功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇【阴内专属】提升20%伤害，降低10%所承受伤害",
   "Ｗ◇【阴内专属】连击率提高50%",
   "Ｗ◇【阴内专属】每时序额外回复5点生命值",
   "Ｗ◇【阴内专属】第一击必定触发,连击30%概率触发“九阴破体”无视目标20%防御",
   "Ｗ◇【阴内专属】冰封系武功必出冰封",
   "Ｗ◇【阴内专属】被攻击有（20+天书数×3）%几率，发动【九阴真气】提升650点气防（可叠加）",
   "Ｗ◇【包罗天下】攻击时概率触发“飞絮劲”附加100点伤害 + 必命中",
   "Ｗ◇每时序额外回复1点灼烧",
   "Ｗ◇每6时序回复1点体力",
   "Ｗ◇每3时序回复1点内伤（内伤大于50时，效果加倍）",
   "Ｗ◇同时学有九阴神功+九阳神功，免疫敌方暴击的额外伤害，以及会心一击的额外气攻",
   "Ｗ◇同时学有九阴神功+逆运真经，主运九阴神功，逆运真经一同视为主运",
   "Ｗ◇同时学有先天功+九阴神功，主运九阴神功被杀气到-100，清除全部内伤，并回复15%生命最大值。",
   "Ｄ秘技特效：",
   "Ｗ◇主运九阴神功使用九阴白骨爪必触发九阴神爪极意",
   "Ｗ◇九阴神爪极意：必连击，增加1500点伤害杀气，范围为7*7",
   "Ｗ  (黄衫女与黄赏有连击次数增加，具体看人物天赋)",
   "Ｚ特别说明：无", 
   }

   --newkdef[85易筋经]=function()
   ItemInfo[85]={
   --"Ｌ习得内功：易筋神功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇被攻击时，40%几率触发“易筋真谛”绝对气防",
   "Ｗ◇每3时序回复1点内伤（内伤大于50时，效果加倍）",
   "Ｗ◇每时序回复1点中毒",
   "Ｗ◇同时学有易筋神功+罗汉伏魔功，攻击时必出“罗汉伏魔”特效",
   "Ｗ *此状态触发的“罗汉伏魔”，且有1.1倍效果",
   "Ｗ◇同时学有易筋神功+金刚不坏体，被攻击必出“金刚不坏”特效",
   "Ｗ◇少林武功威力+200",
   "Ｗ◇每时序回复6点内力值",
   "Ｗ◇战场三围增加30%",
   "Ｗ◇每时序额外回复1点封穴",
   "Ｗ◇使用罗汉掌，60%几率触发“般若掌”伤害+50",
   "Ｗ◇使用大力金刚掌，40%几率触发“达摩掌”伤害+100",
   "Ｗ◇被攻击有（20+天书数×3）%几率，发动“易筋真气”提升650点气防（可叠加）"
   }

   --newkdef[86降龙十八掌]=function()
   ItemInfo[86]={
   --"Ｌ习得武功：降龙十八掌",

   "Ｗ武功威力：1500",
   "Ｗ武功气攻：1500",
   "Ｗ内力消耗：490",
   "Ｗ武功范围：米 5格",

   "Ｄ奇穴特效（奇穴[降龙]激活）",
   "Ｗ◇双龙取水：攻击两次",
   "Ｗ◇亢龙有悔：无视目标防御30%",
   "Ｗ◇潜龙勿用：行动后自动防御",
   "Ｗ◇震惊百里：对目标造成昏迷",
   "Ｗ◇飞龙在天：下回合速度增加50%",
   "Ｗ◇见龙在田：必中，造成的伤害增加200",
   "Ｗ◇时乘六龙：连击加1",

   "Ｄ秘技特效：",
   "Ｗ◇盖世无双：需同时修炼降龙十八掌与打狗棒法",
   "Ｗ◇盖世无双：被攻击时，有50%几率绝对气防",
   "Ｗ◇降龙十八掌·极意：限拳系主角、萧峰、郭靖、洪七公",
   "Ｗ◇降龙十八掌·极意：攻击范围变成面攻，无误伤，气攻提升至2300",
   "Ｗ◇降龙十八掌·三叠浪：限拳系主角、萧峰，降龙十八掌几率三连击",
   "Ｗ◇降龙十八掌·三叠浪：拳系主角暴怒是几率触发（资质/4+25%）",
   "Ｗ◇降龙十八掌·三叠浪：萧峰几率触发，暴怒必定触发",

   "Ｚ特别说明：",
   "Ｗ◇出招式攻击范围变大",                       --飘夜
   "Ｗ◇习得打狗棒法后，再学习降龙十八掌的需求降低40点"
   }

   --newkdef[87黯然销魂掌]=function()
   ItemInfo[87]={
   --"Ｌ习得武功：黯然销魂掌",

   "Ｗ武功威力：1500",
   "Ｗ武功气攻：1300",
   "Ｗ内力消耗：490",
   "Ｗ武功范围：米 5格",

   "Ｄ招式特效：（实际拳掌系数/28，最大15%；拳主和杨过/20，最大21%）",
   "Ｗ根据损失生命值额外提升出招概率，最大50%",
   "Ｗ◇行尸走肉：封印敌人攻击能力一回合",
   "Ｗ◇无中生有：自身回合结束后再次行动",
   "Ｗ◇六神不安：敌人集气混乱20时序，行动混乱一回合",
   "Ｗ◇倒行逆施：攻击时敌人按负系数计算",
   "Ｗ◇穷途末路：追加自身损失生命值20%的伤害",
   "Ｗ◇饮恨吞声：下回合敌人攻击时会损失伤害同等的生命",
   "Ｄ奇穴特效（奇穴[降龙]激活）",
   "Ｗ◇黯然销魂掌·极意：限主角、杨过",
   "Ｗ◇黯然销魂掌·极意：内伤>30%或生命小于70%触发/暴怒必出极意",
   "Ｗ◇黯然销魂掌·极意：资质≥30暴怒触发极意必定连击",
   "Ｗ◇黯然销魂掌·极意：资质<30暴怒触发极意高连击",
   "Ｗ◇黯然销魂掌·极意：攻击范围变成面攻，无误伤，追加1200气攻，必破气防",
   "Ｗ◇黯然销魂掌·三叠浪：【杨过专属】需完成杨过领悟黯然极意的剧情",
   "Ｗ◇黯然销魂掌·三叠浪：【杨过专属】生命越低、内伤越高几率越高，资质越高几率越高",
   "Ｗ◇黯然销魂掌·三叠浪：【杨过专属】黯然销魂掌·极意 三连击",

   "Ｚ特别说明：无",                                --飘夜
   }

   --newkdef[88须弥山神掌]=function()
   ItemInfo[88]={
   --"Ｌ习得武功：须弥山神掌",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：420",
   "Ｗ武功范围：米 4格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇附带灼烧", 
   "Ｗ◇如来神掌：概率（目标生命值越低概率越高，主运易筋经神功100%）伤害变为面攻，附加目标最大生命值8%的伤害；对生命值低于50%的目标固定概率直接斩杀。",                                        --飘夜
   }

   --newkdef[89七伤拳谱]=function()
   ItemInfo[89]={
   --"Ｌ习得武功：七伤拳",

   "Ｗ武功威力：1077",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：350",
   "Ｗ武功范围：■ 5+5×5",

   "Ｄ秘技特效：",
   "Ｗ◇一震七伤:无视敌方气防追加17点内伤",
   "Ｗ◇使用七伤拳攻击，几率触发（暴怒必触发）",
   "Ｗ◇自身内力<5000时，每个目标都会反伤自己内伤+7",

   "Ｚ特别说明：无",                                --飘夜
   }

   --newkdef[90大力金刚掌]=function()
   ItemInfo[90]={
   --"Ｌ习得武功：大力金刚掌",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：350",
   "Ｗ武功范围：米 5格",

   "Ｄ秘技特效：",
   "Ｗ◇达摩掌：主运易筋神功后，使用大力金刚掌40%几率触发",
   "Ｗ◇达摩掌：提高100伤害",
   "Ｄ秘技特效：",
   "Ｗ◇金刚般若：学会大力金刚掌、般若掌、龙象般若功，破防目标30%",
   "Ｗ◇大力金刚掌必暴击,般若掌攻击范围变成点，威力提高。",
   "Ｗ◇主运龙象般若功，概率触发【十龙十象】击晕目标。",

   "Ｚ特别说明：",
   "Ｗ◇增加暴击率",
   "Ｗ◇附带灼烧", 
   "Ｚ一脉相承：",
   "Ｗ◇学会罗汉拳，满足条件可一脉相承大力金刚掌",                                        --飘夜
   }

   --newkdef[91玄冥神掌]=function()
   ItemInfo[91]={
   --"Ｌ习得武功：玄冥神掌",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1100",
   "Ｗ内力消耗：350",
   "Ｗ武功范围：米 5格",

   "Ｚ特别说明：",
   "Ｗ◇玄冥·极意：主角攻击时有40%几率触发，暴怒必定触发",
   "Ｗ◇玄冥·极意：攻击范围变为面攻，攻击无误伤，并追加1500气攻",
   "Ｗ◇增加暴击率",
   "Ｗ◇附带冰封、中毒（30）",                                --飘夜
   "Ｄ秘技特效：",
   "Ｗ◇紫气天罗：同时学有灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌",
   "Ｗ◇紫气天罗：攻击随机附加1~3层“冰冻状态”，每层减缓1%集气速度，上限50层",
   "Ｗ◇紫气天罗：被攻击时冻结敌人5时序",
   "Ｗ◇紫气天罗：灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌威力提升300点",
   }

   --newkdef[92龙爪手]=function()
   ItemInfo[92]={
   --"Ｌ习得武功：龙爪手",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1100",
   "Ｗ内力消耗：210",
   "Ｗ武功范围：米 5格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇高几率流血",                                         --飘夜
   }

   --newkdef[93葵花宝典]=function()
   ItemInfo[93]={
   --"Ｌ习得内功：葵花神功",

   "Ｄ运功效果：",
   "Ｗ◇每5时序回复1点体力",
   "Ｗ◇基础集气速度提升20%",
   "Ｗ◇被攻击，30%的几率发动“葵花移形”，降低30%的所受伤害和杀气",
   "Ｗ◇被攻击，15%的几率发动“真.葵花移形”，完全闪避一次攻击",
   "Ｗ◇攻击50%机率触发“葵花诀·六合”：给敌增加1~2层减速BUFF，每层减敌集气2%，上限10层", 
   "Ｗ◇攻击20%机率触发“葵花刺目”：给敌添加肓目BUFF，20%机率攻击MISS", 
   "Ｗ◇被攻击时15%机率触发“空蝉”：移动到7格内任意点。", 
   "Ｗ◇习得葵花神功后，辟邪剑法可发挥出真实威力",

   "Ｚ特别说明：",
   "Ｗ◇正常人需自宫后方可修炼",
   "Ｗ◇标主剑神可无视条件修炼",
   "Ｗ◇笑傲线打赢葵花尊者后可修炼到葵花奥义【空蝉】：被攻击概率闪现到攻击范围外"
   }

   --newkdef[94幻阴指法]=function()
   ItemInfo[94]={
   --"Ｌ习得武功：幻阴指",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：315",
   "Ｗ武功范围：米 5格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇附带冰封、中毒（40）",                                         --飘夜
   }

   --newkdef[95弹指神通]=function()
   ItemInfo[95]={
   --"Ｌ习得武功：弹指神通",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：350",
   "Ｗ武功范围：米 6格",

   "Ｄ秘技特效：",
   "Ｗ◇桃花绝技：同时修炼弹指/落英/玉箫，三种武功威力+200",
   "Ｗ◇桃花绝技：40%几率三连击，暴怒必出",
   "Ｗ◇桃花绝技：弹指神通：必暴击，气攻+1500",
   "Ｗ◇桃花绝技：落英神剑掌：攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
   "Ｗ◇桃花绝技：玉箫剑法：攻击距离提升至8格，有60%几率冰封",
   "Ｗ◇修炼其中之一后，修炼其余两个的兵器值需求-10",
   "Ｗ◇弹指神通·无影神石：使用弹指神通攻击发动",
   "Ｗ◇弹指神通·无影神石：追加1000气攻，追加高几率流血，提高60%暴击率",
   "Ｗ◇弹指神通·无影神石：黄药师、谢烟客发动时必定暴击",
   "Ｗ◇弹指神通·无影神石：*必须学会桃花绝技",

   "Ｚ特别说明：",
   "Ｗ◇增加暴击率",
   "Ｗ◇高几率封穴",                                         --飘夜
   }

   --newkdef[96一阳指法]=function()
   ItemInfo[96]={
   --"Ｌ习得武功：一阳指",

   "Ｗ武功威力：1111",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：245",
   "Ｗ武功范围：▽ 7格",

   "Ｄ秘技特效：",
   "Ｗ◇一指破蟾：一阳指可以克制蛤蟆功",
   "Ｗ◇一指破蟾：可以清除对方身上50%蛤蟆功蓄力值",
   "Ｚ特别说明：",
   "Ｗ◇六脉神剑招式几率提升至60%",
   "Ｗ◇增加暴击率",
   "Ｗ◇附带灼烧、高封穴",                                         --飘夜
   }

   --newkdef[97太极拳经]=function()
   ItemInfo[97]={
   --"Ｌ习得外功：太极拳",

   "Ｗ武功威力：800",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：十 4格",
   "Ｄ秘技特效：",
   "Ｗ◇太极奥义：同时修炼太极拳和太极剑法",
   "Ｗ◇太极奥义：被攻击时有（资质/4+45）%的几率触发【武当派有特殊概率】，降低35%所受到的杀气，",
   "Ｗ◇太极奥义：触发太极奥义时，有35%的几率触发【太极真义·四两拨千斤】完全绝对气防。",
   "Ｄ秘技特效：",
   "Ｚ◇<开太极>",
   "Ｗ◇主运太极神功，使用太极拳法或太极剑法",
   "Ｗ◇蓄力值超过500且暴怒触发",
   "Ｗ◇根据当前生命值跟内力值追加大范围伤害，生命越低/内力越高伤害越高",
   }

   --newkdef[98空明拳谱]=function()
   ItemInfo[98]={
   --"Ｌ习得武功：空明拳",

   "Ｗ武功威力：900",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：米 4格",


   "Ｚ特别说明：无",  
   "Ｗ◇增加连击率",                                        --飘夜
   }

   --newkdef[99天山折梅手]=function()
   ItemInfo[99]={
   --"Ｌ习得武功：天山折梅手",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：▽ 6格",

   "Ｄ秘技特效：",
   "Ｗ◇天山折梅：天山折梅手修炼后，每多一个其他武功：",
   "Ｗ◇天山折梅：气攻增加100（对所有人有效，此处有具体提示）",
   "Ｗ◇天山折梅：威力增加50（仅对标准主角/虚竹/天山童姥/李秋水有效）",

   "Ｚ特别说明：无",                                  --飘夜
   }

   ItemInfo[100]={
   --"Ｌ习得武功：铁掌",

   "Ｗ武功威力：900",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：米 5格",

   "Ｄ秘技特效：",
   "Ｗ◇铁甲依然在：同时修炼铁掌/铁剑/铁布衫并主运铁布衫",
   "Ｗ◇铁甲依然在：护甲提升20%，被攻击时20%几率抵挡生命最大值2%伤害",

   "Ｚ特别说明：", 
   "Ｗ◇强上内伤：使用铁掌攻击，几率触发",
   "Ｗ◇强上内伤：无视对方气防追加12-15点内伤",                                 --飘夜
   }

   ItemInfo[101]={
   --"Ｌ习得武功：落英神剑掌",

   "Ｗ武功威力：700",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：十 5格",

   "Ｄ秘技特效：",
   "Ｗ◇桃花绝技：同时修炼弹指/落英/玉箫，三种武功威力+200",
   "Ｗ◇桃花绝技：40%几率三连击，暴怒必出",
   "Ｗ◇桃花绝技：弹指神通：必暴击，气攻+1500",
   "Ｗ◇桃花绝技：落英神剑掌：攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
   "Ｗ◇桃花绝技：玉箫剑法：攻击距离提升至8格，有60%几率冰封",
   "Ｗ◇修炼其中之一后，修炼其余两个的兵器值需求-10",

   "Ｚ特别说明：",
   "Ｗ◇增加暴击率",
   "Ｗ◇高几率封穴",                                         --飘夜
   }

   ItemInfo[102]={
   --"Ｌ习得武功：九阴白骨爪",

   "Ｗ武功威力：900",
   "Ｗ武功气攻：1100",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：米 6格",

   "Ｄ秘技特效：",
   "Ｗ◇主运九阴神功使用九阴白骨爪必触发九阴神爪极意",
   "Ｗ◇九阴神爪极意：必连击，增加1500点伤害杀气，范围为7*7",
   "Ｗ  (黄衫女与黄赏有连击次数增加，具体看人物天赋)",
   "Ｗ  同时修炼九阴白骨爪/摧心掌/大伏魔拳，暴怒时攻击附带撕裂",
   "Ｚ特别说明：无",                                  --飘夜
   }

   ItemInfo[103]={
   --"Ｌ习得武功：百花错拳",

   "Ｗ武功威力：600",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：■ 5+7×7格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",
   "Ｗ◇增加连击率",                             --飘夜
   }

   ItemInfo[104]={
   --"Ｌ习得武功：灵蛇拳",

   "Ｗ武功威力：500",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：米 4格",

   "Ｚ特别说明：",
   "Ｗ◇附带冰封、中毒(10)",                                         --飘夜
   "Ｄ秘技特效：",
   "Ｗ◇紫气天罗：同时学有灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌",
   "Ｗ◇紫气天罗：攻击随机附加1~3层“冰冻状态”，每层减缓1%集气速度，上限50层",
   "Ｗ◇紫气天罗：被攻击时冻结敌人5时序",
   "Ｗ◇紫气天罗：灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌威力提升300点",
   }

   ItemInfo[105]={
   --"Ｌ习得武功：天山六阳掌",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：7",
   "Ｗ武功范围：米 4格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇附带灼烧",                                         --飘夜
   }

   --newkdef[106绵掌掌谱]=function()
   ItemInfo[106]={
   --"Ｌ习得武功：绵掌",

   "Ｗ武功威力：400",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：28",
   "Ｗ武功范围：米 4格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇高连击",                                         --飘夜
   }

   --newkdef[107美女拳法]=function()
   ItemInfo[107]={
   --"Ｌ习得武功：美女拳法",

   "Ｗ武功威力：300",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：14",
   "Ｗ武功范围：■ 4+7×7格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                        --飘夜
   }

   --newkdef[108寒冰绵掌]=function()
   ItemInfo[108]={
   --"Ｌ习得武功：寒冰绵掌",

   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：35",
   "Ｗ武功范围：米 5格",

   "Ｚ特别说明：",
   "Ｗ◇附带冰封、中毒(10)",                                         --飘夜
   "Ｄ秘技特效：",
   "Ｗ◇紫气天罗：同时学有灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌",
   "Ｗ◇紫气天罗：攻击随机附加1~3层“冰冻状态”，每层减缓1%集气速度，上限50层",
   "Ｗ◇紫气天罗：被攻击时冻结敌人5时序",
   "Ｗ◇紫气天罗：灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌威力提升300点",
   }

   --newkdef[109鹰爪功法]=function()
   ItemInfo[109]={
   --"Ｌ习得武功：鹰爪功",

   "Ｗ武功威力：750",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：35",
   "Ｗ武功范围：米 6格",

   "Ｄ秘技特效：",

   "Ｚ特别说明：",
   "Ｗ◇高几率流血",                                         --飘夜
   }

   --newkdef[110五毒秘传]=function()
   ItemInfo[110]={
   --"Ｌ习得武功：五毒神掌",
   "Ｎ",
   "Ｗ武功威力：350",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：21",
   "Ｗ武功范围：米 4格",
   "Ｎ",
   "Ｚ特别说明：",
   "Ｗ◇附带冰封、中毒(20)", 
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｗ◇毒布武林：同时修炼五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌",
   "Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
   "Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
   }

   --2
   --newkdef[111逍遥游]=function()
   ItemInfo[111]={
   --"Ｌ习得轻功：逍遥游",

   "Ｎ",
   "Ｄ主运效果：",
   "Ｗ减伤10%",
   "Ｗ闪避10%",
   "Ｗ轻功+20点",
   "Ｗ被击中怒气值增加",
                                          --飘夜
   }

   --newkdef[112罗汉拳谱]=function()
   ItemInfo[112]={
   --"Ｌ习得武功：罗汉拳",

   "Ｗ武功威力：250",
   "Ｗ武功气攻：-",
   "Ｗ内力消耗：7",
   "Ｗ武功范围：米 3格",

   "Ｄ秘技特效：",
   "Ｗ◇般若掌：主运易筋神功，使用罗汉拳60%几率触发",
   "Ｗ◇般若掌：伤害提高50点",

   "Ｚ特别说明：",
   "Ｗ◇高连击",  
   "Ｚ一脉相承：",
   "Ｗ◇学会罗汉拳，满足条件可一脉相承大力金刚掌",                                         --飘夜
   }

   --newkdef[113六脉神剑]=function()
   ItemInfo[113]={
   --"Ｌ习得武功：六脉神剑",

   "Ｗ武功威力：1600",
   "Ｗ武功气攻：2000",
   "Ｗ内力消耗：700",
   "Ｗ武功范围：《 9格",

   "Ｄ秘技特效：",
   "Ｗ◇剑气碧烟横：使用六脉神剑攻击50%几率触发",
   "Ｗ◇剑气碧烟横：本次攻击敌方的指法系数按50%计算",

   "Ｚ特别说明：",
   "Ｗ◇中冲剑,剑逆天光--无视敌方气防 且必破防50%。",
   "Ｗ◇关冲剑,剑煌镜影--增加一次连击 附带灼烧效果。",
   "Ｗ◇少冲剑,南柯万剑--必暴击,且暴击攻击加成提升至200％。",
   "Ｗ◇少泽剑,皇玺剑印--对目标造成随机造成眩晕/虚弱/定身。"  ,
   }

   --newkdef[114独孤九剑]=function()
   ItemInfo[114]={
   --"Ｌ习得武功：独孤九剑",

   "Ｗ武功威力：1400",
   "Ｗ武功气攻：1600",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：米 7格",

   "Ｗ◇被攻击概率触发破X式。",
   "Ｄ秘技特效：",
   "Ｗ◇九剑真传：华山论剑打败风清扬奖励，需已学会独孤九剑",
   "Ｗ◇九剑真传：用剑法攻击70%几率触发四种招式：",
   "Ｗ◇九剑真传：离剑式：伤害不随距离递减",
   "Ｗ◇九剑真传：倒剑式：敌方集气强制倒退200点",
   "Ｗ◇九剑真传：撩剑式：伤害提高30%",
   "Ｗ◇九剑真传：荡剑式：攻击后回气+200点",
   "Ｗ◇九剑真传：被攻击时，有70%几率减伤20%，并降低攻击方下回合集气位置200",
   "Ｗ◇剑胆琴心：同时修炼独孤九剑和持瑶琴",
   "Ｗ◇剑胆琴心：战斗中受到的伤害会转化为临时的御剑系数提高",
   "Ｗ            *持续整场战斗有效，系数加成后的总和不会超过420",
   "Ｗ◇剑胆琴心：使用持瑶琴攻击时，自身恢复5%当前血量并减少10点内伤",

   "Ｚ特别说明：",
   "Ｗ◇增加连击率",                                         --飘夜
   "Ｗ◇习得持瑶琴后，再学习独孤九剑的需求降低40点"
   }

   --newkdef[115太极剑法]=function()
   ItemInfo[115]={
   --"Ｌ习得武功：太极剑法",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1300",
   "Ｗ内力消耗：280",
   "Ｗ武功范围：米 5格",
   "Ｄ秘技特效：",
   "Ｗ◇太极奥义：同时修炼太极拳和太极剑法",
   "Ｗ◇太极奥义：被攻击时有（资质/4+45）%的几率触发【武当派有特殊概率】，降低35%所受到的杀气，",
   "Ｗ◇太极奥义：触发太极奥义时，有35%的几率触发【太极真义·四两拨千斤】完全绝对气防。",
   "Ｄ秘技特效：",
   "Ｚ◇<开太极>",
   "Ｗ◇主运太极神功，使用太极拳法或太极剑法",
   "Ｗ◇蓄力值超过500且暴怒触发",
   "Ｗ◇根据当前生命值跟内力值追加大范围伤害，生命越低/内力越高伤害越高",                             --飘夜
   }

   --newkdef[116玄铁剑法]=function()
   ItemInfo[116]={
   --"Ｌ习得武功：玄铁剑法",

   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1500",
   "Ｗ内力消耗：420",
   "Ｗ武功范围：米 4格",

   "Ｄ重剑真传：",
   "Ｗ◇玄铁极意：剑主、杨过有概率加成，基础20%概率(暴怒概率翻倍)攻击范围变为面攻，气攻1800",
   "Ｗ◇重剑真传·浪如山涌剑如虹：暴怒触发大范围伤害",

   "Ｚ重剑无锋：",                                        --飘夜
   "Ｗ◇重剑无锋·破尽天下：需装备玄铁剑才能触发",
   "Ｗ◇重剑无锋·破尽天下：无视一切必定破气防，且追加1000气攻",
   "Ｗ◇重剑无锋·破尽天下：暴击概率为40+装备等级*10",
   }

   --newkdef[117苗家剑法]=function()
   ItemInfo[117]={
   --"Ｌ习得武功：苗家剑法",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：350",
   "Ｗ武功范围：《 6格",

   "Ｄ秘技特效：",
   "Ｗ◇胡刀苗剑·归真合一：同时修炼胡家刀法与苗家剑法，",
   "Ｗ◇胡刀苗剑·归真合一：用其中一种武功攻击时几率触发",
   "Ｗ◇胡刀苗剑·归真合一：攻击效果提升40%，追加1500气攻",

   "Ｚ特别说明：",                                        --飘夜
   "Ｗ◇习得胡家刀法后，再学习苗家剑法的需求降低40点"
   }

   --newkdef[118斗转星移]=function()
   ItemInfo[118]={
   --"Ｌ习得武功：斗转星移",

   "Ｗ武功威力：950",
   "Ｗ武功气攻：-",
   "Ｗ内力消耗：-",
   "Ｗ武功范围：《 5格",

   "Ｄ秘技特效：",
   "Ｗ◇斗转星移无法主动攻击，但受到攻击（资质-30）几率降低15%伤害并以同样的武功反击回去",
   "Ｗ◇北斗移辰：总兵器值<240，被攻击时50%几率触发",
   "Ｗ◇北斗移辰：以60%的威力斗转反击，并追加300点气攻",
   "Ｗ◇斗转星移：240≤总兵器值<360，被攻击时50%几率触发",
   "Ｗ◇斗转星移：以85%的威力斗转反击，并追加600点气攻",
   "Ｗ◇离合参商：360≤总兵器值<520，被攻击时50%几率触发",
   "Ｗ◇离合参商：以110%的威力斗转反击，并追加1200点气攻",
   "Ｗ◇幻梦星辰：总兵器值≥520，发动离合参商反击时有几率变为幻梦星辰反击",
   "Ｗ◇幻梦星辰：几率为：（五系兵器值之和-520）%",
   "Ｗ◇幻梦星辰：反击伤害和气攻提高到115%，且反击范围为全屏锁定攻击",

   "Ｚ特别说明：无",                                       --飘夜
   "Ｗ◇需资质大于79",
   }

   --newkdef[119玉女剑法]=function()
   ItemInfo[119]={
   --"Ｌ习得武功：玉女剑法",

   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：280",
   "Ｗ武功范围：《 5格",

   "Ｄ秘技特效：双剑合璧",
   "Ｗ同时学会武功全真剑法、玉女剑法、左右互搏",
   "Ｗ连击率+30%",
   "Ｗ使用全真剑法/玉女剑法攻击时触发<双剑合壁.攻>，必击中对方破绽",
   "Ｗ防守时触发<双剑合壁.守>，免疫破绽，免疫被杀气到100以下",
   "Ｗ使用玉女剑/全真剑法攻击范围+1",

   "Ｚ特别说明：",
   "Ｗ◇增加连击率",                                         --飘夜
   }

   --newkdef[120倚天剑谱]=function()
   ItemInfo[120]={
   --"Ｌ习得武功：倚天剑法",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：210",
   "Ｗ武功范围：《 7格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇附带灼烧",                                         --飘夜
   }

   --newkdef[121金蛇剑法]=function()
   ItemInfo[121]={
   --"Ｌ习得武功：金蛇剑法",

   "Ｗ武功威力：800",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：210",
   "Ｗ武功范围：米 6格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇增加暴击率",
   "Ｗ◇附带灼烧",                                         --飘夜
   }

   --newkdef[122七星剑谱]=function()
   ItemInfo[122]={
   --"Ｌ习得武功：全真剑法",

   "Ｗ武功威力：700",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：《 7格",

   "Ｄ秘技特效：双剑合璧",
   "Ｗ同时学会武功全真剑法、玉女剑法、左右互搏",
   "Ｗ连击率+30%",
   "Ｗ使用全真剑法/玉女剑法攻击时触发<双剑合壁.攻>，必击中对方破绽",
   "Ｗ防守时触发<双剑合壁.守>，免疫破绽，免疫被杀气到-100以下",
   "Ｗ使用玉女剑/全真剑法攻击范围+1",

   "Ｚ特别说明：",
   "Ｗ◇增加暴击率",                                         --飘夜
   }

   --newkdef[123玉箫剑法]=function()
   ItemInfo[123]={
   --"Ｌ习得武功：玉箫剑法",

   "Ｗ武功威力：700",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：《 5格",

   "Ｄ秘技特效：",
   "Ｗ◇桃花绝技：同时修炼弹指/落英/玉箫，三种武功威力+200",
   "Ｗ◇桃花绝技：40%几率三连击，暴怒必出",
   "Ｗ◇桃花绝技：弹指神通：必暴击，气攻+1500",
   "Ｗ◇桃花绝技：落英神剑掌：攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
   "Ｗ◇桃花绝技：玉箫剑法：攻击距离提升至8格，有60%几率冰封",
   "Ｗ◇修炼其中之一后，修炼其余两个的兵器值需求-10",

   "Ｚ特别说明：无",                                        --飘夜
   }

   --newkdef[124两仪剑谱]=function()
   ItemInfo[124]={
   --"Ｌ习得武功：两仪剑法",

   "Ｗ武功威力：999",
   "Ｗ武功气攻：-",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：米 5格",

   "Ｄ秘技特效：",
   "Ｗ◇两仪守护：同时练有两仪剑法和反两仪刀法，",
   "Ｗ◇两仪守护：增加64点防御，被攻击时减少320气攻。",

   "Ｚ特别说明：",
   "Ｗ◇高连击",                                         --飘夜
   }

   --newkdef[125柔云剑谱]=function()
   ItemInfo[125]={
   --"Ｌ习得武功：柔云剑法",

   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：《 7格",

   "Ｄ秘技特效：",
   "Ｗ◇以柔克刚：同时修炼柔云剑法和太极剑法",
   "Ｗ◇以柔克刚：被攻击时有50%的几率触发，将所受杀气值的一半转化为回血",

   "Ｚ特别说明：无",                                         --飘夜
   }

   --newkdef[126雪山剑谱]=function()
   ItemInfo[126]={
   --"Ｌ习得武功：雪山剑法",

   "Ｗ武功威力：300",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：49",
   "Ｗ武功范围：米 7格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇附带冰封",            
   "Ｗ◇天外连击时随机增加0.5-3倍原武功威力",                               --飘夜
   }

   --newkdef[127太岳三青峰]=function()
   ItemInfo[127]={
   --"Ｌ习得武功：太岳三青峰",

   "Ｗ武功威力：400",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：49",
   "Ｗ武功范围：《 6",

   "Ｄ秘技特效：",
   "Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
   "Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20",
   "Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
   "Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
   "Ｗ◇五岳剑法：暴怒必定发动",

   "Ｚ特别说明：",
   "Ｗ◇高连击",                                                                        --飘夜
   }

   --newkdef[128万岳朝宗]=function()
   ItemInfo[128]={
   --"Ｌ习得武功：万岳朝宗",

   "Ｗ武功威力：600",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：《 6",

   "Ｄ秘技特效：",
   "Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
   "Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20",
   "Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
   "Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
   "Ｗ◇五岳剑法：暴怒必定发动",

   "Ｚ特别说明：",
   "Ｗ◇高暴击",
   "Ｗ◇附带冰封",                                                                        --飘夜
   }

   --newkdef[129云雾十三式]=function()
   ItemInfo[129]={
   --"Ｌ习得武功：云雾十三式",

   "Ｗ武功威力：500",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：35",
   "Ｗ武功范围：《 5格",

   "Ｄ秘技特效：",
   "Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
   "Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20",
   "Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
   "Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
   "Ｗ◇五岳剑法：暴怒必定发动",

   "Ｚ特别说明：无",                                                                        --飘夜
   }

   --newkdef[130泰山十八盘]=function()
   ItemInfo[130]={
   --"Ｌ习得武功：泰山十八盘",

   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：35",
   "Ｗ武功范围：米 7格",

   "Ｄ秘技特效：",
   "Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
   "Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20",
   "Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
   "Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
   "Ｗ◇五岳剑法：暴怒必定发动",

   "Ｚ特别说明：",
   "Ｗ◇增加连击率",                                                                       --飘夜
   }

   --newkdef[131万花剑法]=function()
   ItemInfo[131]={
   --"Ｌ习得武功：万花剑法",

   "Ｗ武功威力：400",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：35",
   "Ｗ武功范围：■ 6+7×7",

   "Ｄ秘技特效：",
   "Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
   "Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20",
   "Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
   "Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
   "Ｗ◇五岳剑法：暴怒必定发动",

   "Ｚ特别说明：无",                                                                      --飘夜
   }

   --newkdef[132三分剑术]=function()
   ItemInfo[132]={
   --"Ｌ习得武功：三分剑法",

   "Ｗ武功威力：300",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：《 7格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇高连击",                                         --飘夜
   }

   --newkdef[133雷震剑法]=function()
   ItemInfo[133]={
   --"Ｌ习得武功：雷震剑法",

   "Ｗ武功威力：220",
   "Ｗ武功气攻：300",
   "Ｗ内力消耗：7",
   "Ｗ武功范围：《 6格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇高暴击",                                         --飘夜
   }

   --newkdef[134松风剑法]=function()
   ItemInfo[134]={
   --"Ｌ习得武功：松风剑法",

   "Ｗ武功威力：250",
   "Ｗ武功气攻：300",
   "Ｗ内力消耗：4",
   "Ｗ武功范围：《 7格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                         --飘夜
   }

   --newkdef[135火焰刀法]=function()
   ItemInfo[135]={
   --"Ｌ习得武功：火焰刀法",

   "Ｗ武功威力：1300",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：350",
   "Ｗ武功范围：△ 7格",

   "Ｄ秘技特效：",
   "Ｗ◇举火燎原：同时修炼金乌/燃木/火焰刀",
   "Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
   "Ｗ            *引燃状态下，每时序损失2%当前血量",

   "Ｚ特别说明：",                                        --飘夜
   "Ｗ◇大轮密宗·火焰刀：使用火焰刀法攻击30%几率触发（鸠摩智100%触发）",
   "Ｗ◇大轮密宗·火焰刀：无误伤，全场敌方受到内伤30点，且追加1000气攻",
   "Ｗ◇大轮密宗·火焰刀：*密宗弟子概率增加30%。",
   "Ｗ◇附带灼烧"
   }

   --newkdef[136胡家刀法]=function()
   ItemInfo[136]={
   --"Ｌ习得武功：胡家刀法",

   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1100",
   "Ｗ内力消耗：210",
   "Ｗ武功范围：井 5格",

   "Ｄ秘技特效：",
   "Ｗ◇胡刀苗剑·归真合一：同时修炼胡家刀法与苗家剑法，",
   "Ｗ◇胡刀苗剑·归真合一：用其中一种武功攻击时几率触发",
   "Ｗ◇胡刀苗剑·归真合一：攻击效果提升40%，追加1500气攻",
   "Ｗ◇胡刀刀法·极意：限主角与胡斐胡一刀，用胡家刀法攻击时几率触发",
   "Ｗ◇胡刀刀法·极意：攻击无误伤，攻击范围变为9*9，气攻提升至1500",
   "Ｗ◇胡刀刀法·极意：暴怒时必触发",

   "Ｚ特别说明：",                                        --飘夜
   "Ｗ◇习得苗家剑法后，再学习胡家刀法的需求降低40点"
   }

   --newkdef[137燃木刀法]=function()
   ItemInfo[137]={
   --"Ｌ习得武功：燃木刀法",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：175",
   "Ｗ武功范围：△ 5格",

   "Ｄ秘技特效：",
   "Ｗ◇举火燎原：同时修炼金乌/燃木/火焰刀",
   "Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
   "Ｗ            *引燃状态下，每时序损失2%当前血量",

   "Ｚ特别说明：",
   "Ｗ◇据当前加力内功提升攻击效果",
   "Ｗ◇增加暴击率",
   "Ｗ◇附带灼烧",                                         --飘夜
   }

   --newkdef[138玄虚刀法]=function()
   ItemInfo[138]={
   --"Ｌ习得武功：玄虚刀法",

   "Ｗ武功威力：900",
   "Ｗ武功气攻：-",
   "Ｗ内力消耗：175",
   "Ｗ武功范围：井 4格",

   "Ｄ秘技特效：",
   "Ｗ◇洞虛玄門：同时修炼神门十三剑/玄虚刀法",
   "Ｗ◇洞虛玄門：玄虚刀法必封穴，神门十三剑必冰封灼烧",
   "Ｗ◇洞虛玄門：受到攻击30%几率使用双倍内力抵消一半伤害",
   "Ｎ",
   "Ｚ特别说明：无",                                        --飘夜
   }

   --newkdef[139血刀经]=function()
   ItemInfo[139]={
   --"Ｌ习得武功：血刀刀法",

   "Ｗ武功威力：811",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：井 5格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：", 
   "Ｗ◇修炼后生命上限降低200",                                       --飘夜
   }

   --newkdef[140夫妻刀法]=function()
   ItemInfo[140]={
   --"Ｌ习得武功：夫妻刀法",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：△ 6格",

   "Ｄ秘技特效：",
   "Ｗ◇天衣无缝：同时修炼鸳鸯刀法和夫妻刀法",
   "Ｗ◇天衣无缝：使用任意刀系武功增加30%连击率",

   "Ｚ特别说明：无",                                        --飘夜
   "Ｗ◇连击时伤害、气攻不会减少"
   }

   --newkdef[141金乌刀法]=function()
   ItemInfo[141]={
   --"Ｌ习得武功：金乌刀法",

   "Ｗ武功威力：744",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：△ 7格",

   "Ｄ秘技特效：",
   "Ｗ◇举火燎原：同时修炼金乌/燃木/火焰刀",
   "Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
   "Ｗ            *引燃状态下，每时序损失2%当前血量",

   "Ｚ特别说明：",
   "Ｗ◇增加暴击率",
   "Ｗ◇附带灼烧",                                         --飘夜
   }

   --newkdef[142反两仪刀法]=function()
   ItemInfo[142]={
   --"Ｌ习得武功：反两仪刀法",

   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：井 7格",

   "Ｄ秘技特效：",
   "Ｗ◇两仪守护：同时练有两仪剑法和反两仪刀法，",
   "Ｗ◇两仪守护：增加64点防御，被攻击时减少320气攻。",

   "Ｚ特别说明：",
   "Ｗ◇增加连击率",                                         --飘夜
   }

   --newkdef[143五虎断门刀]=function()
   ItemInfo[143]={
   --"Ｌ习得武功：五虎断门刀",

   "Ｗ武功威力：500",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：井 5格",

   "Ｄ秘技特效：",
   "Ｗ◇虎虎生风：同时修炼狂风刀法和五虎断门刀",
   "Ｗ◇虎虎生风：使用任意刀系武功增加30%暴击率",

   "Ｄ秘技特效：",
   "Ｗ◇五虎闹东京：同时修炼五虎断门刀和五虎棍法",
   "Ｗ◇钻天虎身轻如燕：一虎在场，攻击时30%几率提升全队100集气",
   "Ｗ◇彻地虎是条好汉：二虎在场，被攻击时30%几率提高500点气防",
   "Ｗ◇穿山虎铁臂神拳：三虎在场，攻击时30%几率增加100点伤害",
   "Ｗ◇翻江虎身手不凡：四虎在场，集气条30%几率跳跃10点集气速度",
   "Ｗ◇锦毛虎一身是胆：五虎在场，被攻击时30%几率反弹10%伤害",

   "Ｚ特别说明：",
   "Ｗ◇高暴击",                                         --飘夜
   }

   --newkdef[144飞狐外传]=function()
   ItemInfo[144]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[145雪山飞狐]=function()
   ItemInfo[145]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[146连城诀]=function()
   ItemInfo[146]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[147天龙八部]=function()
   ItemInfo[147]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[148射雕英雄传]=function()
   ItemInfo[148]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[149白马啸西风]=function()
   ItemInfo[149]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[150鹿鼎记]=function()
   ItemInfo[150]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[151笑傲江湖]=function()
   ItemInfo[151]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[152书剑恩仇录]=function()
   ItemInfo[152]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[153神雕侠侣]=function()
   ItemInfo[153]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[154侠客行]=function()
   ItemInfo[154]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[155倚天屠龙记]=function()
   ItemInfo[155]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[156碧血剑]=function()
   ItemInfo[156]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[157鸳鸯刀]=function()
   ItemInfo[157]={
   "Ｌ物品说明：十四天书之一",                                    -- by 飘夜
   }

   --newkdef[158修罗刀谱]=function()
   ItemInfo[158]={
   --"Ｌ习得武功：修罗刀",

   "Ｗ武功威力：600",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：△ 4格",

   "Ｄ秘技特效：",
   "Ｗ◇利刃寒锋：同时修炼修罗/阴风/沧溟刀",
   "Ｗ◇利刃寒锋：攻击时，有50%几率追加10时序的冻结状态，暴怒必触发",
   "Ｗ            *冻结状态下，无法集气，亦无法时序回复状态",

   "Ｚ特别说明：",
   "Ｗ◇高暴击",
   "Ｗ◇附带冰封"                                         --飘夜
   }

   --newkdef[159奇门三才刀]=function()
   ItemInfo[159]={
   --"Ｌ习得武功：奇门三才刀",

   "Ｗ武功威力：400",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：35",
   "Ｗ武功范围：井 5格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇增加暴击率",                                        --飘夜
   }

   --newkdef[160慈悲刀法]=function()
   ItemInfo[160]={
   --"Ｌ习得武功：慈悲刀法",

   "Ｗ武功威力：400",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：35",
   "Ｗ武功范围：△ 7格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇高连击",                                         --飘夜
   }

   --newkdef[161狂风刀法]=function()
   ItemInfo[161]={
   --"Ｌ习得武功：狂风刀法",

   "Ｗ武功威力：500",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：21",
   "Ｗ武功范围：米 6格",

   "Ｄ秘技特效：",
   "Ｗ◇虎虎生风：同时修炼狂风刀法和五虎断门刀",
   "Ｗ◇虎虎生风：使用任意刀系武功增加30%暴击率",

   "Ｚ特别说明：",
   "Ｗ◇高连击",                                         --飘夜
   }

   --newkdef[162鸳鸯刀法]=function()
   ItemInfo[162]={
   --"Ｌ习得武功：鸳鸯刀法",

   "Ｗ武功威力：700",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：21",
   "Ｗ武功范围：井 6格",

   "Ｄ秘技特效：",
   "Ｗ◇天衣无缝：同时修炼鸳鸯刀法和夫妻刀法",
   "Ｗ◇天衣无缝：使用任意刀系武功增加30%连击率",

   "Ｚ特别说明：",
   "Ｗ◇增加连击率",                                        --飘夜
   }

   --newkdef[163南山刀谱]=function()
   ItemInfo[163]={
   --"Ｌ习得武功：南山刀法",

   "Ｗ武功威力：300",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：14",
   "Ｗ武功范围：△ 7格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                        --飘夜
   }

   --newkdef[164鬼头刀法]=function()
   ItemInfo[164]={
   --"Ｌ习得武功：鬼头刀法",

   "Ｗ武功威力：700",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：14",
   "Ｗ武功范围：井 5格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                        --飘夜
   }

   --newkdef[165万劫刀法]=function()
   ItemInfo[165]={
   --"Ｌ习得武功：万劫刀法",

   "Ｗ武功威力：300",
   "Ｗ武功气攻：-",
   "Ｗ内力消耗：7",
   "Ｗ武功范围：△ 5格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                         --飘夜
   }

   --newkdef[166柴刀十八路]=function()
   ItemInfo[166]={
   --"Ｌ习得武功：柴刀十八路",

   "Ｗ武功威力：250",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：7",
   "Ｗ武功范围：井 6格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",                                     --飘夜
   }

   --newkdef[167打狗棒法]=function()
   ItemInfo[167]={
   --"Ｌ习得武功：打狗棒法",

   "Ｗ武功威力：1400",
   "Ｗ武功气攻：1400",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：米 3格",

   "Ｄ招式特效：（实际奇门系数/14，最大25%；奇门主和洪七/10，最大35%）",
   "Ｗ◇绊字决：造成锁足",
   "Ｗ◇封字决：敌方下回合无法攻击",
   "Ｗ◇转字决：连击加1",
   "Ｗ◇缠字决：造成迟缓20时序",
   "Ｗ◇挑字决：无视敌方30%防御",
   "Ｗ◇戳字决：必定封穴，封穴+10，40%概率造成刺目",

   "Ｄ秘技特效：",
   "Ｗ◇盖世无双：需同时修炼降龙十八掌与打狗棒法",
   "Ｗ◇盖世无双：被攻击时，有50%几率绝对气防",
   "Ｗ◇天下无狗：使用打狗棒法40%几率发动，暴怒必定发动",
   "Ｗ◇天下无狗：攻击无误伤，攻击范围变为面攻，气攻提升至2400",

   "Ｚ特别说明：无",                      --飘夜
   "Ｗ◇习得降龙十八掌后，再学习打狗棒法的需求降低40点"
   }

   --newkdef[168伏魔杖法]=function()
   ItemInfo[168]={
   --"Ｌ习得武功：伏魔杖法",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1100",
   "Ｗ内力消耗：210",
   "Ｗ武功范围：田 5格",

   "Ｄ世尊降魔(秘技特效)：",
   "Ｗ◇修炼<伏魔杖法><金刚伏魔圈><罗汉伏魔功>领悟“世尊降魔”",
   "Ｗ◇效果：暴击率增加50%",
   "Ｗ *如果造成的伤害<300,则伤害等于300，暴怒追加一定气攻伤害",
   "Ｗ *如果造成的伤害>300则追加少量气攻值伤害暴怒则追加大量气攻值伤害",
   "Ｚ特别说明：无",                                      
   }

   --newkdef[169倚天屠龙功]=function()
   ItemInfo[169]={
   --"Ｌ习得武功：倚天屠龙功",

   "Ｗ武功威力：999",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：63",
   "Ｗ武功范围：米 5格",

   "Ｄ秘技特效：",
   "Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
   "Ｗ◇琴棋书画·秉笔直书：攻击必定造成封穴，",
   "Ｗ◇琴棋书画·秉笔直书：且伤害提升20%几率发动",

   "Ｚ特别说明：无",                                         --飘夜
   }

   --newkdef[170无上大力杵]=function()
   ItemInfo[170]={
   --"Ｌ习得武功：无上大力杵",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：350",
   "Ｗ武功范围：■ 5+5×5",

   "Ｄ世尊降魔(秘技特效)：",
   "Ｗ◇修炼<伏魔杖法><金刚伏魔圈><罗汉伏魔功>领悟“世尊降魔”",
   "Ｗ◇效果：暴击率增加50%",
   "Ｗ *如果造成的伤害<300,则伤害等于300，暴怒追加一定气攻伤害",
   "Ｗ *如果造成的伤害>300则追加少量气攻值伤害暴怒则追加大量气攻值伤害",

   "Ｚ特别说明：", 
   "Ｗ◇附带灼烧",                                     --飘夜
   }

   --newkdef[171金刚伏魔圈]=function()
   ItemInfo[171]={
   --"Ｌ习得武功：金刚伏魔圈",

   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1100",
   "Ｗ内力消耗：56",
   "Ｗ武功范围：田 3格",

   "Ｄ秘技特效：",
   "Ｗ◇金刚伏魔阵：战场上队伍里同时修炼金刚伏魔圈2人以上",
   "Ｗ◇金刚伏魔圈护体：2人，提升15%防御且气防+500",
   "Ｗ◇真·金刚伏魔圈护体：2+人，提升30%防御且气防+1000",

   "Ｄ世尊降魔(秘技特效)：",
   "Ｗ◇修炼<伏魔杖法><金刚伏魔圈><罗汉伏魔功>领悟“世尊降魔”",
   "Ｗ◇效果：暴击率增加50%",
   "Ｗ *如果造成的伤害<300,则伤害等于300，暴怒追加一定气攻伤害",
   "Ｗ *如果造成的伤害>300则追加少量气攻值伤害暴怒则追加大量气攻值伤害",

   "Ｚ特别说明：",
   "Ｗ◇附带灼烧",                                         --飘夜
   }

   --newkdef[172妙笔丹青]=function()
   ItemInfo[172]={
   --"Ｌ习得武功：妙笔丹青",

   "Ｗ武功威力：888",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：56",
   "Ｗ武功范围：◇ 4格",

   "Ｄ秘技特效：",
   "Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
   "Ｗ◇琴棋书画·画地为牢：使妙笔丹青攻击附带冰封，高几率发动",
   "Ｗ◇琴棋书画·江山如画：大幅提升妙笔丹青冰封效果，几率发动",

   "Ｚ特别说明：无"                                         --飘夜
   }

   --newkdef[173黄沙万里鞭]=function()
   ItemInfo[173]={
   --"Ｌ习得武功：黄沙万里鞭",

   "Ｗ武功威力：900",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：49",
   "Ｗ武功范围：田 6格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇增加暴击率",
   "Ｗ◇附带灼烧",                                         --飘夜
   }

   --newkdef[174银两]=function()
   ItemInfo[174]={
   "Ｌ物品说明：有钱能使鬼推磨",                                        --飘夜
   }

   --newkdef[175银索金铃]=function()
   ItemInfo[175]={
   --"Ｌ习得武功：银铃金锁",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：49",
   "Ｗ武功范围：■ 4+5×5",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇增加连击率", 
   "Ｚ秘技特效：",
   "Ｗ◇学会海叟钓法和银铃金锁。",                                      
   "Ｗ◇自身范围内一格15%概率不受到伤害。",                                      
   }

   --newkdef[176阴阳倒乱刃]=function()
   ItemInfo[176]={
   --"Ｌ习得武功：阴阳倒乱刃",

   "Ｗ武功威力：900",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：36",
   "Ｗ武功范围：◇ 3格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇高连击",                                         --飘夜
   }

   --newkdef[177渔叟钓法]=function()
   ItemInfo[177]={
   --"Ｌ习得武功：海叟钓法",

   "Ｗ武功威力：300",
   "Ｗ武功气攻：-",
   "Ｗ内力消耗：42",
   "Ｗ武功范围：田 6格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇增加连击率",  
   "Ｚ秘技特效：",
   "Ｗ◇学会海叟钓法和银铃金锁。",                                      
   "Ｗ◇自身范围内一格15%概率不受到伤害。",                                       --飘夜
   }

   --newkdef[178大剪刀刀法]=function()
   ItemInfo[178]={
   --"Ｌ习得武功：大剪刀",

   "Ｗ武功威力：600",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：0",
   "Ｗ武功范围：田 3格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇高暴击",                                         --飘夜
   }

   --newkdef[179鹤蛇八打]=function()
   ItemInfo[179]={
   --"Ｌ习得武功：鹤蛇八打",

   "Ｗ武功威力：500",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：35",
   "Ｗ武功范围：米 4格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇增加暴击率",
   "Ｗ◇附带冰封、中毒（20）",                                         --飘夜
   }


   --newkdef[180持瑶琴]=function()
   ItemInfo[180]={
   --"Ｌ习得武功：持瑶琴",

   "Ｗ武功威力：600",
   "Ｗ武功气攻：-",
   "Ｗ内力消耗：28",
   "Ｗ武功范围：■ 5+9×9",

   "Ｄ秘技特效：",
   "Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
   "Ｗ◇琴棋书画·琴音悦耳：攻击不造成怒气，100%发动",
   "Ｗ◇琴棋书画·菩提清心：使敌方怒气减半，几率发动",
   "Ｗ◇剑胆琴心：同时修炼独孤九剑和持瑶琴",
   "Ｗ◇剑胆琴心：战斗中受到的伤害会转化为临时的御剑系数提高",
   "Ｗ            *持续整场战斗有效，系数加成后的总和不会超过320",
   "Ｗ◇剑胆琴心：使用持瑶琴攻击时，自身恢复5%当前血量并减少10点内伤",

   "Ｚ特别说明：",                                         --飘夜
   "Ｗ◇习得独孤九剑后，再学习持瑶琴的需求降低40点"
   }

   --newkdef[181棋盘招式]=function()
   ItemInfo[181]={
   --"Ｌ习得武功：棋盘招式",

   "Ｗ武功威力：777",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：28",
   "Ｗ武功范围：田 3格",

   "Ｄ秘技特效：",
   "Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
   "Ｗ◇琴棋书画·棋高一着：追加1200气攻，100%发动",
   "Ｗ◇琴棋书画·星罗棋布：额外提升1000气攻，几率发动",

   "Ｚ特别说明：无",                                         --飘夜
   }

   --newkdef[182罗盘]=function()
   ItemInfo[182]={
   "Ｌ物品说明：藏着未知的秘密",                                    -- by 飘夜
   }

   --newkdef[183裴将军帖]=function()
   ItemInfo[183]={
   --"Ｌ习得武功：裴将军帖",

   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：14",
   "Ｗ武功范围：米 4格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇增加暴击率",
   "Ｗ◇附带冰封",                                         --飘夜
   }

   --newkdef[184中平枪法]=function()
   ItemInfo[184]={
   --"Ｌ习得武功：中平枪法",

   "Ｗ武功威力：300",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：14",
   "Ｗ武功范围：田 4格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇高连击",
   "Ｗ◇附带灼烧",                                         --飘夜
   }

   --newkdef[185毒龙鞭法]=function()
   ItemInfo[185]={
   --"Ｌ习得武功：毒龙鞭法",

   "Ｗ武功威力：300",
   "Ｗ武功气攻：-",
   "Ｗ内力消耗：14",
   "Ｗ武功范围：米 5格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇附带冰封、中毒（10）",                                         --飘夜
   }

   --newkdef[186杨家枪]=function()
   ItemInfo[186]={
   --"Ｌ习得武功：杨家枪法",

   "Ｗ武功威力：250",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：7",
   "Ｗ武功范围：田 6格",

   "Ｄ秘技特效：",

   "Ｚ特别说明：",
   "Ｗ◇增加暴连击率",                                         --飘夜
   }

   --newkdef[187子午针灸经]=function()
   ItemInfo[187]={
   "Ｌ消耗药材获得药品：九转熊蛇丸",                                         --飘夜
   }

   --newkdef[188华佗内昭图]=function()
   ItemInfo[188]={
   "Ｌ消耗药材获得药品：无常丹、九花玉露丸",                                         --飘夜
   }

   --newkdef[189胡青牛医书]=function()
   ItemInfo[189]={
   "Ｌ消耗药材获得药品：黑玉断续膏",                                         --飘夜
   }

   --newkdef[190千金方]=function()
   ItemInfo[190]={
   "Ｌ消耗药材获得药品：小还丹、白云熊胆丸",                                         --飘夜
   }

   --newkdef[191黄帝内经]=function()
   ItemInfo[191]={
   "Ｌ消耗药材获得药品：天香续命膏、田七鲨胆散",                                         --飘夜
   }

   --newkdef[192毒经]=function()
   ItemInfo[192]={
   "Ｌ消耗药材获得药品：无",                                         --飘夜
   }

   --newkdef[193药王神篇]=function()
   ItemInfo[193]={
   "Ｌ消耗药材获得药品：黄连解毒丸、牛黄血竭丹、六阳正气丹",                                         --飘夜
   }

   --newkdef[194翡翠杯]=function()
   ItemInfo[194]={
   "Ｌ物品说明：欲饮梨花酒，当用翡翠杯",                                         --飘夜
   }

   --newkdef[195铁铲]=function()
   ItemInfo[195]={
   "Ｌ物品说明：用于挖土",                                         --飘夜
   }

   --newkdef[196大燕传国玉玺]=function()
   ItemInfo[196]={
   "Ｌ物品说明：大燕传国玉玺",                                         --飘夜
   }

   --newkdef[197大燕皇帝世系谱表]=function()
   ItemInfo[197]={
   "Ｌ物品说明：大燕皇帝世系谱表",                                         --飘夜
   }

   --newkdef[198赏善罚恶令]=function()
   ItemInfo[198]={
   "Ｌ物品说明：得此令者，请赴侠客岛",                                         --飘夜
   }

   --newkdef[199两页刀法]=function()
   ItemInfo[199]={
   "Ｌ物品说明：胡家刀法总纲",                                         --飘夜
   }

   --newkdef[200七宝指环]=function()
   ItemInfo[200]={
   "Ｌ物品说明：逍遥派掌门信物", 
   "Ｇ装备效果；逍遥派武功威力+100",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：逍遥派武学时，50%概率追加封穴5点",
   "Ｗ◇LV.2：逍遥派武学时，60%概率追加封穴5点",
   "Ｗ◇LV.3：逍遥派武学时，70%概率追加封穴5点",
   "Ｗ◇LV.4：逍遥派武学时，80%概率追加封穴5点",
   "Ｗ◇LV.5：逍遥派武学时，90%概率追加封穴5点",
   "Ｗ◇LV.6（MAX）：必封穴，并50%发动“七宝琉璃”", 
   "Ｄ【七宝琉璃】：",
   "Ｗ◇减少敌方气防值50%",                               
   }

   --newkdef[201断肠草]=function()
   ItemInfo[201]={
   "Ｌ物品说明：有剧毒",                                   -- by 飘夜
   }

   --newkdef[202闯王军刀]=function()
   ItemInfo[202]={
   "Ｇ装备效果；胡家刀法威力+100",

   "Ｄ装备等级：无",                                 -- by 飘夜
   }

   --newkdef[203玄冰碧火酒]=function()
   ItemInfo[203]={
   "Ｌ物品说明：内力中和的药酒",                                   -- by 飘夜
   }

   --newkdef[204苗人凤眼毒解药]=function()
   ItemInfo[204]={
   "Ｌ物品说明：苗人凤眼毒解药",                                   -- by 飘夜
   }

   --newkdef[205神杖]=function()
   ItemInfo[205]={
   "Ｌ物品说明：武林盟主之杖",                                   -- by 飘夜
   }

   --newkdef[206唐诗选集]=function()
   ItemInfo[206]={
   "Ｌ物品说明：唐诗选集",                                   -- by 飘夜
   }

   --newkdef[207七心海棠]=function()
   ItemInfo[207]={
   "Ｌ物品说明：剧毒之物",                                   -- by 飘夜
   }

   --newkdef[208信]=function()
   ItemInfo[208]={
   "Ｌ物品说明：只是一封信",                                   -- by 飘夜
   }

   --newkdef[209药材]=function()
   ItemInfo[209]={
   "Ｌ物品说明：用于炼药",                                   -- by 飘夜
   }

   --newkdef[210食材]=function()
   ItemInfo[210]={
   "Ｌ物品说明：用于做饭或酿酒",                                   -- by 飘夜
   }

   --newkdef[211一撮金毛]=function()
   ItemInfo[211]={
   "Ｌ物品说明：金毛狮王谢逊的头发",                                   -- by 飘夜
   }

   --newkdef[212广陵散琴曲]=function()
   ItemInfo[212]={
   "Ｌ物品说明：失传已久的琴谱",                                   -- by 飘夜
   }

   --newkdef[213刘仲甫呕血棋谱]=function()
   ItemInfo[213]={
   "Ｌ物品说明：失传已久的棋谱",                                   -- by 飘夜
   }

   --newkdef[214张旭率意帖]=function()
   ItemInfo[214]={
   "Ｌ物品说明：草圣张旭的字帖",                                   -- by 飘夜
   }

   --newkdef[215溪山行旅图]=function()
   ItemInfo[215]={
   "Ｌ物品说明：北宋名画",                                   -- by 飘夜
   }

   --newkdef[216带头大哥书信]=function()
   ItemInfo[216]={
   "Ｌ物品说明：信中记载了乔峰的身世",                                   -- by 飘夜
   }

   --newkdef[217鸳刀]=function()
   ItemInfo[217]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：使用夫妻刀法时，必定连击",
   "Ｗ◇LV.5：使用夫妻刀法时，必定连击，追加500气攻",
   "Ｗ◇LV.6（MAX）：使用夫妻刀法时，必定连击，追加500气攻，伤害提高20%",                                -- by 飘夜
   }

   --newkdef[218鸯刀]=function()
   ItemInfo[218]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：使用夫妻刀法时，必定连击",
   "Ｗ◇LV.5：使用夫妻刀法时，必定连击，追加500气攻",
   "Ｗ◇LV.6（MAX）：使用夫妻刀法时，必定连击，追加500气攻，伤害提高20%",                                -- by 飘夜
   }

   --newkdef[219一颗头颅]=function()
   ItemInfo[219]={
   "Ｌ物品说明：成昆的项上人头",                                   -- by 飘夜
   }

   --newkdef[220食神秘籍]=function()
   ItemInfo[220]={
   "Ｌ消耗食材获得食物：叫花鸡、好逑汤、玉笛谁家听落梅、腊八粥",  

   "Ｗ◇萧中慧、黄蓉修炼必得：玉笛谁家听落梅（15食材）",
   "Ｗ◇人厨子修炼必得：腊八粥（25食材）",                                       --飘夜
   }

   --newkdef[221酒神秘籍]=function()
   ItemInfo[220]={
   "Ｌ消耗食材获得酒：梨花酒、玉露酒、即墨老酒、五宝花蜜酒",  

   "Ｗ◇祖千秋修炼必得：五宝花蜜酒（25食材）",                                       --飘夜
   }

   ItemInfo[222]={
   --"Ｌ习得武功：韦陀棍法",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   ItemInfo[223]={
   --"Ｌ习得武功：普渡杖法",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   --newkdef[224手帕]=function()
   ItemInfo[224]={
   "Ｌ物品说明：（80,212）",                                   -- by 飘夜
   }

   --newkdef[225闯王藏宝图]=function()
   ItemInfo[225]={
   "Ｌ物品说明：（64,51）",                                   -- by 飘夜
   }

   --newkdef[226闯王藏宝图]=function()
   ItemInfo[226]={
   "Ｌ物品说明：（24,16）",                                   -- by 飘夜
   }

   --newkdef[227闯王藏宝图]=function()
   ItemInfo[227]={
   "Ｌ物品说明：（45,34）",                                   -- by 飘夜
   }

   --newkdef[228半部四十二章经]=function()
   ItemInfo[228]={
   "Ｌ物品说明：还需要另外半部",                                   -- by 飘夜
   }

   --newkdef[229四十二章经]=function()
   ItemInfo[229]={
   "Ｌ物品说明：藏有满清龙脉的秘密",                                   -- by 飘夜
   }

   --newkdef[230白马]=function()
   ItemInfo[230]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：集气速度增加2点",
   "Ｗ◇LV.3：集气速度增加3点",
   "Ｗ◇LV.5：集气速度增加4点",                                  -- by 飘夜
   }

   --newkdef[231火蟾]=function()
   ItemInfo[231]={
   "Ｌ物品说明：具有抵抗寒毒的功效",                          -- by 飘夜
   }

   --newkdef[232太白三英的书信]=function()
   ItemInfo[232]={
   "Ｌ物品说明：太白三英通敌卖国的证据",                                   -- by 飘夜
   }

   --newkdef[233金娃娃]=function()
   ItemInfo[233]={
   "Ｌ物品说明：金色的娃娃鱼",                                   -- by 飘夜
   }

   --newkdef[234介绍信]=function()
   ItemInfo[234]={
   "Ｌ物品说明：南贤给的介绍信",                                   -- by 飘夜
   }

   --newkdef[235左右互搏之术]=function()
   ItemInfo[235]={
   --"Ｌ习得秘技：左右互搏术",

   "Ｄ秘技特效：",
   "Ｗ◇左右互搏几率：（71-资质）%",

   "Ｚ特别说明：",                                         --飘夜
   "Ｗ◇需资质低于31",
   }

   --newkdef[236真武剑]=function()
   ItemInfo[239]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：无",                                -- by 飘夜
   }

   --newkdef[237连城剑诀]=function()
   ItemInfo[237]={
   --"Ｌ习得武功：连城剑法",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：《 6格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇增加连击率",
   "Ｗ◇高暴击",                                         --飘夜
   }

   --newkdef[238祖传护身符]=function()
   ItemInfo[238]={
   "Ｌ物品说明：祖上宝物，佩戴很舒心",                         -- by 飘夜
   }

   --newkdef[239金丝手套]=function()
   ItemInfo[239]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：无",                                -- by 飘夜
   }

   --newkdef[240玄铁匕首]=function()
   ItemInfo[240]={
   "Ｇ装备效果；无",

   "Ｄ装备等级：无",                                 -- by 飘夜
   }

   --newkdef[241君子剑]=function()
   ItemInfo[241]={
   "Ｇ装备效果；全真剑法威力+100",

   "Ｄ装备等级：无",                                 -- by 飘夜
   }

   --newkdef[242淑女剑]=function()
   ItemInfo[242]={
   "Ｇ装备效果；玉女剑法威力+100",

   "Ｄ装备等级：无",                                -- by 飘夜
   }

   --newkdef[243金刀黑剑]=function()
   ItemInfo[243]={
   "Ｇ装备效果；阴阳倒乱刃威力+200",

   "Ｄ装备等级：无",                                -- by 飘夜
   }

   --newkdef[244西毒蛇杖]=function()
   ItemInfo[244]={
   "Ｇ装备效果；灵蛇杖法威力+200",

   "Ｄ装备等级：",
   "Ｗ◇LV.1：攻击时无视敌方毒抗强制上毒10点",
   "Ｗ◇LV.2：攻击时无视敌方毒抗强制上毒15点",
   "Ｗ◇LV.3：攻击时无视敌方毒抗强制上毒20点",
   "Ｗ◇LV.4：攻击时无视敌方毒抗强制上毒25点",
   "Ｗ◇LV.5：攻击时无视敌方毒抗强制上毒30点",
   "Ｗ◇LV.6（MAX）：攻击时无视敌方毒抗强制上毒35点",                                  -- by 飘夜
   }

   --newkdef[245达摩剑谱]=function()
   ItemInfo[245]={
   --"Ｌ习得武功：达摩剑法",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：米 5格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                        --飘夜
   }

   --newkdef[246百胜刀法]=function()
   ItemInfo[246]={
   --"Ｌ习得武功：百胜刀法",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：△ 6格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                      --飘夜
   }

   --newkdef[247灵蛇杖法]=function()
   ItemInfo[247]={
   --"Ｌ习得武功：灵蛇杖法",

   "Ｗ武功威力：1400",
   "Ｗ武功气攻：1400",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：田 5格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇攻击附带中毒",                                         --飘夜
   }

   --newkdef[248三花聚顶掌]=function()
   ItemInfo[248]={
   --"Ｌ习得武功：三花聚顶掌",

   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：35",
   "Ｗ武功范围：米 6格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                     --飘夜
   }

   --newkdef[249铁指诀]=function()
   ItemInfo[249]={
   --"Ｌ习得武功：铁指诀",

   "Ｗ武功威力：250",
   "Ｗ武功气攻：300",
   "Ｗ内力消耗：7",
   "Ｗ武功范围：▽ 7格",

   "Ｄ秘技特效：",

   "Ｚ特别说明：",
   "Ｗ◇增加暴击率",
   "Ｗ◇附带中毒",                                         --飘夜
   }

   --newkdef[250天竺佛指]=function()
   ItemInfo[250]={
   --"Ｌ习得武功：天竺佛指",

   "Ｗ武功威力：300",
   "Ｗ武功气攻：300",
   "Ｗ内力消耗：14",
   "Ｗ武功范围：▽ 4格",

   "Ｄ秘技特效：无",

   "Ｄ一脉相承：",
   "Ｗ◇无相劫指",

   "Ｚ特别说明：",
   "Ｗ◇高暴击",                                         --飘夜
   }

   --newkdef[251夺魄指]=function()
   ItemInfo[251]={
   --"Ｌ习得武功：夺魄指",

   "Ｗ武功威力：350",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：350",
   "Ｗ武功范围：▽ 7格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                         --飘夜
   }

   --newkdef[252凌波微步]=function()
   ItemInfo[252]={
   --"Ｌ习得轻功：凌波微步",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
   "Ｗ◇被攻击20%的几率闪避攻击。",
   "Ｗ◇每次被击中后，增加闪避200点，闪避后清除。",
   }

   --newkdef[253去烦恼指]=function()
   ItemInfo[253]={
   --"Ｌ习得武功：去烦恼指",

   "Ｗ武功威力：400",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：175",
   "Ｗ武功范围：▽ 6格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇增加连击率",                                         --飘夜
   }

   --newkdef[254袖中指]=function()
   ItemInfo[254]={
   --"Ｌ习得武功：袖中指",

   "Ｗ武功威力：400",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：▽ 6格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                         --飘夜
   }

   --newkdef[255兰花拂穴手]=function()
   ItemInfo[255]={
   --"Ｌ习得武功：兰花拂穴手",

   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：米 5格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇高几率封穴",                                         --飘夜
   }


   --newkdef[256透骨打穴]=function()
   ItemInfo[256]={
   --"Ｌ习得武功：透骨打穴",

   "Ｗ武功威力：600",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：米 5格",

   "Ｄ秘技特效：",

   "Ｚ特别说明：",
   "Ｗ◇高几率封穴",                                         --飘夜
   }

   --newkdef[257旋风扫叶腿]=function()
   ItemInfo[257]={
   --"Ｌ习得武功：旋风扫叶腿",

   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：35",
   "Ｗ武功范围：▽ 7格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                        --飘夜
   }

   --newkdef[258玄天指]=function()
   ItemInfo[258]={
   --"Ｌ习得武功：玄天指",

   "Ｗ武功威力：800",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：▽ 6格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇高暴击",
   "Ｗ◇附带冰封",                                         --飘夜
   }

   --newkdef[259黑风指法]=function()
   ItemInfo[259]={
   --"Ｌ习得武功：黑风指",

   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：150",
   "Ｗ武功范围：▽ 6格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：",
   "Ｗ◇增加连击率",
   "Ｗ◇附带冰封",                                         --飘夜
   }

   --newkdef[260大智无定指]=function()
   ItemInfo[260]={
   --"Ｌ习得武功：大智无定指",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：35",
   "Ｗ武功范围：▽ 6格",

   "Ｄ秘技特效：",
   "Ｗ◇除却四相：同时修炼多罗叶指/大智无定指/无相劫指/拈花指",
   "Ｗ◇除却四相：被攻击50%几率触发免疫本次攻击造成的内伤/封穴/冰封/灼烧",
   "Ｗ◇除却四相：被攻击后50%几率生命+100",
   "Ｗ◇除却四相：50%几率被打加100集气",

   "Ｚ特别说明：",                                       --飘夜
   }

   --newkdef[261凝血神爪]=function()
   ItemInfo[261]={
   --"Ｌ习得武功：凝血神爪",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：米 5格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",
                                          --飘夜
   }

   --newkdef[262汗血宝马]=function()
   ItemInfo[262]={
   "Ｇ装备效果；集气+8，时序回复流血值2点",                                  -- by 飘夜
   }

   --newkdef[263天外玄铁]=function()
   ItemInfo[263]={
   "Ｇ物品说明；稀世罕有的材料",                                  -- by 飘夜
   }

   --newkdef[264飞云骓]=function()
   ItemInfo[264]={
   "Ｇ装备效果；集气+12",                                -- by 飘夜
   }

   --newkdef[265金刚不坏体]=function()
   ItemInfo[265]={
   --"Ｌ习得内功：金刚不坏体",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每3时序回复1点内伤",
   "Ｗ◇被攻击时60%几率发动“金刚不坏”，高优先级降低30%所承受伤害及杀气",
   "Ｗ *同时学有易筋神功+金刚不坏体，主运【易筋神功】被攻击必出“金刚不坏”",

   "Ｄ罗汉金身(秘技特效)：",
   "Ｗ◇学会罗汉伏魔功、金刚不坏体",
   "Ｗ◇运功罗汉伏魔功、金刚不坏体或易筋经神功",
   "Ｗ◇受到第一次的伤害概率减伤50%",

   }

   --newkdef[266四象步法]=function()
   ItemInfo[266]={
   --"Ｌ习得轻功：飞天神行",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
   "Ｗ◇集气速度+10",
   "Ｗ◇行动结束后，下回合集气+200（可与其他效果叠加）"
   }

   --newkdef[267神行百变]=function()
   ItemInfo[267]={
   --"Ｌ习得轻功：神行百变",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇无视ZOC限制移动，且移动格数+2（提升移动能力需下回合生效）",
   "Ｗ◇被攻击12%的几率完全闪避攻击,并使之后5时序闪避几率翻倍",
   "Ｗ◇没闪避时，有25%的几率触发神行百变减伤，降低30%的伤害及杀气"
   }

   --newkdef[268拈花指法]=function()
   ItemInfo[268]={
   --"Ｌ习得武功：拈花指",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：180",
   "Ｗ武功范围：米 6格",

   "Ｄ秘技特效：",
   "Ｗ◇除却四相：同时修炼多罗叶指/大智无定指/无相劫指/拈花指",
   "Ｗ◇除却四相：被攻击50%几率触发",
   "Ｗ◇除却四相：免疫本次攻击造成的内伤/封穴/冰封/灼烧",

   "Ｚ特别说明：",                                       --飘夜
   }

   --newkdef[269无相劫指法]=function()
   ItemInfo[269]={
   --"Ｌ习得武功：无相劫指",

   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1300",
   "Ｗ内力消耗：240",
   "Ｗ武功范围：▽ 7格",

   "Ｄ秘技特效：",
   "Ｗ◇除却四相：同时修炼多罗叶指/大智无定指/无相劫指/拈花指",
   "Ｗ◇除却四相：被攻击50%几率触发",
   "Ｗ◇除却四相：免疫本次攻击造成的内伤/封穴/冰封/灼烧",

   "Ｚ特别说明：",                                       --飘夜
   }

   --newkdef[270参合指法]=function()
   ItemInfo[270]={
   --"Ｌ习得武功：参合指",

   "Ｗ武功威力：1400",
   "Ｗ武功气攻：1500",
   "Ｗ内力消耗：350",
   "Ｗ武功范围：▽ 8格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                       --飘夜
   }

   --newkdef[271沧溟刀法]=function()
   ItemInfo[271]={
   --"Ｌ习得武功：沧溟刀法",

   "Ｗ武功威力：1300",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：210",
   "Ｗ武功范围：△ 7格",

   "Ｄ秘技特效：",
   "Ｗ◇利刃寒锋：同时修炼修罗/阴风/沧溟刀",
   "Ｗ◇利刃寒锋：攻击时，有50%几率追加10时序的冻结状态，暴怒必触发",
   "Ｗ            *冻结状态下，无法集气，亦无法时序回复状态",

   "Ｚ特别说明：",
   "Ｗ◇颠动沧溟：使用沧溟刀法攻击30%几率触发",
   "Ｗ◇颠动沧溟：额外杀气，且必定造成流血",
   "Ｗ◇颠动沧溟：刀主有二次判定",                                        --飘夜
   "Ｗ◇附带冰封"
   }

   --newkdef[272茯苓花雕猪]=function()
   ItemInfo[272]={
   "Ｌ物品说明：稀有的猪，名贵的猪",                                   -- by 飘夜
   }

   --newkdef[273皇宫通行令]=function()
   ItemInfo[273]={
   "Ｌ物品说明：进出皇宫，通行无阻",                                   -- by 飘夜
   }

   --newkdef[274一指禅]=function()
   ItemInfo[274]={
   --"Ｌ习得武功：一指禅",

   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：▽ 7格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                      --飘夜
   }

   --newkdef[275化骨绵掌]=function()
   ItemInfo[275]={
   --"Ｌ习得武功：化骨绵掌",

   "Ｗ武功威力：700",
   "Ｗ武功气攻：-",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：米 5格",

   "Ｚ特别说明：",
   "Ｗ◇附带冰封、中毒(30)",                                         --飘夜
   "Ｄ秘技特效：",
   "Ｗ◇紫气天罗：同时学有灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌",
   "Ｗ◇紫气天罗：攻击随机附加1~3层“冰冻状态”，每层减缓1%集气速度，上限50层",
   "Ｗ◇紫气天罗：被攻击时冻结敌人5时序",
   "Ｗ◇紫气天罗：灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌威力提升300点",
   }

   --newkdef[276火枪]=function()
   ItemInfo[276]={
   "Ｇ装备效果：火枪要术威力+3000",                                       --飘夜
   }

   --newkdef[277多罗叶指]=function()
   ItemInfo[277]={
   --"Ｌ习得武功：多罗叶指",

   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：150",
   "Ｗ武功范围：▽ 6格",

   "Ｄ秘技特效：",
   "Ｗ◇除却四相：同时修炼多罗叶指/大智无定指/无相劫指/拈花指",
   "Ｗ◇除却四相：被攻击50%几率触发",
   "Ｗ◇除却四相：免疫本次攻击造成的内伤/封穴/冰封/灼烧",

   "Ｚ特别说明：",                                       --飘夜
   }

   --newkdef[278越女剑法]=function()
   ItemInfo[278]={
   --"Ｌ习得武功：越女剑法",

   "Ｗ武功威力：1400",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：7",
   "Ｗ武功范围：■ 10+11X11",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                       --飘夜
   }

   --newkdef[279毛驴]=function()
   ItemInfo[279]={
   "Ｇ装备效果；血量越低，集气速度越快",

   "Ｄ装备等级：无",                               -- by 飘夜
   }

   --newkdef[280玉女心经]=function()
   ItemInfo[280]={
   --"Ｌ习得内功：玉女心经",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇连击时有（30+天书数×2）%的几率触发“夭矫空碧”特效，此次连击伤害、",
   "Ｗ  杀气不减",
   "Ｗ◇攻击的第一击有（天书数×2）%几率触发“进趋如风”特效，追加一次连击",
   "Ｗ *主角使用时几率增加5%，且爆豆时在每回合的第一次出手必发动",
   "Ｗ◇被攻击时，降低50%本次攻击所造成的灼烧",
   "Ｗ 【女性专属】气攻伤害增加20%",

   "Ｄ秘技特效：",
   "Ｗ *同时学有玉女心经+先天功，每时序额外回复1点封穴",

   }

   --newkdef[281商会令牌]=function()
   ItemInfo[281]={
   "Ｌ物品说明：可在大商家处兑换一万银两",                                   -- by 飘夜
   }

   --newkdef[282天罗地网]=function()
   ItemInfo[282]={
   --"Ｌ习得轻功：天罗地网",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
   "Ｗ◇攻击时无视敌方的闪避效果强制命中，且自身攻击范围+1",
   "Ｗ◇击中的敌方下回合移动格数-1",
   "Ｗ *强制命中可针对敌方真葵花移行、凌波微步、神行百变等特效",
   "Ｗ *强制命中还可无视我方被刺目等状态"
   }

   --newkdef[283五轮大法]=function()
   ItemInfo[283]={
   --"Ｌ习得武功：五轮大法",

   "Ｗ武功威力：1300",
   "Ｗ武功气攻：1300",
   "Ｗ内力消耗：180",
   "Ｗ武功范围：田 6格",

   "Ｄ秘技特效：无",

   "Ｚ特别说明：无",                                    --飘夜
   }

   --newkdef[284瘦黄马]=function()
   ItemInfo[284]={
   "Ｇ装备效果；血量越低，集气速度越快",

   "Ｄ装备等级：无",                               -- by 飘夜
   }

   --newkdef[285血河神鉴]=function()
   ItemInfo[285]={
   --"Ｌ习得内功：血河神鉴",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每5时序回复1点内伤",
   "Ｗ◇高优先级提升10%伤害",
   "Ｗ◇攻击时必定造成流血",
   "Ｗ◇攻击时，恢复造成伤害10%的血量（单次攻击上限100点）",
   "Ｄ一脉相承：",
   "Ｗ◇天魔功",
   }

   --newkdef[286九阴真经上卷]=function()
   ItemInfo[286]={
   "Ｌ物品说明：上卷，下卷合起来有用。这是上卷",                                   -- by 飘夜
   }

   --newkdef[287九阴真经下卷]=function()
   ItemInfo[287]={
   "Ｌ物品说明：上卷，下卷合起来有用。这是下卷",                                   -- by 飘夜
   }

   --newkdef[288断裂的倚天剑]=function()
   ItemInfo[288]={
   "Ｌ物品说明：断剑，不能用了，要用天外玄铁修补",                                   -- by 飘夜
   }

   --newkdef[289断裂的屠龙刀]=function()
   ItemInfo[289]={
   "Ｌ物品说明：断刀，不能用了，要用天外玄铁修补",                                   -- by 飘夜
   }

   --newkdef[290白蟒鞭法]=function()
   ItemInfo[290]={
   --"Ｌ习得武功：白蟒鞭法",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：？？",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：田 5格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：",                                        --飘夜
   }

   --newkdef[291大力金刚指]=function()
   ItemInfo[291]={
   --"Ｌ习得武功：大力金刚指",

   "Ｗ武功威力：1000",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：245",
   "Ｗ武功范围：▽ 7格",

   "Ｄ秘技特效：无",
   "Ｚ特别说明：无",                                         --飘夜
   }

   --newkdef[292呼延枪法]=function()
   ItemInfo[292]={
   --"Ｌ习得武功：呼延枪法",

   "Ｗ武功威力：400",
   "Ｗ武功气攻：-",
   "Ｗ内力消耗：14",
   "Ｗ武功范围：米 4格",

   "Ｄ秘技特效：",
   "Ｗ◇寸长寸强：",
   "Ｗ◇寸长寸强：使用任意奇门武功攻击不随距离递减，距离每远一格伤害增加1%",
   "Ｚ特别说明：无",                                         --飘夜
   }

   --newkdef[293楞伽经]=function()
   ItemInfo[293]={
   "Ｌ物品说明：佛教经典",                                   -- by 飘夜
   }

   --newkdef[294瑜伽密乘]=function()
   ItemInfo[294]={
   --"Ｌ习得内功：瑜伽密乘",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每3时序回复1点内伤",
   "Ｗ◇免疫破绽",
   "Ｗ◇被攻击时，集气不会被杀至300以下",
   "Ｗ◇被连击时，受到的攻击效果/气攻降低40%",
   "Ｚ秘技特效：",
   "Ｗ◇梵我合一：学会神足经、瑜伽密乘主运其中一个",
   "Ｗ◇梵我合一：受到会暴击或连击的攻击时，20%几率终止敌方行动",
   }

   --newkdef[295太极神功]=function()
   ItemInfo[295]={
   --"Ｌ习得内功：太极神功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇被攻击时，有60%几率获得“太极之形”（可累积，上限10个）",
   "Ｗ◇每个“太极之形”可提高自身集气1点",
   "Ｗ◇主动攻击时，可释放累积的“太极之形”，增加连击数",
   "Ｗ （每个5太极之形增加一次连击）",
   "Ｗ◇被攻击储存蓄力值，使用太极拳/剑跟据蓄力值增加效果",
   "Ｗ◇太极拳/剑蓄力值300～600，攻击范围+2",
   "Ｗ◇太极拳/剑蓄力值超过600，攻击范围变为可移动面攻，且必定连击",
   "Ｗ◇根据蓄力值增加防御跟减伤",
   "Ｗ◇太极拳太极剑法威力+200",
   "Ｗ◇触发太极奥义时，必定触发“太极真义·四两拨千斤”",
   "Ｗ◇触发太极奥义时，减伤10%，触发真太极奥义时减伤20%。",
   "Ｗ◇行动后自动执行防御防御指令",
   "Ｄ太极特效：",
   "Ｚ◇<转阴阳>",
   "Ｗ◇被攻击时30%概率反弹自身所有异常",
   "Ｄ太极特效：",
   "Ｚ◇<开太极>",
   "Ｗ◇主运太极神功，使用太极拳法或太极剑法",
   "Ｗ◇蓄力值超过500且暴怒触发",
   "Ｗ◇根据当前生命值跟内力值追加大范围伤害，生命比例越低、内力比例越高伤害越高",

   }

   --newkdef[296梯云纵横]=function()
   ItemInfo[296]={
   --"Ｌ习得轻功：梯云纵横",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
   "Ｗ◇攻击伤害不随距离递减",
   "Ｗ◇被攻击时，有50%的几率触发梯云纵横，降低50%的杀气"
   }

   --newkdef[297瞬息千里]=function()
   ItemInfo[297]={
   --"Ｌ习得轻功：瞬息千里",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇无视ZOC限制移动，且移动格数+2（提升移动能力需下回合生效）",
   "Ｗ◇暴怒时集气速度提升至3倍",
   "Ｗ◇暴怒时免疫封穴"
   }

   --newkdef[298阴风刀]=function()
   ItemInfo[298]={
   --"Ｌ习得武功：阴风刀",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：《 7格",

   "Ｄ秘技特效：",
   "Ｗ◇利刃寒锋：同时修炼修罗/阴风/沧溟刀",
   "Ｗ◇利刃寒锋：攻击时，有50%几率追加10时序的冻结状态，暴怒必触发",
   "Ｗ            *冻结状态下，无法集气，亦无法时序回复状态",
   "Ｚ特别说明：无"
   }

   ItemInfo[299]={
   --"Ｌ习得内功：五岳剑诀",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇被攻击时如未触发真气护体，则发动“以剑御气”降低50%气攻",
   "Ｗ◇五岳剑法威力+200",
   "Ｗ◇使用五岳剑法，必出“气贯五岳”，追加气攻提高至1500，且无视绝对气防",
   "Ｗ◇五岳剑法分别获得如下的强化效果：",
   "Ｗ  *西岳：连击时变为三连击",
   "Ｗ  *南岳：对于血量低于一半的敌人伤害加倍",
   "Ｗ  *北岳：杀伤范围+1格",
   "Ｗ  *东岳：攻击后20时序内有30%几率闪避",
   "Ｗ  *中岳：对敌方造成伤害同时扣除对其伤害量的内力",
   }

   ItemInfo[300]={
   "Ｇ装备效果；50%机率触发“降龙四叠浪”，增加降龙三叠浪机率。",
   "Ｄ装备等级：",
   "Ｗ◇LV.1：增加降龙三叠浪机率5%",
   "Ｗ◇LV.2：增加降龙三叠浪机率10%",
   "Ｗ◇LV.3：增加降龙三叠浪机率15%",
   "Ｗ◇LV.4：增加降龙三叠浪机率20%",
   "Ｗ◇LV.5：增加降龙三叠浪机率25%",
   "Ｗ◇LV.6（MAX）：增加降龙三叠浪机率30%",
   "Ｄ装备特效：",
   "Ｚ特别说明："
   }

   --newkdef[301十方步]=function()
   ItemInfo[301]={
   --"Ｌ习得轻功：十方步",
   "Ｗ被攻击概率在3*3可移动区域闪现，躲避攻击后且能反击。",
   "Ｎ",
   "Ｄ运功效果：",

   }

   --newkdef[302护身戒指]=function()
   ItemInfo[302]={
   "Ｇ装备效果；",
   }

   --newkdef[303复活戒指]=function()
   ItemInfo[303]={
   "Ｇ装备效果；",
   }

   --newkdef[304隐身戒指]=function()
   ItemInfo[304]={
   "Ｇ装备效果；",
   }

   --newkdef[305火枪要术]=function()
   ItemInfo[305]={
   --"Ｌ习得武功：火枪要术",

   "Ｎ",
   "Ｄ秘技特效：",
   "Ｚ特别说明：无"
   }

   --newkdef[306黄金包袱]=function()
   ItemInfo[306]={
   "Ｌ物品说明：黄人凤的包袱",
   }

   --newkdef[307灵鳌步]=function()
   ItemInfo[307]={
   --"Ｌ习得轻功：灵鳌步",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇被攻击概率以移动在自身为中点的九宫中的其中一点，如果武功攻击范围覆盖九宫，或者九宫是不可移动地形则无效。",
   }

   --newkdef[306鲸息功]=function()
   ItemInfo[308]={
   --"Ｌ习得内功：鲸息功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇时序增加怒气值2点",
   "Ｗ◇每3时序回1内伤",
   "Ｗ◇每时序回1点中毒",
   "Ｗ◇30%概率造成目标集气紊乱",
   "Ｗ◇时序回复3点生命/6点内力",
   "Ｗ◇使用碧海惊涛掌攻击概率触发六大奇劲：",
      "Ｗ陷空力：忽视绝对气防+破防50%",	
      "Ｗ滔天炁：触发大范围伤害",	
      "Ｗ生灭道：攻击后触发霸体一回合",
      "Ｗ漩涡劲：增加一次连击",		
      "Ｗ阴阳流：必冰封必灼烧",	
      "Ｗ滴水劲：附加气攻值5%伤害",
   "Ｗ◇根据蓄力值增加气防值",
   "Ｗ◇被攻击跟据伤害值蓄力，蓄力值大于1000自身攻击必暴击",
   "Ｗ◇根据蓄力值提升气攻",
   "Ｗ◇免疫冰封",
   }

   --newkdef[309小李飞刀]=function()
   ItemInfo[309]={
   --"Ｌ习得武功：无",
   "Ｄ秘技特效：",
   "Ｚ特别说明：李寻欢专属"
   }

   --newkdef[310碧海惊涛掌]=function()
   ItemInfo[310]={
   --"Ｌ习得武功：碧海惊涛掌",

   "Ｗ武功威力：1400",
   "Ｗ武功气攻：1400",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：米字 4格",

   "Ｄ秘技特效：(梁萧专属)学会“鲸息功”使用碧海惊涛掌可触发六大奇劲",
      "陷空力：忽视绝对气防+破防40%",	
      "滔天炁：触发大范围伤害",	
      "生灭道：攻击后触发霸体一回合",
      "漩涡劲：增加一次连击，最多增加两次",		
      "阴阳流：必冰封必灼烧",	
      "滴水劲：附加气攻值5%伤害",
   "Ｚ特别说明：无"
   }

   --newkdef[311太虚剑意]=function()
   ItemInfo[311]={
   --"Ｌ习得内功：太虚剑意",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每3时序回1内伤",
   "Ｗ◇每时序回2点气血",
   "Ｗ◇吸血一半的伤害生成护盾。",
   "Ｗ◇ “坐忘无我 韬光养晦”：被攻击时，受到气攻大于1500发动，吸收气攻值为自身的气防",
   "Ｗ◇ “三环套月”：使用剑法时太虚剑意加力50%机率三连击",
   "Ｗ◇ “万剑归宗”：使用剑法时太虚剑意加力高概率造成封穴，追加气攻值1500点",
   }

   --newkdef[312神秘护符]=function()
   ItemInfo[312]={
   "Ｚ特别说明：神秘护符"
   }

   --newkdef[313斩流剑术]=function()
   ItemInfo[313]={
   --"Ｌ习得武功：斩流剑术",

   "Ｗ武功威力：1400",
   "Ｗ武功气攻：1600",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：线型 8格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：无"
   }

   --newkdef[314千年冰蚕]=function()
   ItemInfo[314]={
   "Ｌ物品说明：千年冰蚕，炼制地灵丹的药材之一",
   "Ｄ使用效果：+100抗毒",                                   
   }

   --newkdef[315神木王鼎]=function()
   ItemInfo[315]={
   "Ｌ物品说明：星宿派至宝，可炼制药品",
   "Ｄ使用效果：无",
   }

   --newkdef[316地灵丹]=function()
   ItemInfo[316]={
   "Ｌ物品说明：改变人物内力属性",  
   }

   --newkdef[317不老长春功]=function()
   ItemInfo[317]={
   --"Ｌ习得内功：不老长春功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇时序回复(5+天书数量)的生命值",
   "Ｗ◇时序回复(5+天书数量)的内力值",
   "Ｗ◇血量百分比高于内力百分比时",
   "Ｗ◇时序回复百分之一内力",
   "Ｗ◇血量百分比低于内力百分比时",
   "Ｗ◇时序回复百分之一生命",
   }

   --newkdef[318阳春白雪曲]=function()
   ItemInfo[318]={
   --"Ｌ习得武功：阳春白雪曲",

   "Ｗ武功威力：1300",
   "Ｗ武功气攻：1400",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：面 4格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：无",                                     
   }

   --newkdef[319一苇渡江]=function()
   ItemInfo[319]={
   --"Ｌ习得轻功：一苇渡江",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇无视ZOC限制移动，且移动格数+2（提升移动能力需下回合生效）",
   "Ｗ◇受到封穴减少50%",
   "Ｗ◇初始集气位置+500，",
   "Ｗ◇30%概率减伤30%",
   "Ｄ被动效果：",
   "Ｗ◇集气速度不受异常影响",
   }

   --newkdef[320狼牙]=function()
   ItemInfo[320]={
   "Ｇ装备效果；攻击时50%几率造成流血",
   "Ｄ装备等级：",
   "Ｗ◇LV.1：攻击时50%几率造成流血",
   "Ｗ◇LV.2：攻击时60%几率造成流血",
   "Ｗ◇LV.3：攻击时70%几率造成流血",
   "Ｗ◇LV.4：攻击时80%几率造成流血",
   "Ｗ◇LV.5：攻击时90%几率造成流血",
   "Ｗ◇LV.6（MAX）：攻击时必造成流血，50%机率发动“天狼啸月”",
   "Ｄ装备特效：",
   "Ｗ◇“天狼啸月”：造成敌全体集气-100"
   }

   --newkdef[321井月八法]=function()
   ItemInfo[321]={
   --"Ｌ习得武功：井月八法",

   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1300",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：井字 6格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：无",                                        
   "Ｗ◇暴击率提升5%"
   }

   --newkdef[322擒龙手]=function()
   ItemInfo[322]={
   --"Ｌ习得武功：擒龙手",

   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：米字 5格",

   "Ｚ秘技特效：",
   "Ｗ◇虎鹤双形：学会擒龙手、虎爪绝户手。",
   "Ｗ◇攻击时概率触发“虎啸”、“龙吟”。", 
   "Ｗ◇虎啸：周身六格内目标概率混乱", 
   "Ｗ◇龙吟：被击的目标击集气位置倒退300。",                                       --飘夜
   }

   --newkdef[323伏魔禅杖]=function()
   ItemInfo[323]={
   "Ｇ装备效果；伏魔杖法威力+200，增加世尊降魔触发机率(装备等级*2)",
   "Ｄ装备等级：无",                               -- by 飘夜
   }

   --newkdef[324般若掌]=function()
   ItemInfo[324]={
   --"Ｌ习得武功：般若掌",

   "Ｗ武功威力：1300",
   "Ｗ武功气攻：1300",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：米字 4格",

   "Ｄ秘技特效：",
   "Ｗ◇金刚般若：学会大力金刚掌、般若掌、龙象般若功，破防目标30%",
   "Ｗ◇大力金刚掌必暴击,般若掌攻击范围变成点，威力提高。",
   "Ｗ◇主运龙象般若功，概率触发【十龙十象】击晕目标。",
   "Ｚ特别说明：",                                       --飘夜
   }

   --newkdef[325猿公剑法]=function()
   ItemInfo[325]={
   --"Ｌ习得武功：猿公剑法",

   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：35",
   "Ｗ武功范围：线 8格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：",                                       --飘夜
   }

   --newkdef[326白猿]=function()
   ItemInfo[326]={
   "Ｇ装备效果；猿公剑法/越女剑法威力+200",
   "Ｄ装备等级：无",                               -- by 飘夜
   }

   --newkdef[327天魔功]=function()
   ItemInfo[327]={
   --"Ｌ习得内功：天魔功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇吸血20%",
   "Ｗ◇攻击必暴击",
   "Ｗ◇无视目标30%防御",
   "Ｗ◇行动后增加10点怒气值",
   "Ｗ◇“天魔大法”：暴怒时30%几率入魔",
   "Ｗ◇“天魔大法”：免疫封穴杀气，额外吸血20%，必连击概率三连击",
   "Ｗ◇“天魔大法”：暴怒结束入魔结束",
   "Ｗ◇“天魔金身”：受攻击时如自身生命值低于一半，免疫攻击10时序，CD200时序",
   }

   --newkdef[328庄子]=function()
   ItemInfo[328]={
   --"Ｌ习得内功：大周天功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每5时序回复1点内伤",
   "Ｗ◇“养生主概率50%",
   "Ｗ◇封穴减少50%",
   "Ｗ◇“大宗师”：攻击50%概率触发，无视对方30%的防御。",
   "Ｗ◇“养生主”：被攻击30%触发50时序内，时序回复气血2/内力4，",
   "Ｗ免疫封穴，时序清除所有内伤",
   }

   --newkdef[329奔雷手]=function()
   ItemInfo[329]={
   --"Ｌ习得武功：奔雷手",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1100",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：米字 5格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：",                                       --飘夜
   }

   --newkdef[330追魂夺命剑谱]=function()
   ItemInfo[330]={
   --"Ｌ习得武功：追魂夺命剑法",

   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：线 8格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：",                                       --飘夜
   }

   --newkdef[331庖丁解牛刀]=function()
   ItemInfo[332]={
   --"Ｌ习得武功：庖丁解牛刀",






   "Ｄ秘技特效：",
   "Ｚ特别说明：",
   }
   --newkdef[332袈裟伏魔功]=function()
   ItemInfo[332]={
   --"Ｌ习得武功：袈裟伏魔功",

   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：面 3格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：",                                       --飘夜
   }

   --newkdef[333迷踪连环腿]=function()
   ItemInfo[333]={
   --"Ｌ习得武功：迷踪连环腿",

   "Ｗ武功威力：800",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：50",
   "Ｗ武功范围：十字 5格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：",                                       --飘夜
   }

   --newkdef[334无极玄功拳]=function()
   ItemInfo[334]={
   --"Ｌ习得武功：无极玄功拳",

   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：米字 4格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：",                                       --飘夜
   }

   --newkdef[335青冥剑]=function()
   ItemInfo[335]={
   "Ｇ装备效果；剑法攻击范围+1",
   "Ｄ装备等级：无",                               -- by 飘夜
   }

   --newkdef[336武穆遗书]=function()
   ItemInfo[336]={
   --"Ｌ习得特技：武穆遗书",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇根据（实战数值/2）增加战场攻击力",
   "Ｗ◇根据（实战数值/2）增加战场防御力",
   "Ｗ我方全体攻击增加（实战数值/25）%",
   "Ｄ秘技特效：",
   "Ｗ◇血战沙场：同时修炼岳家枪法/岳王散手/武穆遗书",
   "Ｗ◇血战沙场：使用岳家枪法/岳王散手对周身7X7范围内的敌人造成10~20点伤害1次",
   "Ｗ            根据击杀数和怒气值(每50点怒气增加1次，暴怒额外增加2次)增加伤害次数",
   "Ｚ特别说明：", 
   "Ｗ威力等于750+实战数值",
   }

   --newkdef[337岳王散手]=function()
   ItemInfo[337]={
   --"Ｌ习得武功：岳王散手",

   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：米字 4格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：",                                       --飘夜
   }

   --newkdef[338冰蚕毒掌]=function()
   ItemInfo[338]={
   --"Ｌ习得武功：冰蚕毒掌",
   "Ｎ",
   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1100",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：米字 4格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｗ◇毒布武林：同时修炼五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌",
   "Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
   "Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
   }

   --newkdef[339青驴]=function()
   ItemInfo[339]={
   "Ｇ装备效果；集气速度增加5点，体力消耗减2点",
   }	                            -- by 飘夜


   --newkdef[340寒袖拂穴]=function()
   ItemInfo[340]={
   --"Ｌ习得武功：寒袖拂穴",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1100",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：面攻 4格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：",     
   "Ｗ◇必定封穴",                                  --飘夜
   }

   --newkdef[341白虹掌力]=function()
   ItemInfo[341]={
   --"Ｌ习得武功：白虹掌力",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1100",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：米字 4格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：",                                       --飘夜
   }

   --newkdef[342长生诀]=function()
   ItemInfo[342]={
   --"Ｌ习得内功：长生诀",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇免疫内伤",
   "Ｗ◇减少30%受到的气攻",
   "Ｗ◇重生回复满血并立即行动",
   "Ｗ◇时序回点3点气血",
   "Ｗ◇顾道长生：被攻击时25%概率触发，5时序内每时序恢复最大生命内力1%",
   "Ｗ◇阴阳相生：攻击造成灼烧时必定造成冰封，造成冰封时必定造成灼烧",
   }

   --newkdef[346四大山皮肤]=function()
   ItemInfo[346]={
   "Ｌ四大山皮肤",
   "Ｌ至尊江湖，至尊江湖，绿色国产单机武侠，至尊江湖倒闭了。",
   "Ｌ王八蛋老板四大山,吃喝嫖赌欠下了3.5个亿，带着他的小姨子跑了。",
   "Ｌ我们没有没有办法，拿着皮肤抵工资。",
   "Ｌ原价都是三百多、二百多、一百多的皮肤，通通二十块，通通二十块！",
                                       --飘夜
   }

   --newkdef[349绣花针]=function()
   ItemInfo[349]={
   "Ｇ装备效果；进战集气增加900，必流血，破防5%",
   "Ｄ装备等级：",
   "Ｗ◇LV.1：破防5%",
   "Ｗ◇LV.2：破防10%",
   "Ｗ◇LV.3：破防15%",
   "Ｗ◇LV.4：破防25%",
   "Ｗ◇LV.5：破防25%",
   "Ｗ◇LV.6（MAX）：破防30%，必破气防"                            
   }

   --newkdef[350玉女素心剑法]=function()
   ItemInfo[350]={
   --"Ｌ习得武功：玉女素心剑法",

   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：400",
   "Ｗ武功范围：《 8格",

   "Ｚ特别说明：",
   "Ｗ◇增加连击率",                                         --飘夜
   }

   --newkdef[351擒龙功]=function()
   ItemInfo[351]={
   --"Ｌ习得内功：擒龙功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇免疫反弹、反击",
   "Ｗ◇增加丐世无双触发概率10%",
   "Ｗ◇降龙打狗招式概率增加5%",
   "Ｗ◇时序回复流血2点",
   "Ｗ◇丐世无双学会其中一种另一种要求再降低20",
   "Ｗ◇降龙极意概率高于等于40增加概率10",
   "Ｗ◇降龙极意概率低于40增加概率20",
   "Ｗ◇增加打狗极意20%",
   }

   --newkdef[352呼延鞭法]=function()
   ItemInfo[352]={
   --"Ｌ习得武功：呼延鞭法",

   "Ｗ武功威力：400",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：15",
   "Ｗ武功范围：田 4格",

   "Ｄ秘技特效：",
   "Ｗ◇寸长寸强：同时修炼呼延枪法和呼延鞭法",
   "Ｗ◇寸长寸强：使用任意奇门武功攻击不随距离递减，距离每远一格伤害增加1%",
   }

   --newkdef[353震天铁掌]=function()
   ItemInfo[353]={
   --"Ｌ习得武功：震天铁掌",

   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：390",
   "Ｗ武功范围：米 4格",
   }

   --newkdef[354枯禅神功]=function()
   ItemInfo[354]={
   --"Ｌ习得内功：枯禅神功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇时序回复内力3点",
   "Ｗ◇免疫内伤",
   "Ｗ◇指法出招式概率+20%",
   "Ｗ◇亦枯亦荣：每回合消耗内力最大值的5%回复生命值",
   "Ｗ◇一阳指威力增加200，六脉神剑“剑气碧烟横”出招增加10%",
   }

   --newkdef[355少林心法]=function()
   ItemInfo[355]={
   --"Ｌ习得内功：少林心法",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇5时序回复内伤1",
   "Ｚ特别说明：少林一脉相承",  
   "Ｗ◇学会少林心法，修炼易筋经时可以一脉相承",
   }

   --newkdef[356武当心法]=function()
   ItemInfo[356]={
   --"Ｌ习得内功：武当心法",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇5时序回复内伤1",
   "Ｚ特别说明：武当一脉相承",  
   "Ｗ◇学会武当心法，修炼太极神功时可以一脉相承",
   }

   --newkdef[357全真心法]=function()
   ItemInfo[357]={
   --"Ｌ习得内功：全真心法",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇5时序回复内伤1",
   "Ｚ特别说明：全真一脉相承",  
   "Ｗ◇学会全真心法，修炼先天功时可以一脉相承",
   }

   --newkdef[358古墓心法]=function()
   ItemInfo[358]={
   --"Ｌ习得内功：古墓心法",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇5时序回复内伤1",
   "Ｚ特别说明：古墓一脉相承",  
   "Ｗ◇学会古墓心法，修炼玉女神功时可以一脉相承",
   }

   --newkdef[359华山心法]=function()
   ItemInfo[359]={
   --"Ｌ习得内功：华山心法",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇5时序回复内伤1",
   "Ｚ特别说明：华山一脉相承",  
   "Ｗ◇学会华山心法，修炼紫霞神功时可以一脉相承",
   }

   --newkdef[360嵩山心法]=function()
   ItemInfo[360]={
   --"Ｌ习得内功：嵩山心法",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇5时序回复内伤1",
   "Ｚ特别说明：嵩山一脉相承",  
   "Ｗ◇学会嵩山心法，修炼寒冰真气时可以一脉相承",
   }

   --newkdef[361血刀心法]=function()
   ItemInfo[361]={
   --"Ｌ习得内功：血刀心法",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇5时序回复内伤1",
   "Ｚ特别说明：血刀一脉相承",  
   "Ｗ◇学会血刀心法，修炼血河神鉴时可以一脉相承",
   }

   --newkdef[362莲花功]=function()
   ItemInfo[362]={
   --"Ｌ习得内功：莲花功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇5时序回复内伤1",
   "Ｚ特别说明：丐帮一脉相承",  
   "Ｗ◇学会莲花功，修炼擒龙功时可以一脉相承",
   }

   --newkdef[363地火功]=function()
   ItemInfo[363]={
   --"Ｌ习得内功：地火功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇5时序回复内伤1",
   "Ｚ特别说明：明教一脉相承",  
   "Ｗ◇学会地火功，修炼圣火神功时可以一脉相承",
   }

   --newkdef[364峨眉心法]=function()
   ItemInfo[364]={
   --"Ｌ习得内功：峨眉心法",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇5时序回复内伤1",


   --"Ｚ特别说明：峨眉一脉相承",  
   --"Ｗ◇学会峨眉心法，修炼XX神功时可以一脉相承",
   }

   --newkdef[365小星罗功]=function()
   ItemInfo[365]={
   --"Ｌ习得内功：小星罗功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇5时序回复内伤1",
   }

   --newkdef[366寒冰真气]=function()
   ItemInfo[366]={
   --"Ｌ习得内功：寒冰真气",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇拳法武功出招+20%",
   "Ｗ◇对冰封值超过80的人概率冻结",
   "Ｗ◇5时序回内伤1点",
   "Ｗ◇攻击必冰封",
   "Ｗ◇免疫冰封",
   }

   --newkdef[367五毒宝典]=function()
   ItemInfo[367]={
   --"Ｌ习得内功：五毒神功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇五毒神掌威力提升350点，战斗中基础威力随机提升1-3倍",
   "Ｗ◇五毒神掌变为赤练神掌，追加70点伤害，引爆目标身上毒素",
   "Ｗ◇攻击强制上毒20点",
   "Ｗ◇攻击时根据目标中毒值追加伤害",
   "Ｄ秘技特效：",
   "Ｗ◇毒布武林：同时修炼五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌",
   "Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
   "Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
   }

   --newkdef[368金雁功]=function()
   ItemInfo[368]={
   --"Ｌ习得轻功：金雁功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇轻功+20%，无视ZOC限制移动范围+2",
   "Ｗ◇气防值+800",
   "Ｗ◇暴击率增加20%，暴击伤害增加10%"
   }

   --newkdef[369蛇行狸翻]=function()
   ItemInfo[369]={
   --"Ｌ习得轻功：蛇行狸翻",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇轻功+20%，无视ZOC限制移动范围+2",
   "Ｗ◇“每20时序(轻功值)%机率集气往前跳跃（轻功值）/10位置",
   "Ｗ◇15%概率闪避攻击"
   }

   --newkdef[370葵花点穴手]=function()
   ItemInfo[370]={
   --"Ｌ习得武功：葵花点穴手",

   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：▽ 7格",

   "Ｚ特别说明：",
   "Ｗ◇攻击必定封穴",
   }

   --newkdef[371龟息功]=function()
   ItemInfo[371]={
   --"Ｌ习得内功：龟息功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇蓄力状态下集气速度增加30%",
   "Ｗ◇被攻击时概率进入防御状态，初始概率25，生命越低概率越高",
   "Ｗ◇防御状态下无法被杀气，被攻击35%概率触发“伺机而动”集气位置增加100",
   "Ｗ◇防御状态下被攻击时反震目标内伤15点",
   "Ｗ◇时序回生命2点",
   "Ｗ◇5时序回内伤1点",
   "Ｗ◇免疫破绽",
   "Ｗ◇休息时自动防御",
   "Ｄ一脉相承：",  
   "Ｗ◇学习不老长春功时可以一脉相承。",
   }

   --newkdef[372中庸之道]=function()
   ItemInfo[372]={
      --"Ｌ习得秘技：中庸之道",
      "Ｎ",
      "Ｄ中庸之道壹 天命之谓性",
      "Ｗ◇每（资质-1）时序行动一次",
      "Ｎ",
      "Ｄ中庸之道贰 率性之谓道",
      "Ｗ◇受到攻击后如果满怒，（资质-29）%几率结束对手攻击并反击",
      "Ｎ",
      "Ｚ特别说明：",
      "Ｗ◇需资质低于80且资质大于30",
   }

   --newkdef[373八卦心法]=function()
   ItemInfo[373]={
   --"Ｌ习得内功：八卦心法",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇使用拳法刀法，系数必然不低于对方。",
   "Ｗ◇拳法刀法武功出招概率+20%。",     
   "Ｚ特别说明：",
   "Ｗ◇主运八卦心法，八卦刀法与八卦掌法威力+200",  
   }

   --newkdef[374八卦刀法]=function()
   ItemInfo[374]={
   --"Ｌ习得武功：八卦刀法",

   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：△ 5格",

   "Ｚ特别说明：",
   "Ｗ◇主运八卦心法，八卦刀法与八卦掌法威力+200",
   }

   --newkdef[375神门十三剑]=function()
   ItemInfo[375]={
   --"Ｌ习得武功：神门十三剑",
   "Ｎ",
   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：《 6格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｗ◇洞虛玄門：同时修炼神门十三剑/玄虚刀法",
   "Ｗ◇洞虛玄門：玄虚刀法必封穴，神门十三剑必冰封灼烧",
   "Ｗ◇洞虛玄門：受到攻击30%几率使用双倍内力抵消一半伤害",
   "Ｎ",
   "Ｚ特别说明：",
   "Ｗ◇必封穴",
   }

   --newkdef[376五虎棍法]=function()
   ItemInfo[376]={
   --"Ｌ习得武功：五虎棍法",

   "Ｗ武功威力：600",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：田 4格",

   "Ｄ秘技特效：",
   "Ｗ◇五虎闹东京：同时修炼五虎断门刀和五虎棍法",
   "Ｗ◇赞天虎身轻如燕：一虎在场，攻击时30%几率提升全队100集气",
   "Ｗ◇彻地虎是条好汉：二虎在场，被攻击时30%几率提高1000点气防",
   "Ｗ◇穿山虎铁臂神拳：三虎在场，攻击时30%几率增加100点伤害",
   "Ｗ◇翻江虎身手不凡：四虎在场，集气条30%几率跳跃10点集气速度",
   "Ｗ◇锦毛虎一身是胆：五虎在场，被攻击时30%几率反弹10%伤害",
   "Ｚ特别说明：",
   }

   --newkdef[377流云飞袖]=function()
   ItemInfo[377]={
   --"Ｌ习得武功：流云飞袖",

   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：面 3格",

   "Ｄ秘技特效：",
   "Ｚ特别说明：",
   }

   --newkdef[378武当九阳功]=function()
   ItemInfo[378]={
   --"Ｌ习得内功：武当九阳功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇拳掌功夫招式概率+20%。",
   "Ｗ◇增加伤害10%，减伤10%。",    
   "Ｄ一脉相承：",  
   "Ｗ◇学习九阳神功时可以一脉相承。",
   }

   --newkdef[379峨眉九阳功]=function()
   ItemInfo[379]={
   --"Ｌ习得内功：峨眉九阳功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇剑法武功招式概率+20%。",
   "Ｗ◇行动后概率触发“佛光普照”清除自身灼烧/中毒/冰封/流血/内伤。",   
   "Ｄ一脉相承：",  
   "Ｗ◇学习九阳神功时可以一脉相承。",    
   }

   --newkdef[380少林九阳功]=function()
   ItemInfo[380]={
   --"Ｌ习得内功：少林九阳功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇奇门武功招式概率+20%。",
   "Ｗ◇被攻击概率减伤20%并进入防御状态。",   
   "Ｄ一脉相承：",  
   "Ｗ◇学习九阳神功时可以一脉相承。",   
   }

   --newkdef[381虎爪绝户手]=function()
   ItemInfo[381]={
   --"Ｌ习得武功：虎爪绝户手",

   "Ｗ武功威力：900",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：米 4格",
   "Ｚ秘技特效：",
   "Ｗ◇虎鹤双形：学会擒龙手、虎爪绝户手。",
   "Ｗ◇攻击时概率触发“虎啸”、“龙吟”。", 
   "Ｗ◇擒龙手，虎爪绝户手概率+20，暴怒概率双倍。",  
   "Ｗ◇虎啸：被击中的目标概率混乱", 
   "Ｗ◇龙吟：被击中的目标集气位置倒退300。",  
   }

   --newkdef[382疯魔棍谱]=function()
   ItemInfo[382]={
   --"Ｌ习得武功：疯魔棍法",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：11000",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：田 5格",

   "Ｄ秘技特效：",

   "Ｚ特别说明：",  
   }

   --newkdef[383金蛇缠丝手]=function()
   ItemInfo[383]={
   --"Ｌ习得武功：金蛇缠丝手",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：11000",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：▽ 5格",

   "Ｄ秘技特效：",

   "Ｚ特别说明：",
   }

   --newkdef[384小周天功]=function()
   ItemInfo[384]={
   --"Ｌ习得内功：小周天功",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇增加攻击伤害15%，减少受到的伤害15%。",
   "Ｗ◇5时序回复内伤1点。",   

   }


   ItemInfo[385]={
      --"Ｌ习得内功：金刚狮子吼",
      
      "Ｎ",
      "Ｄ运功效果：",
      "Ｗ◇行动前诵念金刚咒",
      "Ｗ  七格范围内我方获得200点护盾",
      "Ｗ  七格范围内敌方伤害降低20%，受到伤害增加20%，20%几率度化敌方一回合",
      }

   ItemInfo[386]={
      --"Ｌ习得内功：岳家枪法",
      
      }  

   --newkdef[387神足经]=function()
   ItemInfo[387]={
   --"Ｌ习得内功：神足经",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇未装备武器时，攻击后根据拳掌数值一半追加伤害",
   "Ｗ◇未装备防具时，攻击后根据指法数值一半获得护盾",
   "Ｗ◇未装备坐骑时，攻击后根据奇门数值一半提升下回合集气位置",
   "Ｗ◇每点体质增加1%伤害",
   "Ｗ◇每点体质减少1%受伤",
   "Ｚ秘技特效：",
   "Ｗ◇梵我合一：学会神足经、瑜伽密乘，主运其中一门",
   "Ｗ◇梵我合一：受到会暴击或连击的攻击时，20%几率终止敌方行动",
   }

   --newkdef[388天刀九问]=function()
   ItemInfo[388]={
   --"Ｌ习得得武功：天刀九问",

   "Ｗ武功威力：600",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：280",
   "Ｗ武功范围：△ 7格",
   "Ｚ特效：◇九歌：攻击时概率触发，最低30%概率增加连击次数；回合结束根据气攻值回复生命; 每点九歌状态增加下次触发九歌的概率+10%。", 
   "Ｚ特别说明：",    
   "Ｗ根据天书数量提升威力杀气",                                    --小飞侠
   }

   --newkdef[389忘情天书]=function()
   ItemInfo[389]={
   --"Ｌ习得内功：忘情天书",
   "Ｄ运功效果：",
   "Ｗ1书领悟：“天意”死亡时必触发“天意”复活一次",
   "Ｗ2书领悟：“水逝”增加冰封，冰封过50点概率发动“月映”冰冻5时序", 
   "Ｗ3书领悟：“火延”增加燃烧，燃烧过50点概率发动“日明”点燃目标",    
   "Ｗ4书领悟：“土掩”减伤30点，机率发动“风流”完全闪避攻击",         
   "Ｗ5书领悟：“云翳”必杀集气200，20%/暴怒后50%概率“忘情无我”反弹全部伤害。", 
   "Ｗ◇时序回复1点流血。",
   "Ｗ◇时序回复2点生命，4点内力。", 
   "Ｚ特效：顾惜朝、萧秋水获得七本天书后，且学会了忘情天书，自动运功。",  
   }

   --newkdef[390玉碎掌]=function()
   ItemInfo[390]={
      --"Ｌ习得内功：玉碎掌",

   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：350",
   "Ｗ武功范围：■ 5+5×5",
   "Ｗ武功特效：必冰封",

   "Ｄ秘技特效：",
   "Ｎ",
   "Ｚ特别说明：",
   }

   --newkdef[402绕指柔剑]=function()
   ItemInfo[402]={
   --"Ｌ习得武功：绕指柔剑",
   "Ｎ",
   "Ｗ武功威力：400",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：15",
   "Ｗ武功范围：十字 4格",
   "Ｎ",                                    --小飞侠
   "Ｄ秘技特效：",
   "Ｎ",
   "Ｚ特别说明：",
   }

   --newkdef[403芙蓉金针功]=function()
   ItemInfo[403]={
   --"Ｌ习得武功：芙蓉金针",
   "Ｎ",
   "Ｗ武功威力：6",
   "Ｗ武功气攻：0",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[404碧罗掌]=function()
   ItemInfo[404]={
   --"Ｌ习得武功：碧罗掌",
   "Ｎ",
   "Ｗ武功威力：400",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字5格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[405流云掌]=function()
   ItemInfo[405]={
   --"Ｌ习得武功：流云掌",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：20",
   "Ｗ武功范围：十字4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[406回风落雁剑]=function()
   ItemInfo[406]={
   --"Ｌ习得武功：回风落雁剑",
   "Ｎ",
   "Ｗ武功威力：600",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：15",
   "Ｗ武功范围：《 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[407衡山五神剑]=function()
   ItemInfo[407]={
   --"Ｌ习得武功：衡山五神剑",
   "Ｎ",
   "Ｗ武功威力：900",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：30",
   "Ｗ武功范围：《 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[408镇岳诀]=function()
   ItemInfo[408]={
   --"Ｌ习得武功：镇岳诀",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：正方形4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[409无妄神功]=function()
   ItemInfo[409]={
   --"Ｌ习得武功：无妄神咒",
   "Ｎ",
   "Ｗ武功威力：600",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：50",
   "Ｗ武功范围：正方形4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --大长和诀
   ItemInfo[410]={
   --"Ｌ习得武功：大长和诀",
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇免疫内伤",
   "Ｗ◇时序回复内力3点",
   "Ｗ◇3时序回复内伤1点", --新
   "Ｗ◇指法武功破防+10%。", --新
   "Ｗ◇指法出招式概率+20%",
   "Ｗ◇目标气防越高，受到的伤害也越高，如果目标有内功蓄力效果，受到的伤害增加50%，且会直接清除对方的蓄力效果。",--新
   "Ｗ◇亦枯亦荣：每回合消耗5%内力5%回复8%生命值", --新
   "Ｗ◇一阳指威力增加200，六脉神剑“剑气碧烟横”出招增加10%",
   }

   --newkdef[411伏魔剑法]=function()
   ItemInfo[411]={
   --"Ｌ习得武功：伏魔剑法",
   "Ｎ",
   "Ｗ武功威力：600",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：25",
   "Ｗ武功范围：3格大米",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[412天长掌法]=function()
   ItemInfo[412]={
   --"Ｌ习得武功：天长掌法",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：米 5格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[413春蚕掌法]=function()
   ItemInfo[413]={
   --"Ｌ习得武功：春蚕掌法",
   "Ｎ",
   "Ｗ武功威力：900",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：20",
   "Ｗ武功范围：米 5格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[414降魔掌]=function()
   ItemInfo[414]={
   --"Ｌ习得武功：降魔掌",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：15",
   "Ｗ武功范围：移米 2格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[415静心守剑]=function()
   ItemInfo[415]={
   --"Ｌ习得武功：静心守剑",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：50",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[416古针禅功]=function()
   ItemInfo[416]={
   --"Ｌ习得武功：古针禅功",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：50",
   "Ｗ武功范围：正方形4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[417五大夫剑]=function()
   ItemInfo[417]={
   --"Ｌ习得武功：五大夫剑",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：15",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[418七星落长空]=function()
   ItemInfo[418]={
   --"Ｌ习得武功：七星落长空",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：25",
   "Ｗ武功范围：2格3*3□",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[419盘罡掌]=function()
   ItemInfo[419]={
   --"Ｌ习得武功：盘罡掌",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：20",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[420开山掌]=function()
   ItemInfo[420]={
   --"Ｌ习得武功：开山掌",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[420开山掌]=function()
   ItemInfo[421]={
   --"Ｌ习得外功：浑天气功",
   "Ｎ",
   "Ｗ武功威力：1350",
   "Ｗ武功气攻：1350",
   "Ｗ内力消耗：30",
   "Ｗ武功范围：正方形4格",
   "Ｎ",
   "Ｗ◇时序回复内力3点,内力3点，体力1点。",
   "Ｗ◇3时序回复内伤1点", --新
   "Ｗ◇掌法/指法/棍法武功破防+10%。", --新
   "Ｗ◇气攻+2000，气防+2000，集气-10%。",--新
   "Ｗ◇天地浑圆：每次行动前增加5%的防御，上限50%，受到伤害时，50%概率免疫杀气且集气位置+100。", --新
   "Ｗ◇天行健：生命低于50%，恢复气血/内力/体力20%，集气值+2，冷却200时序。", --新
   }

   --newkdef[422参合剑气]=function()
   ItemInfo[422]={
   --"Ｌ习得武功：参合剑气",
   "Ｎ",
   "Ｗ武功威力：1400",
   "Ｗ武功气攻：1500",
   "Ｗ内力消耗：350",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｗ◇参合状态：参合指攻击会给敌人添加参合状态", 
   "Ｗ◇参合状态：攻击时伤害降低10%~20%", 
   "Ｗ◇参合状态：被攻击时受到伤害增加10%~20%",                                       --小飞侠
   }

   --newkdef[423北斗剑法]=function()
   ItemInfo[423]={
   --"Ｌ习得武功：北斗剑法",
   "Ｎ",
   "Ｗ武功威力：400",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：25",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ一脉相承",
   "Ｗ◇学习参合剑气一脉相承",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[424降魔刀法]=function()
   ItemInfo[424]={
   --"Ｌ习得武功：降魔刀法",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：20",
   "Ｗ武功范围：△ 5格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[425回风拂柳剑]=function()
   ItemInfo[425]={
   --"Ｌ习得武功：回风拂柳刀",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：25",
   "Ｗ武功范围：△ 5格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[426八卦游龙掌]=function()
   ItemInfo[426]={
   --"Ｌ习得武功：八卦游龙掌",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[427金刚伏虎刀]=function()
   ItemInfo[427]={
   --"Ｌ习得武功：金刚伏虎刀",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：20",
   "Ｗ武功范围：△ 5格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   --newkdef[428周公剑法]=function()
   ItemInfo[428]={
   --"Ｌ习得武功：周公剑法",
   "Ｎ",
   "Ｗ武功威力：900",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }
   --newkdef[429大嵩阳掌]=function()
   ItemInfo[429]={
   --"Ｌ习得武功：大嵩阳掌",
   "Ｎ",
   "Ｗ武功威力：600",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：15",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }
   --newkdef[430寒冰神掌]=function()
   ItemInfo[430]={
   --"Ｌ习得武功：寒冰神掌",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：15",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }
   --newkdef[431快慢十八路]=function()
   ItemInfo[431]={
   --"Ｌ习得武功：快慢十八路",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：15",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }
   --newkdef[432子午十二剑]=function()
   ItemInfo[432]={
   --"Ｌ习得武功：子午十二剑",
   "Ｎ",
   "Ｗ武功威力：900",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：15",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }
   --newkdef[433迅雷剑法]=function()
   ItemInfo[433]={
   --"Ｌ习得武功：迅雷剑法",
   "Ｎ",
   "Ｗ武功威力：900",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }
   --newkdef[434雨打飞花剑法]=function()
   ItemInfo[434]={
   --"Ｌ习得武功：雨打飞花剑法",
   "Ｎ",
   "Ｗ武功威力：400",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[435]={
   --"Ｌ习得武功：三阴手",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[436]={
   --"Ｌ习得武功：落雁掌",
   "Ｎ",
   "Ｗ武功威力：400",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[437]={
   --"Ｌ习得武功：红砂掌",
   "Ｎ",
   "Ｗ武功威力：600",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[438]={
   --"Ｌ习得武功：蝎尾钩",
   "Ｎ",
   "Ｗ武功威力：4",
   "Ｗ武功气攻：4",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[439]={
   --"Ｌ习得武功：喂毒丧门钉",
   "Ｎ",
   "Ｗ武功威力：7",
   "Ｗ武功气攻：7",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[440]={
   --"Ｌ习得武功：同归剑法",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[441]={
   --"Ｌ习得武功：一气化三清",
   "Ｎ",
   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[442]={
   --"Ｌ习得武功：履霜破冰拳",
   "Ｎ",
   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[443]={
   --"Ｌ习得武功：昊天掌",
   "Ｎ",
   "Ｗ武功威力：400",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[444]={
   --"Ｌ习得武功：飘雪穿云掌",
   "Ｎ",
   "Ｗ武功威力：350",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[445]={
   --"Ｌ习得武功：金顶绵掌",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[446]={
   --"Ｌ习得武功：四象掌",
   "Ｎ",
   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[447]={
   --"Ｌ习得武功：佛光普照",
   "Ｎ",
   "Ｗ武功威力：650",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[448]={
   --"Ｌ习得武功：金顶九式",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[449]={
   --"Ｌ习得武功：截手九式",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[450]={
   --"Ｌ习得武功：霹雳雷火弹",
   "Ｎ",
   "Ｗ武功威力：11",
   "Ｗ武功气攻：11",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[451]={
   --"Ｌ习得武功：抽髓掌",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[452]={
   --"Ｌ习得武功：连环腐尸毒",
   "Ｎ",
   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：米字 4格",
   "Ｗ◇连环腐尸毒·极意：攻击时有30%几率触发，暴怒必定触发",
   "Ｗ◇连环腐尸毒·极意：攻击范围变为面攻，追加1000气攻并引爆目标身上毒素",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｗ◇毒布武林：同时修炼五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌",
   "Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
   "Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
   }

   ItemInfo[453]={
   --"Ｌ习得武功：碧磷针",
   "Ｎ",
   "Ｗ武功威力：3",
   "Ｗ武功气攻：3",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[454]={
   --"Ｌ习得武功：三笑逍遥散",
   "Ｎ",
   "Ｗ武功威力：11",
   "Ｗ武功气攻：11",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[455]={
   --"Ｌ习得武功：三无三不手",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：15",
   "Ｗ武功范围：米字 4格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｎ",
   "Ｚ特别说明：",                                      --小飞侠
   }

   ItemInfo[456]={
   --"Ｌ习得武功：银拂尘功",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：田 6格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[457]={
   --"Ｌ习得武功：玉蜂针",
   "Ｎ",
   "Ｗ武功威力：6",
   "Ｗ武功气攻：6",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[458]={
   --"Ｌ习得武功：冰魄银针",
   "Ｎ",
   "Ｗ武功威力：9",
   "Ｗ武功气攻：9",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[459]={
   --"Ｌ习得武功：宁氏一剑",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｚ特别说明：",      
   "Ｗ攻击时50%几率给敌人添加虚弱状态，暴怒必触发",                               --小飞侠
   }

   ItemInfo[460]={
   --"Ｌ习得武功：玉女十九式",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[461]={
   --"Ｌ习得武功：夺命连环三仙剑",
   "Ｎ",
   "Ｗ武功威力：1100",
   "Ｗ武功气攻：1100",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[462]={
   --"Ｌ习得武功：劈石破玉拳",
   "Ｎ",
   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[463]={
   --"Ｌ习得武功：混元掌",
   "Ｎ",
   "Ｗ武功威力：750",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：280",
   "Ｗ武功范围：■ 10+5×5格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｗ◇混元一气：同时修炼混元掌/混元功",
   "Ｗ◇混元一气：攻击时追加5~15点内伤和5~15时序集气混乱",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[464]={
   --"Ｌ习得武功：伏虎拳",
   "Ｎ",
   "Ｗ武功威力：600",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[465]={
   --"Ｌ习得武功：鹰蛇生死搏",
   "Ｎ",
   "Ｗ武功威力：900",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：15",
   "Ｗ武功范围：米字 4格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｎ",
   "Ｚ特别说明：",                                      --小飞侠
   }

   ItemInfo[466]={
   --"Ｌ习得武功：泼墨披麻剑",
   "Ｎ",
   "Ｗ武功威力：400",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[467]={
   --"Ｌ习得武功：七玹无形剑",
   "Ｎ",
   "Ｗ武功威力：900",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：田 6格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[468]={
   --"Ｌ习得武功：丹青破穴",
   "Ｎ",
   "Ｗ武功威力：600",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：田 6格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[469]={
   --"Ｌ习得武功：黑血神针功",
   "Ｎ",
   "Ｗ武功威力：9",
   "Ｗ武功气攻：9",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[470]={
   --"Ｌ习得武功：葵花神针功",
   "Ｎ",
   "Ｗ武功威力：9",
   "Ｗ武功气攻：9",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[471]={
   --"Ｌ习得武功：段家剑法",
   "Ｎ",
   "Ｗ武功威力：300",
   "Ｗ武功气攻：300",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[472]={
   --"Ｌ习得武功：五罗轻烟掌",
   "Ｎ",
   "Ｗ武功威力：400",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[473]={
   --"Ｌ习得武功：碧海潮生曲",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：田 6格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[474]={
   --"Ｌ习得内功：奇门五转",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇被攻击时5%几率将一半伤害转化为自身护盾",
   "Ｗ◇被攻击时5%几率将一半伤害转化为对方掉血",
   "Ｗ◇被攻击时5%几率将一半伤害转化为内力回复",
   "Ｗ◇被攻击时5%几率攻击转给随机敌方承受",
   "Ｗ◇被攻击时5%几率转移自身位置",
   "Ｗ◇被攻击时25%几率将杀气效果转由对方承受",
   "Ｗ◇武功威力提高5%",
   "Ｗ◇加力/护体/出招几率提高5%",
   "Ｗ◇气攻/气防提高5%",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[475]={
   --"Ｌ习得武功：劈空掌",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[476]={
   --"Ｌ习得武功：碧波掌",
   "Ｎ",
   "Ｗ武功威力：300",
   "Ｗ武功气攻：300",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[477]={
   --"Ｌ习得武功：落英剑法",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：0 田字",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[478]={
   --"Ｌ习得武功：一字电剑",
   "Ｎ",
   "Ｗ武功威力：350",
   "Ｗ武功气攻：300",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｗ◇学习周公剑法时可以一脉相承。",                                     --小飞侠
   }

   ItemInfo[479]={
   --"Ｌ习得武功：十八连环破",
   "Ｎ",
   "Ｗ武功威力：400",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：田 6格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[480]={
   --"Ｌ习得武功：雷公轰",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：田 6格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[481]={
   --"Ｌ习得武功：袖里乾坤",
   "Ｎ",
   "Ｗ武功威力：4",
   "Ｗ武功气攻：4",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[482]={
   --"Ｌ习得武功：天王补心针",
   "Ｎ",
   "Ｗ武功威力：6",
   "Ｗ武功气攻：6",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[483]={
   --"Ｌ习得武功：八仙剑法",
   "Ｎ",
   "Ｗ武功威力：600",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[484]={
   --"Ｌ习得武功：天遁剑法",
   "Ｎ",
   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[485]={
   --"Ｌ习得武功：摧心掌",
   "Ｎ",
   "Ｗ武功威力：900",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：280",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｗ  同时修炼九阴白骨爪/摧心掌/大伏魔拳，暴怒时攻击附带撕裂",
   "Ｎ",
   "Ｚ特别说明：",  
   "Ｗ学会九阴真经后威力翻倍",                                   --小飞侠
   }

   ItemInfo[486]={
   --"Ｌ习得武功：黑沙掌",
   "Ｎ",
   "Ｗ武功威力：300",
   "Ｗ武功气攻：300",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[487]={
   --"Ｌ习得武功：毒龙锥",
   "Ｎ",
   "Ｗ武功威力：4",
   "Ｗ武功气攻：4",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[488]={
   --"Ｌ习得武功：毒蟾砂",
   "Ｎ",
   "Ｗ武功威力：5",
   "Ｗ武功气攻：5",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[489]={
   --"Ｌ习得武功：三蜈五蟆烟",
   "Ｎ",
   "Ｗ武功威力：300",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：60",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[490]={
   --"Ｌ习得武功：金蛇锥功",
   "Ｎ",
   "Ｗ武功威力：7",
   "Ｗ武功气攻：7",
   "Ｗ内力消耗：9",
   "Ｗ武功范围：点 10格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[491]={
   --"Ｌ习得武功：千蛛万毒手",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：15",
   "Ｗ武功范围：米字 4格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｗ◇毒布武林：同时修炼五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌",
   "Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
   "Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
   "Ｎ",
   "Ｚ特别说明：",  
   "Ｗ攻击强制上毒20点，根据目标中毒值回复生命",                                   --小飞侠
   }

   ItemInfo[492]={
   --"Ｌ习得武功：五行六合拳",
   "Ｎ",
   "Ｗ武功威力：900",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：米字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[493]={
   --"Ｌ习得武功：上清快剑",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：线 7格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[494]={
   --"Ｌ习得武功：劈卦刀法",
   "Ｎ",
   "Ｗ武功威力：400",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：△ 5格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[495]={
   --"Ｌ习得武功：雁行刀",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：△ 5格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[496]={
   --"Ｌ习得武功：华岳三神峰",
   "Ｎ",
   "Ｗ武功威力：900",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：△ 5格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[497]={
   --"Ｌ习得武功：大九天手",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：15",
   "Ｗ武功范围：米字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[498]={
   --"Ｌ习得武功：狂风迅雷扇",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：田 6格",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[499]={
   --"Ｌ习得武功：大伏魔拳",
   "Ｎ",
   "Ｗ武功威力：1200",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｗ攻击时几率触发“天之道”，附加目标生命最大值5~10%的伤害",
   "Ｗ主运九阴真经时效果翻倍",  
   "Ｎ",    
   "Ｄ秘技特效：",
   "Ｗ  同时修炼九阴白骨爪/摧心掌/大伏魔拳，暴怒时攻击附带撕裂",
   "Ｎ",                             --小飞侠
   }

   ItemInfo[500]={
   --"Ｌ习得武功：阴阳磨掌",
   "Ｎ",
   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[501]={
   --"Ｌ习得武功：飞凤手",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：十字 4格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[502]={
   --"Ｌ习得武功：分筋错骨手",

   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",
   }

   ItemInfo[503]={
   --"Ｌ习得武功：三阴蜈蚣爪",

   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",
   }

   ItemInfo[504]={
   --"Ｌ习得武功：玄女剑法",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：1300",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：《 5",
   "Ｎ",
   "Ｎ",
   "Ｚ特别说明：",   
   "Ｗ 【女性专属】伤害、气攻增加20%",
   }

   ItemInfo[505]={
   --"Ｌ习得武功：狂风快剑",

   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",
   }

   ItemInfo[506]={
   --"Ｌ习得内功：天地心法",

   "Ｎ",
   "Ｄ运功效果：",
   "Ｎ",
   "Ｚ特别说明：",
   }

   ItemInfo[507]={
   --"Ｌ习得武功：铁剑",
   "Ｎ",
   "Ｗ武功威力：1300",
   "Ｗ武功气攻：1300",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：《 8",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｗ◇铁甲依然在：同时修炼铁掌/铁剑/铁布衫并主运铁布衫",
   "Ｗ◇铁甲依然在：护甲提升20%，被攻击时20%几率抵挡生命最大值2%伤害",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[508]={
   --"Ｌ习得武功：八卦掌",

   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",
   }

   --newkdef[509沥泉神枪]=function()
   ItemInfo[509]={
   "Ｇ装备效果；",

   "Ｄ装备等级：无",
   }

   --newkdef[510冰魄剑]=function()
   ItemInfo[510]={
   "Ｇ装备效果；",

   "Ｄ装备等级：无",
   }

   --newkdef[511雷公轰]=function()
   ItemInfo[511]={
   "Ｇ装备效果；",

   "Ｄ装备等级：无",
   }

   --newkdef[512焦尾琴]=function()
   ItemInfo[512]={
   "Ｇ装备效果；",

   "Ｄ装备等级：无",
   }

   --newkdef[513玉箫]=function()
   ItemInfo[513]={
   "Ｇ装备效果；",

   "Ｄ装备等级：无",
   }

   ItemInfo[514]={
   --"Ｌ习得武功：大慈大悲手",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：3◆",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｗ◇慈悲为怀：同时修炼慈悲刀法和大慈大悲手",
   "Ｗ◇慈悲为怀：道德高于60时，如果伤害大于100减伤（道德-60）点",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[515]={
   --"Ｌ习得武功：韦陀掌",
   "Ｎ",
   "Ｗ武功威力：300",
   "Ｗ武功气攻：300",
   "Ｗ内力消耗：30",
   "Ｗ武功范围：△ 2格",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[516]={
   --"Ｌ习得武功：大阴阳手",
   "Ｎ",
   "Ｗ武功威力：400",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：30",
   "Ｗ武功范围：3十字 ",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[517]={
   --"Ｌ习得武功：屠龙刀法",
   "Ｎ",
   "Ｗ武功威力：1000",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：210",
   "Ｗ武功范围：5直线 ",
   "Ｎ",
   "Ｚ特别说明：", 
   "Ｗ击杀小龙女不会触发复活",                                   --小飞侠
   }

   ItemInfo[518]={
   --"Ｌ习得武功：阿难破戒刀",
   "Ｎ",
   "Ｗ武功威力：1500",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：350",
   "Ｗ武功范围：5▼ ",
   "Ｎ",
   "Ｚ特别说明：",  
   "Ｗ每点道德降低10点威力",                                      --小飞侠
   }

   ItemInfo[519]={
   --"Ｌ习得武功：金龙鞭法",
   "Ｎ",
   "Ｗ武功威力：400",
   "Ｗ武功气攻：400",
   "Ｗ内力消耗：10",
   "Ｗ武功范围：3井",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[520]={
   --"Ｌ习得武功：碧针清掌",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：20",
   "Ｗ武功范围：3大米",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[522]={
   --"Ｌ习得武功：乾元功",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：30",
   "Ｗ武功范围：3井",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }
   --[[
   ItemInfo[523]={
   --"Ｌ习得武功：通幽诀",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：30",
   "Ｗ武功范围：1格3*3□",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }
   ]]

   ItemInfo[524]={
   --"Ｌ习得武功：抱元诀",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：500",
   "Ｗ内力消耗：30",
   "Ｗ武功范围：移1米",
   "Ｎ",
   "Ｄ秘技特效：无",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[525]={
   --"Ｌ习得内功：剑华皈一",
   "Ｄ运功效果：",
   "Ｗ◇行动后扣除5%最大内力",
   "Ｗ◇使用剑法攻击时追加10%当前内力值伤害",    
   }

   ItemInfo[526]={
   --"Ｌ习得内功：铁布衫",
   "Ｄ运功效果：",
   "Ｗ◇行动后扣除5%最大内力",
   "Ｗ◇护甲提升20%",
   "Ｗ◇承受伤害大于100时，减伤60点",
   "Ｄ秘技特效：",
   "Ｗ◇铁甲依然在：同时修炼铁掌/铁剑/铁布衫并主运铁布衫",
   "Ｗ◇铁甲依然在：护甲提升20%，被攻击时20%几率抵挡生命最大值2%伤害",
   "Ｎ",
   "Ｚ特别说明：",                                     --小飞侠
   }

   ItemInfo[527]={
   --"Ｌ习得武功：释迦掷象功",
   "Ｎ",
   "Ｗ武功威力：700",
   "Ｗ武功气攻：700",
   "Ｗ内力消耗：700",
   "Ｗ武功范围：5◆",
   "Ｎ",
   "Ｄ秘技特效：",
   "Ｗ◇阿婆星：学会瑜伽密乘+释迦掷象功",
   "Ｗ◇阿婆星：主运会瑜伽密乘，释迦掷象功追加自身体质X50点伤害",     
   "Ｎ",
   "Ｚ特别说明：",
   "Ｗ必定单击", 
   }     

   ItemInfo[528]={
   --"Ｌ习得武功：天王刀法",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   ItemInfo[529]={
   --"Ｌ习得武功：蓝砂手",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   ItemInfo[530]={
   --"Ｌ习得武功：笑傲江湖曲",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   ItemInfo[531]={
   --"Ｌ习得武功：反两仪刀阵",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   ItemInfo[532]={
   --"Ｌ习得武功：灵犀分水功",
   "Ｄ运功效果：",
   "Ｗ◇攻击时必造成冰封。",
   "Ｗ◇追加敌方冰封程度的伤害。",
   "Ｗ◇增加自身冰封程度/5点集气。",
   "Ｗ◇受到伤害时，回复自身冰封程度2倍的生命。",
   "Ｗ◇受到伤害时，由战场所有目标分担自己所受的此次伤害。",
   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   ItemInfo[533]={
   --"Ｌ习得武功：太乙分光剑谱",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   ItemInfo[534]={
      --"Ｌ习得特技：青城身法",
      "Ｗ◇ 效果：",
      "Ｎ",
      } 

   ItemInfo[535]={
   --"Ｌ习得武功：西岳神剑",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   ItemInfo[536]={
   --"Ｌ习得武功：中岳神剑",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   ItemInfo[537]={
   --"Ｌ习得武功：南岳神剑",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   ItemInfo[538]={
   --"Ｌ习得武功：东岳神剑",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   ItemInfo[539]={
   --"Ｌ习得武功：北岳神剑",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   ItemInfo[540]={
   --"Ｌ习得内功：九霄仙息",

   "Ｎ",
   "Ｄ运功效果：",    
   "Ｎ",
   "Ｚ特别说明：",
   } 


   ItemInfo[541]={
   --"Ｌ习得轻功：幻尘身法",

   "Ｎ",
   "Ｄ运功效果：",    
   "Ｎ",
   "Ｚ特别说明：",
   }
   
   ItemInfo[542]={
   --"Ｌ习得武功：逍遥神剑",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   } 

   ItemInfo[543]={
   --"Ｌ习得内功：阴阳无极功",

   "Ｎ",
   "Ｄ运功效果：",    
   "Ｎ",
   "Ｚ特别说明：",
   }
   
   ItemInfo[544]={
   --"Ｌ习得武功：天道剑势",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   }

   ItemInfo[545]={
   --"Ｌ习得武功：穿花蝶影手",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   }

   ItemInfo[546]={
   --"Ｌ习得武功：太清剑法",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   }

   ItemInfo[547]={
   --"Ｌ习得武功：灵枢定玄指",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   }

   ItemInfo[548]={
   --"Ｌ习得武功：青莲剑法",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   }

   ItemInfo[549]={
   --"Ｌ习得武功：满洲摔跤",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   }

   --newkdef[550秘籍残章]=function()
   ItemInfo[550]={
   "Ｌ物品说明：可以去燕子坞书阁换秘籍",
   }

   ItemInfo[551]={
      --"Ｌ习得武功：潮汐神功",
      
      "Ｎ",
      "Ｄ秘技特效：无",    
      "Ｎ",
      "Ｚ特别说明：",
      }

   ItemInfo[552]={
   --"Ｌ习得武功：千手如来掌",

   "Ｎ",
   "Ｄ秘技特效：无",    
   "Ｎ",
   "Ｚ特别说明：",
   }

   ItemInfo[553]={
      --"Ｌ习得武功：归藏八剑",
      
      "Ｎ",
      "Ｄ秘技特效：无",    
      "Ｎ",
      "Ｚ特别说明：",
      }

   ItemInfo[554]={
      --"Ｌ习得武功：浣花剑法",
         
      "Ｎ",
      "Ｄ秘技特效：无",    
      "Ｎ",
      "Ｚ特别说明：",
      }  

   ItemInfo[555]={
      --"Ｌ习得武功：浮游功",
         
      "Ｎ",
      "Ｄ运功效果：",
      "Ｗ◇每3时序回复内伤1点",
      "Ｗ◇每时序回复生命3点，内力6点",
      "Ｗ◇每时序额外回复2点封穴",
      "Ｗ◇集气位置处与负值时，受到的伤害为0",
      "Ｄ被动效果：",
      "Ｗ◇集气不受内伤影响",
      "Ｄ秘技特效：无",    
      "Ｎ",
      "Ｚ特别说明：",
      }  

   ItemInfo[556]={
   --"Ｌ习得武功：扶摇九天",
         
      "Ｎ",
      "Ｄ秘技特效：无",    
      "Ｎ",
      "Ｚ特别说明：",
      }        

   --血海魔功
   ItemInfo[557]={
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇每3时序回复1点内伤",
   "Ｗ◇攻击时，吸取50%伤害的生命值（上限300），超过300点的吸血量转为护盾。",
   "Ｗ◇免疫流血。",
   "Ｗ◇每时序回复冰封值1点。",

   "Ｄ血刀门特效：",
   "Ｗ◇血战八方：主运血海魔功，使用血刀门武功击杀敌人后增加一次【血战】。",
   "Ｗ◇每点【血战】增加百分之十伤害。",
   "Ｗ◇每点血战可触发一次【血战八方】。",
   "Ｗ◇【血战八方】大范围伤害，追加杀气800点、给敌方增加【卸甲状态】三回合。",
   }

   ItemInfo[558]={
      --"Ｌ习得武功：飞花迷踪",
            
         "Ｎ",
         "Ｄ秘技特效：无",    
         "Ｎ",
         "Ｚ特别说明：",
         }   

   ItemInfo[559]={
      --"Ｌ习得武功：圣火令法",
            
         "Ｎ",
         "Ｄ秘技特效：无",    
         "Ｎ",
         "Ｚ特别说明：",
         } 

   ItemInfo[560]={
      --"Ｌ习得武功：雁行功",
            
         "Ｎ",
         "Ｄ秘技特效：无",    
         "Ｎ",
         "Ｚ特别说明：",
         }  

   ItemInfo[561]={
      --"Ｌ习得武功：武当剑法",
            
         "Ｎ",
         "Ｄ秘技特效：无",    
         "Ｎ",
         "Ｚ特别说明：",
         }               