
  Pmiji_info = {}

  Pmiji_info[0] = {
      "",
  }
  --中庸之道1
  Pmiji_info[1] = {
      "Ｗ◇达成条件：修炼中庸之道",
      "Ｗ◇需资质低于80且资质大于30",
      "Ｄ中庸之道壹 天命之谓性",
      "Ｗ◇每（资质-1）时序行动一次",
      "Ｎ",
  }

  --中庸之道2
  Pmiji_info[2] = { 
      "Ｗ◇达成条件：修炼中庸之道",
      "Ｗ◇需资质低于80且资质大于30",
      "Ｄ中庸之道贰 率性之谓道",
      "Ｎ", 
      "Ｗ◇受到攻击后如果满怒，（资质-29）%几率结束对手攻击并反击",
      "Ｎ",
  }

  --斗转星移
  Pmiji_info[3] = {
      "Ｗ◇达成条件：修炼斗转星移",
      "Ｗ◇需资质大于79",
      "Ｗ◇北斗移辰：总兵器值<240，被攻击时50%几率触发",
      "Ｗ◇北斗移辰：以60%的威力斗转反击，并追加300点气攻",
      "Ｗ◇斗转星移：240≤总兵器值<360，被攻击时50%几率触发",
      "Ｗ◇斗转星移：以85%的威力斗转反击，并追加600点气攻",
      "Ｗ◇离合参商：360≤总兵器值<520，被攻击时50%几率触发",
      "Ｗ◇离合参商：以110%的威力斗转反击，并追加1200点气攻",
      "Ｗ◇幻梦星辰：总兵器值≥520，发动离合参商反击时有几率变为幻梦星辰反击",
      "Ｗ◇幻梦星辰：几率为：（五系兵器值之和-520）%",
      "Ｗ◇幻梦星辰：反击伤害和气攻提高到115%，且反击范围为全屏锁定攻击",
      "Ｎ",
  }

  --左右互搏
  Pmiji_info[4] = {
      "Ｗ◇达成条件：修炼左右互搏",
      "Ｗ◇（71-资质）%概率进行两次攻击",
      "Ｚ特别说明：",                                       
      "Ｗ◇需资质低于31",
      "Ｎ",
  }

  --桃花绝技
  Pmiji_info[5] = {
      "Ｗ◇达成条件：学会弹指神通/落英神剑掌/玉箫剑法",
      "Ｗ◇弹指神通/落英神剑掌/玉箫剑法威力+200",
      "Ｗ◇40%几率三连击，暴怒必出",
      "Ｗ◇弹指神通必暴击，气攻+1500",
      "Ｗ◇落英神剑掌攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
      "Ｗ◇玉箫剑法攻击距离提升至8格，有60%几率冰封",
      "Ｎ",
  }
  --紫气天罗
  Pmiji_info[6] = {
      "Ｗ◇达成条件：学会灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌",
      "Ｗ◇紫气天罗：攻击随机附加1~3层“冰冻状态”，每层减缓1%集气速度，上限50层",
      "Ｗ◇紫气天罗：被攻击时冻结敌人5时序",
      "Ｗ◇紫气天罗：灵蛇拳/寒冰绵掌/化骨绵掌/玄冥神掌威力提升300点",
      "Ｎ",
  }
  --万象天引
  Pmiji_info[7] = {
    "Ｗ◇达成条件：学会吸星大法/北冥神功/乾坤大挪移",
    "Ｗ◇万象天引：启动后，反弹50%所受伤害和一切状态。",
    "Ｗ◇神罗天征：每三回合触发一次，将自身3~10格范围的目标拉到身前三格内的一个点重叠，并进行一回合锁足。",
    "Ｎ",
  }
  --毒布武林
  Pmiji_info[8] = {
      "Ｗ◇达成条件：学会五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌",
      "Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
      "Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
      "Ｎ",
  }
  --慈悲为怀
  Pmiji_info[9] = {
    "Ｗ◇达成条件：学会慈悲刀法和大慈大悲手",
    "Ｗ◇慈悲为怀：道德高于60时，如果伤害大于100减伤（道德-60）点",
    "Ｎ",
  }
  --铁甲依然在
  Pmiji_info[10] = {
    "Ｗ◇达成条件：学会铁掌/铁剑/铁布衫并主运铁布衫",
    "Ｗ◇铁甲依然在：护甲提升20%，被攻击时20%几率抵挡生命最大值2%伤害",
    "Ｎ",
  }
  --五虎闹东京
  Pmiji_info[11] = {
    "Ｗ◇达成条件：学会五虎断门刀和五虎棍法",
    "Ｗ◇赞天虎身轻如燕：一虎在场，攻击时30%几率提升全队100集气",
    "Ｗ◇彻地虎是条好汉：二虎在场，被攻击时30%几率提高1000点气防",
    "Ｗ◇穿山虎铁臂神拳：三虎在场，攻击时30%几率增加100点伤害",
    "Ｗ◇翻江虎身手不凡：四虎在场，集气条30%几率跳跃10点集气速度",
    "Ｗ◇锦毛虎一身是胆：五虎在场，被攻击时30%几率反弹10%伤害",
    "Ｎ",
  }
  --十三太保
  Pmiji_info[12] = {
  }
  --血战沙场
  Pmiji_info[13] = {
    "Ｗ◇达成条件：学会岳家枪法/岳王散手/武穆遗书",
    "Ｗ◇血战沙场：使用岳家枪法/岳王散手对周身7X7范围内的敌人造成10~20点伤害1次",
    "Ｗ◇根据击杀数和怒气值(每50点怒气增加1次，暴怒额外增加2次)增加伤害次数",
    "Ｚ特别说明：", 
    "Ｗ威力等于750+实战数值",
    "Ｎ",
  }
  --素质三连
  Pmiji_info[14] = {
    "Ｗ◇达成条件：学会三分剑术/连城剑法",
    "Ｗ◇素质三连：攻击时50%概率(满怒100%触发)三连击",
    "Ｎ",
  }
  --金刚般若
  Pmiji_info[15] = {
    "Ｗ◇达成条件：学会大力金刚掌/般若掌/龙象般若功",
    "Ｗ◇金刚般若：破防目标30%",
    "Ｗ◇金刚般若：大力金刚掌必暴击,般若掌攻击范围变成点，威力提高。",
    "Ｗ◇金刚般若：主运龙象般若功，概率触发【十龙十象】击晕目标。",
    "Ｎ",
  }
  --洞虚玄门
  Pmiji_info[16] = {
  "Ｗ◇达成条件：学会神门十三剑/玄虚刀法",
  "Ｗ◇洞虛玄門：玄虚刀法必封穴，神门十三剑必冰封灼烧",
  "Ｗ◇洞虛玄門：受到攻击30%几率使用双倍内力抵消一半伤害",
}
  --寸长寸强
  Pmiji_info[17] = {
    "Ｗ◇寸长寸强：学会呼延枪法和呼延鞭法",
    "Ｗ◇寸长寸强：使用任意奇门武功攻击不随距离递减，距离每远一格伤害增加1%",
    "Ｚ特别说明：无",
    "Ｎ",
  }
  --剑胆琴心
  Pmiji_info[18] = {
    "Ｗ◇达成条件：学会独孤九剑/持瑶琴",
    "Ｗ◇剑胆琴心：以自身为中心的九格内的目标命中率降低，越近命中越低。",
    "Ｗ◇剑胆琴心：攻击自身九格内的目标增加命中率，越近命中增加越多。",
    "Ｗ◇剑胆琴心：使用持瑶琴攻击时，自身恢复5%当前血量并减少10点内伤",
    "Ｎ",
  }
  --举火燎原
  Pmiji_info[19] = {
  "Ｗ◇达成条件：学会金乌/燃木/火焰刀",
  "Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
  "Ｗ ◇举火燎原：*引燃状态下，每时序损失2%当前血量",
  "Ｎ",
  }
  --世尊降魔
  Pmiji_info[20] = {
  "Ｗ◇达成条件：学会伏魔杖法/金刚伏魔圈/无上大力杵/罗汉伏魔功”",
  "Ｗ◇世尊降魔：暴击率增加50%",
  "Ｗ◇世尊降魔：如果造成的伤害<300,则伤害等于300，暴怒追加一定气攻伤害",
  "Ｗ◇世尊降魔：如果造成的伤害>300则追加少量气攻值伤害暴怒则追加大量气攻值伤害",
  "Ｚ特别说明：无",
  "Ｎ",                                      
  }
  --金乌映雪
  Pmiji_info[21] = {
    "Ｗ◇达成条件：学会金乌刀法/雪山剑法”",
    "Ｗ◇金乌映雪：触发冰封必灼烧，触发灼烧必冰封。",
    "Ｚ特别说明：无",
    "Ｎ",  
  }
  --铁索横江
  Pmiji_info[22] = {
    "Ｗ◇自身范围内一格15%概率不受到伤害。",
  }
  --双剑合壁
  Pmiji_info[23] = {
  "Ｗ◇达成条件：同时学会武功全真剑法、玉女素心剑法",
  "Ｗ◇双剑合壁：连击率+30%",
  "Ｗ◇双剑合壁：使用全真剑法/玉女素心剑法攻击时触发<双剑合壁.攻>，必击中对方破绽",
  "Ｗ◇双剑合壁：被攻击时触发<双剑合壁.守>，免疫破绽，免疫被杀气到-100以下",
  "Ｗ◇双剑合壁：使用玉女素心剑法/全真剑法攻击范围+1",
  "Ｎ",
  }
  --利刃寒锋
  Pmiji_info[24] = {
  "Ｗ◇达成条件：学会修罗/阴风/沧溟刀",
  "Ｗ◇利刃寒锋：攻击时，有50%几率追加10时序的冻结状态，暴怒必触发",
  "Ｗ ◇利刃寒锋：*冻结状态下，无法集气，亦无法时序回复状态",
  "Ｎ",
  }
  --逍遥御风
  Pmiji_info[25] = {
  "Ｗ◇达成条件：学会小无相功/北冥神功/八荒六合功",
  "Ｗ◇逍遥御风： *攻击与被攻击均有机会触发特效“逍遥御风”，累积点数",
  "Ｗ◇逍遥御风：*当累积点数达到9点时，清空封穴",
  "Ｗ ◇逍遥御风： *此状态不会被杀气或封穴，直到人物下次行动时累积归零",
  "Ｗ◇逍遥御风：*单次攻击累积“逍遥御风”上限为3次",
  "Ｎ",
  }
  --罗汉金身
  Pmiji_info[26] = {
  "Ｗ◇达成条件：学会罗汉伏魔功、金刚不坏体",
  "Ｗ◇罗汉金身：运功会罗汉伏魔功、金刚不坏体或易筋经",
  "Ｗ◇罗汉金身受到第一次的伤害概率减伤50%",
  "Ｎ",
  }
  --以柔克刚
  Pmiji_info[27] = {
  "Ｗ◇达成条件：学会柔云剑法和太极剑法",
  "Ｗ◇以柔克刚：被攻击时有50%的几率触发，将所受杀气值的一半转化为回血",
  "Ｎ",
  }
  --群疗
  Pmiji_info[28] = {
    "Ｗ◇群疗：对四格范围内的已方目标进行一次治疗。",
    "Ｎ",
  }
  --子午针灸
  Pmiji_info[29] = {
    "Ｗ◇针炙：对已方目标使用刺激目标，使目标拥有一回合的六层【激昂】状态。",
    "Ｎ",
  }
  --千金术
  Pmiji_info[30] = {
    "Ｗ◇千金术：清除范围内乙方的基础异常状态，并回复少量气血。",
    "Ｎ",
  }
  --药王神篇
  Pmiji_info[31] = {
    "Ｗ◇药王神篇：治疗已方单体目标，回复大量气血。",
    "Ｎ",
  }
  --黄帝内经
  Pmiji_info[32] = {
    "Ｗ◇药王神篇：治疗已方单体目标，并持续回复气血。",
    "Ｎ",
  }
  ----毒经
  Pmiji_info[33] = {
    "Ｗ◇施毒：对范围内的敌方目标施毒。",
    "Ｎ",
  }
  ----盅术
  Pmiji_info[34] = {
    "Ｗ◇施毒：对目标施加盅术，概率命中，命中后盅虫会在一回合后发作，造成目标大量伤害。",
    "Ｎ",
  }
  ----华陀医术
  Pmiji_info[35] = {
    "Ｗ◇华陀医术：使用药品和医疗时，效果额外增加20%。",
    "Ｎ",
  }

  ----天衣无缝
  Pmiji_info[36] = {
    "Ｗ◇使用任意刀系武功增加30%连击率",
    "Ｎ",
  }

  ----除却四相
  Pmiji_info[37] = {
    "Ｗ◇被攻击50%几率触发：免疫本次攻击造成的内伤/封穴/冰封/灼烧",
    "Ｗ◇被攻击50%几率生命+100,50%几率被打加100集气",
    "Ｗ◇被攻击50%几率被打加100集气",
    "Ｎ",
  }

  ----九阴九阳
  Pmiji_info[72] = {
    "Ｗ◇免疫攻击造成的/冰封/灼烧",
    "Ｗ◇被暴击时，免疫暴击伤害并减伤30%",
    "Ｗ◇被连击时，受到连击伤害减伤30%",
    "Ｎ",
  }
