
	--天赋介绍
    TFJS = {}
 	--聂风
	 TFJS[546] = {"Ｌ风中之神",
	 "Ｗ轻功成长加倍，装备附加的轻功和集气加成双倍。",	
     }   
     
	--梅长苏
	TFJS[507] = {"Ｌ琅琊公子",
	"Ｗ战斗中系数必然不低于对方",
	"Ｗ战斗中可以自由切换林殊/梅长苏两个身份",	
	"Ｎ",
	"Ｌ冠绝江左",
	"Ｗ敌方每5点冰封值减少攻击伤害1%",
	"Ｗ自带特技“麒麟不动”：每本天书可以幻化敌方的一门武功",
	"Ｗ进战100点封值，100点灼烧值，每次行动后自身增加10点冰封值，5点灼烧值",
	"Ｗ当冰封值与灼烧值为0时“火寒毒发作，”发动“偷天换日”：",
	"Ｗ恢复生命/内力到最大值，冰封值增加100，灼烧值增加50，",
	"Ｗ其它状态清零。每100时序发动一次",
    }	
    
	--林殊
	TFJS[508] = {
	"Ｌ亘天赤焰",
	"Ｗ攻击必发动赤焰给敌方造成灼烧，小概率直接点燃，每点灼烧值减少敌方防御1%",
	"Ｗ免疫流血，敌方人数越多，自身三围，五系越高",
    }	
	
	--电饭锅
	TFJS[515] = {"Ｌ锅王之王",
	"Ｌ不粘锅",
	"Ｗ被攻击时25%几率免疫攻击",
	"Ｎ",
	"Ｌ甩锅",
	"Ｗ被攻击时25%几率由其他目标承受伤害",
	"Ｎ",
	"Ｌ背锅",
	"Ｗ攻击时25%几率由电饭锅替目标承受伤害",
	"Ｎ",
	"Ｒ膳魔师",
	"Ｗ烹饪料理可获得双倍食物。",
    "Ｎ",
    }

	--葵花尊者
	TFJS[608] = {"Ｌ葵花尊者",
	"Ｗ攻击防御1.5倍",
	"Ｗ攻击必发动葵花刺目",
	"Ｗ受到普通暗器攻击必定反击",
	"Ｗ葵花移形/真葵花移形/葵花概率提升",	
    "Ｗ可以装备绣花针",	
    "Ｎ",
	"Ｌ定心圆气",
	"Ｗ时序回复气血/内力/体力，并额外回复冰封/灼烧/流血1点/时序",
    }	
    
	--酒神
	TFJS[721] = {"Ｌ酒神",
	"Ｗ初始暗器200，暗器必定1倍伤害",
	"Ｗ拥有华丽的头像",	
	"Ｗ喝酒buff有特殊攻击特效",	
	"Ｗ休息时必定蓄力防御",		
	"Ｎ",
	"Ｇ福缘奇遇",
	"Ｗ得到辟邪剑谱，第一格洗辟邪剑法一级，并洗天外x笑傲正邪打败东方不败 第二格洗葵花宝典一级，并洗天内x可装备绣花针（必须接受惩罚）",	
    }	
    
	--杨康
	--TFJS[650] = {"Ｌ小王爷",
	--"Ｗ每个武功到极减少3%所受伤害与杀气。最多减少21%",
	--"Ｌ无妄无我",
	--"Ｗ受到伤害为75%~125%。",
	--"Ｗ攻击伤害为75%~125%。",	
    --}	
    	
	--觉远
	--TFJS[573] = {"Ｌ仁阳佛光",
	--"Ｗ内力上限9999",
	--"Ｗ可使用九阳神功攻击",	
    --"Ｎ",
	--"Ｌ天域幻音",
	--"Ｗ本方行动后清除流血、中毒、冰封、灼烧、内伤，并回复生命值",
   -- }	
    
	--白猿
	TFJS[575] = {"Ｌ仙剑神猿",
	"Ｗ使用剑系武功攻击时，敌方御剑系数减半",
	"Ｗ可装备白猿,猿公剑法威力+500",	
    "Ｎ",
	"Ｌ闪电惊虹",
	"Ｗ初始集气值1000，每次攻击后自身集气+200，连击率+50%",
	"Ｗ每学会一种剑法,伤害提升5%",	
    }	
    	
	--玄澄
	TFJS[576] = {"Ｌ菩提金身",
	"Ｗ受到的伤害减少30%",
    "Ｎ",
	"Ｌ无量禅震",
	"Ｗ使用伏魔杖法必定暴击",
	"Ｗ攻击如被闪避则追加一次攻击",	
	"Ｗ伏魔伏法必暴击，追加内伤，并追加内伤值伤害",		
    "Ｎ",
	"Ｌ佛门无双",
	"Ｗ所有少林武功无条件学习",	
    }	
    	
	--摩尼
	--TFJS[641] = {"Ｌ圣火明尊",
	--"Ｗ攻击必灼烧，灼烧大于25点必点燃",
	--"Ｗ点燃后会造成小范围伤害",
   -- "Ｎ",
	--"Ｌ魔道天行",
	--"Ｗ我方全体攻击伤害×120％，敌方全体攻击伤害×90％",
   -- "Ｎ",
	--"Ｌ逆转乾坤",
	--"Ｗ乾坤大挪移可同时反弹给两个人（学会乾坤大挪移后）反弹伤害50%",			
	--"Ｗ免疫暗器",	
	--}	
	
	--岳云
	TFJS[568] = {"Ｌ精忠报国",
	"Ｗ生命低于50%减伤50%，生命低于25%减伤75%",
	"Ｗ岳家枪法攻击必命中，必连击",	
	"Ｗ岳王散手攻击必暴击，必封穴",		
    "Ｎ",
	--"Ｌ决胜千里",
	--"Ｗ 每回合50％几率触发，敌方集气-150，本方集气+150",
	}
    
	--上官剑南
	TFJS[567] = {"Ｌ千秋侠烈",
	"Ｗ生命值低于50%，伤害1.5倍，低于25%伤害2倍。",
	"Ｗ被攻击伤害90%",	
    "Ｎ",
	--"Ｌ傲世神罡",
	--"Ｗ攻击必暴击",
	--"Ｗ拳掌武功必破防30%",
    }
    		
	--袁士宵
	TFJS[658] = {"Ｌ天池怪侠",
	"Ｗ被攻击时概率转移杀气值给攻击者",
	"Ｗ攻击系数只算拳法",	
	"Ｗ百花错拳威力+600",	
    "Ｎ"
	    }	
	
	--陈正德
	TFJS[311] = {"Ｌ天山双鹰",
	"Ｗ三分剑法必定三连，伤害变为三分之一",
	"Ｌ秃鹰",
	"Ｗ鹰爪功追加内伤，并追加内伤值伤害"
    }	
    
	--天镜
	TFJS[313] = {--"Ｌ天佛降世",
	--"Ｗ学会金刚不坏神功必定触发“金刚不坏”特效",
	--"Ｗ战斗中可以复活一次，复活后免疫内伤，免疫暴击伤害，",	
	--"Ｎ",
	--"Ｌ诸行无常",
	--"Ｗ可使用内功攻击，武功范围+1。",
    }	
    
	--天虹
	TFJS[657] = {"Ｌ悲天佛怜",
	"Ｗ生命值低于50%，拥有绝对气防",
	"Ｗ般若掌攻击范围变为点，威力增加50%。",	
	}		
	
	--段思平
	TFJS[499] = {"Ｌ六脉玄机",
	"Ｗ使用六脉神剑触发四种特效几率随实战的增加每100实战增加5％.）",
	"Ｗ剑逆天光：无视敌方气防 且必破防50%（初始出招几率10％）。",	
	"Ｗ剑煌镜影：增加一次连击 附带灼烧效果（初始出招几率8％）。",
	"Ｗ南柯万剑：必暴击,且暴击攻击加成提升至200％（初始出招几率6％）。",
	"Ｗ皇玺剑印：对目标造成随机造成眩晕/虚弱/定身。（初始出招几率6％）",
	"Ｎ",
	"Ｌ剑绝天南",
	"Ｗ使用六脉神剑必触发【剑气碧烟横】，内力上限9999。",
	"Ｎ",
	"Ｇ福缘奇遇",
	"Ｗ去天龙寺书架有六脉神剑特殊剧情。战胜第一格洗六脉神剑",		
    }	
    
	--夏雪宜
	TFJS[639] = {"Ｌ金蛇郎君",
	"Ｗ金蛇剑法威力1.5倍。",
	"Ｗ金蛇锥3~5倍伤害。",	
	"Ｗ暴怒使用金蛇剑法必出金蛇奥义。",
	"Ｎ",
	"Ｌ意假情真",
	"Ｗ暴怒后攻击怒气值概率只减少10~40。",	
	}		
	
	--袁冠南
	TFJS[566] = {
	"Ｌ白衣书生",
	"Ｗ萧中慧在场，攻防提各提升100。",
	"Ｗ夫妻刀法威力增加300。",	
	"Ｎ",	
	"Ｇ福缘奇遇",
	"Ｗ获得《夫妻刀法》第二格洗夫妻刀法。",
	}				
			
	--李沅芷
	TFJS[569] = {"Ｌ小魔女",
	"Ｗ敌方气攻伤害减少20%",
	"Ｗ敌方命中减10%",	
	"Ｎ",
	"Ｌ芙蓉金针",
	"Ｗ攻击附带暗器系数的真实伤害",	
	"Ｎ",
	"Ｇ福缘奇遇",
	"Ｗ获得柔云剑法/无极玄功拳，第一/二格洗对应武功",
	"Ｗ获得纯阳无极功第三格洗梯云纵，天轻洗梯云纵",	
	}			
	--萧玲
	TFJS[574] = {"Ｌ寒露清梦",
	"Ｗ攻击与被攻击无视敌方武常",
	"Ｗ攻击概率无视敌方防御30%",	
	"Ｎ",
	"Ｌ天仙锁魂",
	"Ｗ敌方每回合30%几率附加虚弱状态2回合。",
	"Ｗ增加x(敌方人数)伤害，最多增加60%。",	
	"Ｎ",
	"Ｒ特色指令：云梦",
	"Ｗ效果：可自由切换第一格武功为寒袖拂穴/白虹掌力",
	"Ｎ",	
	"Ｇ福缘奇遇",
	"Ｗ灵鹫宫获得八荒六合功第三格洗小无相功。天内洗小无相功",
	"Ｗ灵鹫宫获得八荒六合功第四格洗八荒六合功。可以选择天内是否洗八荒六合功",	
	}
	--达摩
	TFJS[577] = {"Ｌ一苇渡江",
    "Ｗ一苇渡江轻功自动运功",	
    "Ｗ拥有绝对气防",	
	"Ｎ",
	"Ｇ万佛朝宗",
	"Ｗ攻击时概率触发万佛朝宗附加目标当前生命值10%的伤害，并减少内力20%。",
	"Ｎ",
    }

	TFJS[589] = {"Ｌ似水柔情",
	"Ｗ误伤队友时恢复其血量",
	"Ｎ",
	"Ｌ铃剑侠女",
	"Ｗ使用连城剑法高连击"
    }
    
	TFJS[594] = {"Ｌ铁索横江",
	"Ｗ【闭气离墙.起死回生】，战斗中可以复活一次",
	"Ｗ自带“铁索横江”：自身范围内一格25%概率免受攻击。",
	"Ｗ基础连击率大幅度提高"
    }

	--周维信
	TFJS[612] = {"Ｌ铁鞭震八方",
	"Ｗ呼延十八鞭2~5倍威力。",		
	}		
	--卓天雄
	TFJS[613] = {"Ｌ铁掌神鞭",
	"Ｗ震天铁掌威力翻倍，呼延十八鞭威力三倍。",	
	"Ｗ使用震天铁掌10%概率直接震晕目标",
	"Ｗ使用呼延十八鞭大概率造成封穴",		
	}		
	--林玉龙
	TFJS[614] = {
	--"Ｌ荒野游龙",
	--"Ｗ每行动一次，减伤增加5%，增伤5%，最高减伤增加40%。",
	--"Ｎ",
	"Ｌ欢喜冤家",
	"Ｗ任飞燕在场，攻防提各提升100。",	
    }	
    	
	--任飞燕
	TFJS[615] = {"Ｌ玉堂飞燕",
	"Ｗ攻击附带轻功值2倍的杀气值",	
	"Ｗ被攻击附带轻功值2倍的气防值",
	"Ｗ使用夫妻刀法攻击附加（轻功值/2）的固定伤害。",
	"Ｎ",
	"Ｌ欢喜冤家",	
	"Ｗ与林玉龙同时在场，攻防轻增加50",	
    }


	TFJS[539] = {"Ｌ奋英雄怒",
	"Ｗ攻击时必定造成暴击并有红字特效",
	"Ｗ集气速度+8",
	"Ｎ",
	"Ｌ狂龙天征",
	"Ｗ自带“擒龙功”加力、护体，1000威力，可叠加（几率与天书数、实战相关）",
	"Ｗ使用降龙十八掌，必定发动【降龙.极意】",
	"Ｗ使用降龙十八掌，40%几率发动【降龙.三叠浪】，暴怒时必定发动",
	"Ｗ使用降龙十八掌攻击无误伤",
	"Ｗ降龙十八掌耗内降低50%（与天赋外功效果叠加，降低75%内力消耗）",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ天龙八部正线挑战扫地老僧胜利后，可获得专属武器"
    }

	TFJS[679] = {"Ｌ离合参商",
	"Ｗ斗转反击时，无视兵器值需求必定发动离合参商",
	"Ｗ斗转星移发动几率100%",
	"Ｎ",
	"Ｌ姑苏慕容",
	"Ｗ可使用斗转星移进行攻击",
	"Ｎ",
	"Ｒ特色指令：幻梦",
	"Ｗ至该角色下次行动为止，被攻击必定发动幻梦星辰反击",
	"Ｇ福缘际遇",
	"Ｗ天龙八部邪线挑战扫地老僧胜利后第二格以及天赋内功洗易筋经，领悟黑级浮屠"
    }

	TFJS[532] = {"Ｌ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	}
	TFJS[533] = {"Ｌ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	}
	TFJS[534] = {"Ｌ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	}
	TFJS[535] = {"Ｌ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	}
	TFJS[536] = {"Ｌ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	}
	TFJS[537] = {"Ｌ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	}
	TFJS[538] = {"Ｌ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	}

	TFJS[130] = {"Ｌ飞天蝙蝠",
	"Ｗ自动主运飞天神行",
	"Ｌ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400"
	}
	TFJS[131] = {"Ｌ妙手书生",
	"Ｌ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400"
	}
	TFJS[132] = {"Ｌ马王神",
	"Ｌ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400"
	}
	TFJS[133] = {"Ｌ南山樵子",
	"Ｌ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400"
	}
	TFJS[134] = {"Ｌ笑弥陀",
	"Ｌ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400"
	}
	TFJS[135] = {"Ｌ闹市侠隐",
	"Ｌ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400"
	}
	TFJS[136] = {"Ｌ越女剑",
	"Ｌ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400"
	}
	TFJS[590] = {"Ｌ心秀天铃",
	"Ｗ使用奇门武功，有（天书数x2+实战/25）%的几率发动“心秀天铃·星月争辉”，追加800点气攻，如已有14本天书，则触发此特效必破气防",
	"Ｎ",
	"Ｌ古道西风",
	"Ｗ装备白马时的集气加成效果翻倍",
	"Ｚ畅想主角专属",
	"Ｗ每修炼一个奇门武功到极，集气速度+2（上限7个）"
	}

	TFJS[150] = {
	--"Ｌ一剑无血",
	--"Ｗ攻击不会造成流血"
    }
    
	--文泰来
	TFJS[151] = {"Ｌ奔雷手",
	"Ｗ暴怒攻击概率触发雷动九天，为目标添加一层雷音BUFF，对大于等三层雷音BUFF的目标击晕一回合",
	"Ｎ",
	"Ｌ否极泰来",
	"Ｗ每过100时序激活一次【否极泰来】，免疫死亡伤害10时序",
	--"Ｗ生命越低防御跟伤害越高，怒气回复越快",	
    }	

	TFJS[149] = {"Ｌ少林掌门",
	"Ｗ无视限制条件修炼金刚不坏体",
	"Ｎ",
	"Ｌ特技：千手如来掌",
	"Ｗ使用拳法攻击时，攻击范围增加一格",
	"Ｎ",
	"Ｌ特技：易筋经大成",
	"Ｗ自动运行易筋经，免疫敌方三大吸功的吸内效果",
	}

	TFJS[152] = {"Ｌ追魂夺命剑",
	"Ｗ生命值低于50%时连击率两倍，生命值低于25%时连击率三倍",
	"Ｌ连环迷踪腿",
	"Ｗ行动后50%几率使用“连环迷踪腿”攻击周身三格敌人，造成100点伤害",
	"Ｌ自断一臂",
	"Ｗ无法学会左右互博"
	}
	TFJS[153] = {"Ｌ千臂如来",
	"Ｗ初始暗器值200点",
	"Ｎ",
	"Ｌ暗器之王",
	"Ｗ战斗胜利后随机获得暗器"
	}
	TFJS[154] = {"Ｌ鸳鸯刀",
	"Ｗ战场上我方男性角色越多其攻击效果越高"
	}
	TFJS[155] = {"Ｌ黑无常",
	"Ｗ攻击时伤害随机增加2%~50%"
	}
	TFJS[156] = {"Ｌ白无常",
	"Ｗ被攻击时受到伤害随机减少1%~25%"
	}
	TFJS[157] = {"Ｌ湘西尸王",
	"Ｗ华山观武后鹤蛇八打威力翻倍"
	}
	TFJS[158] = {"Ｌ波斯大贾",
	"Ｗ作为畅想主角时开局获得一万银两"
	}
	TFJS[159] = {"Ｌ释迦掷象功",
	"Ｗ必定单击，伤害永久提高1.5倍（天赋外功与如雷的额外连击有效）"
	}
	TFJS[160] = {"Ｌ尊师重道",
	"Ｎ",
	"Ｒ特色指令：死战",
	"Ｗ锁定一名敌人，至其死亡之前，达尔巴对其的攻击效果提高50%，且必定命中",
	"Ｗ在目标死亡之前无法更换目标"
	}
	TFJS[161] = {"Ｌ赤练仙子",
	"Ｗ五毒神掌变为赤练神掌，追加70点伤害，并强制上毒20点，引爆目标身上毒素",
	"Ｗ对男性增伤10%",	
	"Ｌ情为何物",
	"Ｗ每隔50时序，随机向敌人发射三枚冰魄银针",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ神雕邪线古墓密道剧情，洗第二、三格武功，天赋内功洗为玉女心经"
	}

	TFJS[162] = {"Ｌ一日不过三",
	"Ｗ敌方全体集气-3",
	"Ｌ不三不四",
	"Ｗ丁不三丁不四同时在场，敌方全体集气-4",
	}
	TFJS[163] = {"Ｌ一日不过四",
	"Ｗ敌方全体集气-4",
	"Ｌ不三不四",
	"Ｗ丁不三丁不四同时在场，敌方全体集气-3",
	}
	TFJS[164] = {"Ｌ摩天居士",
	"Ｗ自带“摩天居士”护体（500威力，可叠加）几率与天书数、实战有关",
	"Ｌ亦正亦邪",
	"Ｗ道德高于59，攻击效果提高20%",
	"Ｗ道德低于61，防御效果提高20%",
	"Ｌ碧针清掌",
	"Ｗ行动后使用“碧针清掌”攻击周身七格敌人，造成100点伤害",	
	"Ｗ敌方全体集气-10"
	}

	}
	TFJS[165] = {"Ｌ子柳传人",
	"Ｗ "
	}
	TFJS[166] = {"Ｌ太上掌门",
	"Ｗ "
	}
	TFJS[167] = {"Ｌ崆峒五老",
	"Ｌ一震七伤",
	"Ｗ使用七伤拳必定内伤，追加277点伤害和杀气，扣除自身7%生命内力"
	}
	TFJS[169] = {"Ｌ四大神僧",
	"Ｗ使用大力金刚掌时自动进入蓄力状态"
	}
	TFJS[170] = {"Ｌ四大神僧",
	"Ｗ使用龙爪手时自动进入等待状态"
	}
	TFJS[168] = {"Ｌ崆峒五老",
	"Ｌ一震七伤",
	"Ｗ使用七伤拳必定内伤，追加277点伤害和杀气，扣除自身7%生命内力"
	}
	TFJS[171] = {"Ｌ武当儒侠",
	"Ｗ使用太极拳或太极剑攻击后自动进入防御状态",
	"Ｎ",
	"Ｚ鸡飞蛋打",
	"Ｗ暴怒时使用虎爪绝户手触发奥义，对男性造成毁灭性创伤"
	}
	TFJS[172] = {"Ｌ武当七侠",
	"Ｗ ",
	"Ｎ",
	"Ｌ天赋内功",
	"Ｗ修炼纯阳无极功与九阳神功一脉相承后，天赋内功变为九阳神功"
	}
	TFJS[173] = {"Ｌ波斯风使",
	"Ｗ集气时有40%几率集气值增加20"
	}
	TFJS[174] = {"Ｌ波斯云使",
	"Ｗ集气时有40%几率集气值增加20"
	}
    TFJS[175] = {"Ｌ波斯月使",
	"Ｗ集气时有40%几率集气值增加20"
	}


	TFJS[176] = {"Ｌ五毒教姑",
	"Ｗ被攻击使攻击者中毒20点，降低攻击者5点体力，200点内力"
	}
	TFJS[182] = {"Ｌ五丁手",
	"Ｗ "
	}
	TFJS[183] = {"Ｌ没影子",
	"Ｗ使用剑法攻击追加100点真实伤害，如装备武器，则此加成减半"
	}
	TFJS[184] = {"Ｌ护国真人",
	"Ｚ铁血大旗门",
	"Ｗ修炼铁剑铁掌到极，领悟嫁衣神功，人物等级变为一级"
	}
	TFJS[185] = {"Ｌ神剑仙猿",
	"Ｗ攻击时高几率造成封穴",
	"Ｗ等待时自动蓄力（无法触发龙象蓄力等效果）"
	}
	TFJS[186] = {"Ｌ神拳无敌",
	"Ｗ使用拳法攻击追加100点真实伤害，如未装备武器，则此加成翻倍"
	}
	TFJS[187] = {"Ｌ八面威风",
	"Ｗ "
	}
	TFJS[188] = {"Ｌ铜笔铁算盘",
	"Ｗ "
	}

	TFJS[592] = {"Ｌ料敌先机",
	"Ｗ进入战斗的初始集气位置为1000，自身移动步数锁定为10格，免疫暗器",
	"Ｎ",
	"Ｇ剑道神话",
	"Ｗ使用剑法攻击与被攻击必触发<剑魔再临>/<九剑真传>特效。",
	"Ｗ战斗中，个人武常计算结果必定不会低于敌方，集气速度锁定全场最高",	
	"被任何武功攻击计算伤害时都算剑系，使用任何武功攻击都算剑系，计算伤害时被攻击目标御剑能力减少70%。",	
	"Ｎ",
	"Ｇ剑魔【BOSS状态】",
	"Ｗ每次攻击自身剑势增加一层，最大十层，攻击人数随剑势而变化，每层剑势增加5%伤害和10%减伤（BOSS状态无减伤上限）",	
    "Ｗ被攻击时无法被连击，同一类型的武功无法重复造成伤害",	
    "Ｗ被攻击时需按照指破拳、剑破指、刀破剑、奇破刀、拳破奇的顺序攻击，破招后造成的伤害增加20%，剑势降低一层，反之增加一层剑势",
    "Ｗ剑势十层时，攻击后恢复2000内力，50中毒",
	}
	
	TFJS[510] = {"Ｌ曲夕烟隙",
	"Ｗ30%概率触发“曲夕烟隙”混乱目标，使目标随机移动",
	"Ｎ",
	"Ｌ曲径通幽",
	"Ｗ持瑶琴威力翻倍，攻击时30%概率触发“曲径通幽”必中",
	}
	
	TFJS[511] = {"Ｌ盗圣",
	"Ｗ攻击时随机窃取敌方一项可用状态，若为通用状态则可转给自身",
	"Ｗ拥有龟息功全部效果",
	"Ｎ",
	"Ｌ隔空点穴",
	"Ｗ造成封穴时，封穴增加10点，被攻击时对目标造成10点封穴",
	"Ｎ",
	"Ｌ踏雪无痕",
	"Ｗ移动距离增加2格",
	}

	--解风
	TFJS[458] = {"Ｌ入木三分",
	"Ｗ指系武功必破防30%"
	}
	--陆菲青
	TFJS[570] = {"Ｌ绵里针",
	"Ｗ被攻击时20%几率通过四两拨千斤化解，并用暗器反击敌人"
	}
	--卓不凡
	TFJS[565] = {"Ｌ十里坡剑神",
	"Ｗ每行动一次，攻击效果提升1%"
	}
	--宝象
	TFJS[595] = {"Ｌ一龙一象",
	"Ｗ提升10%伤害，降低10%承受伤害"
	}
	--渡厄
	TFJS[597] = {"Ｌ金刚伏魔",
	"Ｗ三渡每多一人在场，额外提升1000点气防",
	"Ｗ三渡每多一人在场，额外追加200点伤害",
	"Ｗ移动步数变为一格"
	}
	--渡劫
	TFJS[598] = {"Ｌ金刚伏魔",
	"Ｗ三渡每多一人在场，额外提升1000点气防",
	"Ｗ三渡每多一人在场，额外追加200点伤害",
	"Ｗ移动步数变为一格"
	}
	--渡难
	TFJS[599] = {"Ｌ金刚伏魔",
	"Ｗ三渡每多一人在场，额外提升1000点气防",
	"Ｗ三渡每多一人在场，额外追加200点伤害",
	"Ｗ移动步数变为一格"
	}
	--韦小宝
	TFJS[601] = {"Ｌ机敏无双",
	"Ｗ战斗开始前50时序，受到的伤害不超过50点",
	"Ｎ",
	"Ｒ特色指令：口才",
	"Ｗ使一名敌方进入沉睡状态，此状态无法集气，不会自行解除，受到攻击会醒来",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ鹿鼎记鳌府密室剧情，洗第一、二格武功"
	}
	--海大富
	TFJS[602] = {"Ｌ阴阳怪气",
	"Ｗ使用化骨绵掌削弱敌方体力内力"
	}
	--鳌拜
	TFJS[603] = {"Ｌ满洲勇士",
	"Ｗ满洲摔跤威力翻倍，使敌人无法移动一回合",
	"Ｌ十三太保横练",
	"Ｗ免疫破绽，免疫杀气，受到伤害降低13点",
	"Ｌ缩阳入腹",	
	"Ｗ主运金刚不坏体，必定发动\"金刚不坏\"特效"
	}
	--阿青
	TFJS[604] = {"Ｌ天元剑气",
	"Ｗ使用剑系武功攻击时，敌方御剑系数按零计算",
	"Ｎ",
	--"Ｌ听风辨位",
	--"Ｗ无视敌方的闪避效果（包括刺目，轻功，天赋等）",
	--"Ｎ",
	"Ｌ越女剑仙",
	"Ｗ使用越女剑法攻击无误伤",
	"Ｗ每次行动前解除自身所有异常",
	"Ｗ自带“九霄仙息”护体，增加自身御剑系数×5点气防",
	"Ｗ战场中增加自身御剑系数点攻防值",
	"Ｎ",	
	"Ｇ福缘际遇",
	"Ｗ侠客正战胜李白后第二格洗太玄神功",	
	"Ｗ侠客邪战胜石破天后第二格洗太玄神功",	
	}
	TFJS[605] = {"Ｌ惊才绝艳",
	"Ｗ武功威力提高10%，加力/护体/出招几率提高10%，总气攻提高10%",
	"Ｎ",
	"Ｌ姑射仙姿",
	"Ｗ被攻击时必发动\"轻云蔽月\"，免疫攻击10时序，冷却时间50时序",
	"Ｗ攻击时几率发动\"流风回雪\"，本次攻击必定造成冰封"
	}
	--阿凡提
	TFJS[606] = {"Ｌ踏沙无痕",
	"Ｗ移动格数+3，攻击后可以再次移动",
	"Ｎ",
	"Ｌ西域战神",
	"Ｗ拥有专属坐骑毛驴",
	"Ｗ休息时自带蓄力兼防御效果"
	}
	--焦宛儿
	TFJS[607] = {"Ｌ乱世浮萍",
	"Ｗ我方全体连击率提高10%"
	}
	--赵敏
	TFJS[609] = {"Ｌ机智多谋",
	"Ｗ在场时，我方全体获得如下光环：",
	"Ｗ处于蓄力状态时，增加自身20%减伤（蓄力必定成功）",
	"Ｗ处于防御状态时，有20%几率闪避",
	"Ｎ",
	"Ｌ绍敏郡主",
	"Ｗ被攻击时，反弹30%受到的攻击伤害",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ神雕邪线襄阳剧情，洗第二格武功，天赋内功洗为天魔功"
	}
	--公孙止
	TFJS[616] = {"Ｌ绝情谷主",
	"Ｗ本方每阵亡一名队友，集气速度增加2点",
	"Ｎ",
	"Ｌ特技：闭穴功",
	"Ｗ受到的封穴降低50%"
	}
	--裘千尺
	TFJS[617] = {"Ｌ铁掌莲花",
	"Ｗ作为畅想主角时可以获得年轻漂亮的头像贴图"
	}
	--郭襄
	TFJS[626] = {"Ｌ小东邪",
	"Ｌ魔音·碧海潮生曲",
	"Ｗ攻击时发动碧海潮生曲,第一击扣除全体敌人内力250",
	"Ｗ无需修炼三种武功即可触发桃花绝技",
	"Ｎ",
	"Ｒ特色指令：玲珑",
	"Ｗ可自由切换第一格武功为弹指神通/玉萧剑法/落英神剑掌，不消耗回合"
	}
	--郭襄
	TFJS["626-1"] = {"Ｌ小东邪",
	"Ｌ魔音·碧海潮生曲",
	"Ｗ攻击时发动碧海潮生曲,第一击扣除全体敌人内力250",
	"Ｗ无需修炼三种武功即可触发桃花绝技",
	"Ｎ",
	"Ｌ峨眉祖师",
	"Ｗ领悟“无上瑜伽密乘”，身娇腰柔易推倒，同时拥有阴、阳、调和三种内力属性的特性",
	"Ｎ",
	"Ｒ特色指令：玲珑",
	"Ｗ可自由切换第一格武功为弹指神通/玉萧剑法/落英神剑掌，不消耗回合"
	}
	--蒙哥
	TFJS[627] = {"Ｌ王霸之气",
	"Ｗ敌方全体集气减半"
	}
	--神雕
	TFJS[628] = {"Ｌ雕兄",
	"Ｗ使用玄铁剑法时，有几率发动重剑真传",
	"Ｎ",
	"Ｌ大鹏展翅",
	"Ｗ使用玄铁剑法时，攻击范围变为可移动",
	"Ｎ",
	"Ｌ鹏程万里",
	"Ｗ移动格数+3"
	}
	--阿九
	TFJS[629] = {"Ｌ长平公主",
	"Ｗ每次行动前有60%几率使敌方全体集气位置倒退150",
	"Ｗ暴怒时集气免疫封穴且不受基础异常状态影响",		
	"Ｎ",
	"Ｇ浴火凤凰(畅想单通专享)",
	"Ｗ华山击败玉真子觉醒领悟：",
	"Ｗ“凤鸣九霄”：满怒触发范围伤害。",
	"Ｗ“凤凰涅槃”：机率触发杀气减999，伤害减99，"	,
	"Ｗ“浴火重生”：机率复活一次",	
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ获得“神行百变”第三格洗神百变1级",
	}
	--周芷若
	TFJS[631] = {"Ｌ秀若芝兰",
	"Ｗ面板上每个外功增加1点集气，每个内功增加4%减伤，最大40%减伤",
	"Ｎ",
	"Ｌ谁与争锋",
	"Ｗ装备『倚天剑』时，全部剑法威力+200",
	"Ｗ使用九阴白骨爪，攻击时无视敌方毒抗",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ倚天邪线少林剧情，可选择洗第一格武功",
	"Ｗ倚天邪线少林剧情，洗第二格武功，天赋内功洗为九阴神功",
	}
	--逍遥子
	TFJS[634] = {"Ｌ长春不老",
	"Ｗ自带不老长春功",
	"Ｗ减伤30%伤害并用双倍内力抵消伤害值",
	"Ｗ击败无崖子直接激活“逍遥御风”(不需学小无相/八荒/北冥)",	
	"Ｎ",
	"Ｌ逍遥祖师",
	"Ｗ必发动“梅花三弄”特效之一",
	"Ｗ梅花一弄：造成散功30时序",
	"Ｗ梅花二弄：减少敌方当前内力值的5%",
	"Ｗ梅花三弄：忽视绝对气防",	  	
	}	
	--李白
	TFJS[636] = {"Ｌ青莲剑仙",
	"Ｗ自带青莲剑法高连",
	"Ｗ“谪仙观气”攻击与被攻击发动，兵器值不会低于对方",		
	"Ｎ",
     "Ｌ侠客行",
	"Ｗ“十步杀一人”：击退敌人发动可再次行动",
	"Ｗ“深藏身与名”：攻击后30时序内50%概率闪避攻击",
	"Ｎ",  		
     "Ｚ绝技：青莲剑歌",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ“青莲剑歌·长风当歌剑当扬”：满怒剑法攻击发动大范围伤害附加御剑值伤害并给目标添加“创伤”DEBUFF",
    "Ｗ““创伤”DEBUFF：不能回复任何任何状态",
	}
	--李寻欢
	TFJS[498] = {"Ｌ小李探花",
	"Ｗ敌人移动-1，自身移动+2",
	"Ｗ自带蜻蜓三抄水，30%躲避攻击",
	"Ｗ战斗胜利获得暗器",	
	"Ｗ7书领悟暗器为范围攻击",	
	"Ｎ",
	"Ｒ特色指令：飞刀",
	"Ｗ100时序暗器攻击”暴击3~5倍， ",
	"Ｗ华山觉醒后20%暴击5倍~10倍",
	"Ｗ攻击必命中",		
	"Ｗ每次开启消耗体力20，内力1000",
	"Ｎ",  
	"Ｄ惊才绝艳 ",
	"Ｗ自带100武常",	
	"Ｗ被攻击系数必然不低于对方",
	"Ｗ被攻击集气不会少于300",		
	}
		--冯蘅
	TFJS[588] = {"Ｌ岛主夫人",
	"Ｗ桃花岛武学威力+200",
	"Ｗ特效发动机率+10",		
	"Ｎ",
	"Ｌ过目不忘",
	"Ｗ修炼武功获得双倍三围属性",
	"Ｗ受到武功威力伤害-10%",
	"Ｎ",  
    "Ｇ福缘奇遇",
	"Ｗ桃花岛招亲后，第2格洗九阴神功1级，天内洗九阴神功",	
	"Ｗ射雕正线牛家村3格洗弹指神通，天外洗弹指神通",
	"Ｗ射雕邪线云岭山洞3格洗九阴白骨爪，天外洗九阴白骨爪",		

	}
	--于万亭
	TFJS[571] = {"Ｌ总舵主",
	"Ｗ我这把巨阙剑削铁如泥、绝对可以斩妖除魔"
	}
	--元悲
	TFJS[655] = {"Ｌ红粉骷髅",
	"Ｗ对女性攻击伤害×120%，被女性攻击伤害×80%"
	}
	--元伤
	TFJS[656] = {"Ｌ天怒红颜",
	"Ｗ对男性攻击伤害×120%，被男性攻击伤害×80%"
	}
		--斗酒僧
	TFJS[638] = {"Ｌ九阳至尊",
	"Ｗ内力上限9999，初始武学常识100",
	"Ｗ九阳神功必加力护体",
	"Ｗ九阳神功招式可以选择",
	"Ｗ反震40%伤害",
	"Ｎ",
	}	
		--萧半和
	TFJS[189] = {"Ｌ晋阳大侠",
	"Ｗ连击率与暴击率+50%。",
	"Ｗ攻击时必触发“混元一气”造成敌全体内伤。增加1000气功",
	"Ｎ",
	"Ｇ混元炁",
	"Ｗ混元功自动运功，混元功范围+1",
	"Ｎ",
	"Ｇ仁者无敌",
	"Ｗ拥有仁者二次判定，特效+10。 ",
	"Ｎ",  
	"Ｇ半和太监",
	"Ｗ修炼葵花宝典没有惩罚，可以使用葵花神功攻击 。",	
	"Ｗ笑邪击败葵花尊者天内洗葵花神功，",
	}
		--西门吹雪
	TFJS[500] = {"Ｇ绝技：剑道巅峰 五方行尽",
	"Ｇ绝技：剑道巅峰 五方行尽",		
	"Ｒ击败谢云流领悟“剑道巅峰 五方行尽”可触增加一次行动",
	"Ｒ攻击时发动“剑道化身.破苍穹”无视敌方御剑系数50%",
	"Ｒ被攻击发动“化三清”无视敌方御剑系数50%",	
	"Ｎ",  	
	"Ｇ福缘奇遇（专属剧情）",
	"Ｗ战胜谢云流第一格洗斩流剑术，第二格洗太虚剑意”",	
	"Ｗ天赋外功洗斩流剑术，天赋内功洗太虚剑意”",		
	}		
		--胡一刀
	TFJS[633] ={"Ｌ辽东大侠",
	"Ｗ天赋轻功自动主运",
	"Ｗ自身免疫冰封。",
	"Ｗ装备冷月宝刀后胡家刀法威力+300",		
	"Ｗ装备冷月刀攻击必冰封。",
	"Ｎ",
	"Ｇ刀剑归真",	
	"Ｗ飞雪邪线杀苗/飞雪正线胜苗第二格洗苗剑1级，领悟刀剑归真绝技：",
	"Ｒ不悔：伤害增加10%，时序增加怒气",	
	"Ｒ贯通：不修炼苗家剑法即可发动刀剑归真",
	"Ｒ刀剑归真：攻击触发动刀剑归真时触发刀剑绝技。",
	"Ｒ刀剑绝技：暴怒触发，必定连击首击出胡刀二击出苗剑绝技，大范围伤害杀气。",
	}	
	--萧秋水
	TFJS[652] = {"Ｌ神州大侠",
	"Ｗ修炼辟邪剑法与葵花宝典没有惩罚", 
	--"Ｗ气血越低防御越高，最低15%，最高35%",	
	"Ｎ",
	--"Ｄ忘情天书",
	--"Ｗ1书领悟：“天意”死亡时必触发“天意”复活一次",
	--"Ｗ2书领悟：“水逝”增加冰封，冰封过50点概率发动“月映”冰冻5时序", 
	--"Ｗ3书领悟：“火延”增加燃烧，燃烧过50点概率发动“日明”点燃目标",    
	--"Ｗ4书领悟：“土掩”减伤30点，机率发动“风流”完全闪避攻击",         
	--"Ｗ5书领悟：“云翳”必杀集气200，自身暴怒后概率“我无”反弹全部伤害", 
	"Ｎ", 	
     "Ｇ剑气飞纵（6书领悟）",
	"Ｇ连击不减伤害，攻击范围+1，",
	"Ｇ攻击时不随距离减伤害，目标距离越远，伤害越高",
	"Ｎ",       
    "Ｒ绝技：惊天一剑",
	"Ｗ战胜三名剑术名家",
    "Ｒ暴怒时可使用“天剑”绝技，使用剑法无视敌方御剑系数30%防御30%，无视闪避，追加200点伤害。",
	}

	--梁萧
	TFJS[635] = {"Ｌ西昆仑",
	"Ｗ自带“鲸息功”与“碧海惊涛掌”", 	
	"Ｗ主运鲸息功或使用碧海惊涛掌可以触发六大奇劲之一",	
	"Ｎ",
    "Ｌ星罗散手",
	"Ｗ用拳掌攻击时，必触发“星罗散手”给对方造成封穴",
	"Ｎ",
    "Ｒ绝技：谐之道",
    "Ｒ自身不会有破绽，暴怒时发动必中破绽，",
	"Ｒ击中敌方破绽高机率造成敌方5时序集气暂停",
	"Ｇ福缘机遇",
	"Ｒ灵鳌岛领悟鲸息功与碧海惊涛掌，第一格洗碧海惊涛掌，第二格洗鲸息功，第三格洗十方步十级。",		
	}
	--陆渐
	TFJS[497] = {"Ｌ金刚门人",
	"Ｗ攻击时为自己添加一个100时序“金刚法相”增益BUFF：", 
	"Ｗ攻击机率触发大金刚神力，无视绝对气防+1200气攻",	
	--"Ｗ初始+20暴击率，每本天书+5%",
	--"Ｗ七书无视防御40%",	
	"Ｎ",
    "Ｌ三十二身相",
	"Ｗ攻击时或被攻击时机率触发持续100时序“一合相”BUFF,减伤15%",
	"ＷBUFF“一合相”存在期间，才会发动以下身相：",
	"Ｗ1书领悟[神鱼相]：攻击时机率追加一次连击，暴怒必连",	
	"Ｗ2书领悟[白毫相] ：被攻击机率只受到100点气攻",
	"Ｗ3书领悟[雀母相]：被攻击机率减伤50点",	
	"Ｗ4书领悟[大自在相]：被攻击机率+200集气",	
	"Ｎ", 
    "Ｌ补天劫奴",
	"Ｗ攻击与被攻击都算拳系",	
	"Ｎ", 
     "Ｚ绝技：海之道",
	"Ｒ华山后山觉醒后领悟",
    "Ｒ7书领悟 “海之道.海纳百川” 被攻击时无视对方系数",
    "Ｒ10书领悟“海之道.上善若水” 攻击时无视对方系数 ",	
	}	
	--黄衫女
	TFJS[640] = {"Ｌ古墓后人",
	"Ｗ玉女心经特效机率增加，",
	"Ｗ无需主运九阴神功可触发九阴白骨爪极意，",	
	"Ｗ华山觉醒九阴白骨爪威力+50%,",
	"Ｗ7书九阴神爪极意40%三连，暴怒必三连",	
	"Ｎ",
	"Ｌ翩若惊鸿",
	"Ｗ学会天罗地网后，每次攻击增加1~2层“疾风”每层+2.5%集气，最多10层",
	"Ｗ被男性目标攻击伤害减少10%",
	"Ｎ",
    "Ｚ绝技:广寒清辉",
	"Ｗ华山后山觉醒后暴怒触发“广寒清辉”必冻结目标集气5时序",					
	}
	--黄赏
	TFJS[637] = {"Ｌ九阴至尊",
	"Ｗ九阴神功自动运功",
	"Ｗ“易筋锻骨”：免疫封穴，免疫暴击伤害",
	"Ｗ“天之道”：攻击时触发“天之道”附加目标生命最大值5%的伤害",
	"Ｗ九阴神爪极意必两连，40%机率三连，暴怒必三连。",		
	"Ｎ",
	"Ｌ大道归藏(畅想专享)",
	"Ｗ无视条件修炼武功",
	"Ｗ所有武功可以到极",					
	}
	--寇仲
	TFJS[578] = {"Ｌ大唐双龙",
	"Ｗ阳内攻击必灼伤，概率点燃",
	"Ｗ无视内属修炼刀法",	
	"Ｎ",
	"Ｌ井月八法",
	"Ｗ每个刀法到极领悟一招",
	"Ｗ每一招加暴击伤害/暴击概率/加气攻(上限8个)", 		
	}
	--袁紫衣
	TFJS[587] = {"Ｌ紫衣银鞭",
	"Ｗ黄沙万里鞭威力加300，白莽鞭法威力加300",
	"Ｗ每修炼一个奇门武功到极，减伤提高4%（上限7个）",	
	"Ｎ",	
	"Ｇ福缘奇遇（专属剧情）",
	"Ｗ倚天正线光明顶胜灭绝第一格白莽鞭法，天外洗白莽鞭法”",	
	"Ｗ倚天邪线胜三渡第一格洗金刚伏魔圈,天外洗金刚伏魔圈”",
	"Ｗ飞雪拿到飞天神行,第三格洗飞天神行1级,天轻洗飞天神行”",	
	}
	--何足道
	TFJS[586] = {"Ｌ昆仑三圣",
	"Ｗ琴音：攻击时为敌全体添加1~4层琴音BUFF,最多30层",
	"Ｗ棋势：攻击目标附带天数书量x10的伤害",
	"Ｗ百鸟朝凤：每攻击一次给自身添加1~3层曲风，曲风BUFF>20层,消耗20层曲风给敌全体造成附加琴音层数x10的伤害",	
	"Ｎ",
	"Ｌ何足道哉",
	"Ｗ气血越少连击、暴击越高",	
	"Ｎ",  	
	"Ｇ福缘奇遇（专属剧情）",
	"Ｗ获得九阳神功，天内洗九阳神功",	
	"Ｗ获得两仪剑法，第1格洗两仪剑法",
	"Ｗ获得两仪刀法，第2格洗两仪刀法",	
	}
	--司空摘星
	TFJS[579] = {"Ｌ千变万幻",
	"Ｗ机率(20+天书数)触发“千变.相由心生”只受到误伤，",
	"Ｗ受到伤害值随天书数增加而减少",
	"Ｗ挨打增加集气速度，集气上限99,集气不受基础异常状态影响",	
	"Ｎ",
	"Ｌ盗王之王",
	"Ｗ增加敌方存活人数x5的集气速度",
	"Ｗ行动后可再次移动",	
	}		
	--步惊云
	TFJS[584] = {"Ｌ不哭死神",
	--"Ｗ自带“虚云劲”减少受到气攻，时序回复内力",
	--"Ｗ“云踪魅影 ”集气速度提升30%,无视敌人位置移动10格，获得梯云纵领悟 ",
	"Ｎ",
	"Ｒ云无常",
	"Ｗ排云掌：随天书数量增加领悟招式",	
	"Ｗ使用拳掌时触发招式。招式气攻、伤害、破防（最大36%）随招式增加",	
	"Ｗ第十到第十二式无视绝对气防与大概率破防",		
	"Ｎ",  	
	"Ｒ剑廿三",
	"Ｗ自带1-14式圣灵剑法，使用剑法时随机出招增加气攻",	
	"Ｗ15-22式需获得天书领悟，",
	"Ｗ获得9本天书后满怒时使用剑法触发剑廿三大范围攻击并概率使目标昏迷1回合",	
	}	
	--莫大
	TFJS[20] = {"Ｌ衡山掌门",
	"Ｗ华山觉醒后自带五岳剑诀",
	"Ｚ七弦无形剑",
	"Ｗ华山觉醒后领悟",
	"Ｗ“绝技·七弦无形剑·无形剑气”用剑法攻击暴怒触发",
	"Ｎ",
    "Ｌ潇湘夜雨",		
	"Ｗ剑法攻击范围+1",
	"Ｗ“笑傲江湖”：攻击时机率发动笑傲江湖追加气攻",		
	}
	--殷离
	TFJS[646] = {"Ｌ绝色佳人",
	"Ｄ千蛛万毒手",
	"Ｗ攻击强制上毒20点，根据目标中毒值回复生命",
	}	
	--鹤笔翁
	TFJS[647] = {"Ｌ玄冥二老",
	"Ｗ使用玄冥神掌，必定发动极意",
	"Ｚ此地可是白门楼",
	"Ｗ暴怒时攻击附加随机负面状态",
	"Ｚ此地可是虎牢关",
	"Ｗ战斗中首次被击退可复活一次，立即行动"
	}
	--鹿杖客
	TFJS[648] = {"Ｌ玄冥二老",
	"Ｗ使用玄冥神掌，必定发动极意",
	"Ｚ江南苟王",
	"Ｗ免疫男性非连击伤害",
	"Ｚ起峰了",
	"Ｗ被女性攻击时追加666点伤害"
	}

	--宁中则
	TFJS[649] = {"Ｌ娇美人妻",
	"Ｗ被攻击时，消耗攻击方5-10点体力",
	"Ｗ使用剑法机率触发“宁氏一剑·无双无对”附加虚弱状态1~3回合",	
	"Ｎ",
	"Ｄ华山玉女",
	"Ｗ紫霞神功必发动紫霞剑气",
	"Ｗ剑法攻击必触发“玉女十九剑”增加自身连击率，暴怒必连",	
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ获得五岳剑诀第二格洗五岳剑诀",
	}
	--白绣
	TFJS[582] = {"Ｌ冰川天女",
	"Ｗ敌方全体集气-5",
	"Ｗ攻击必冰封，冰封超过50机率冻结目标",	
	"Ｗ追加冰封值的真实伤害，自身免疫冰封",		
	"Ｎ",
	"Ｄ雪花神剑",
	"Ｗ获得雪山剑谱后领悟“雪花神剑”：",
	"Ｗ雪山剑法威力翻倍",
	"Ｗ每个武功到极增加雪山剑法100威力",
	"Ｗ攻击时概率触发“雪花神剑”，增加杀气，暴怒必触发",	
	}
	--丁当
	TFJS[581] = {"Ｌ丁丁当当",
	"Ｗ敌方全体集气-5",
	"Ｗ攻击必灼烧",	
	"Ｗ击败丁不三丁不四，金乌刀法威力增加300，只学金乌刀法可触发举火燎原",		
	"Ｎ",
	"Ｄ机灵古怪",
	"Ｗ自身集气位置概率前进30，暴怒时3倍",
	"Ｗ集气位置不会低于0",
	}
	--陆无双
	TFJS[580] = {"Ｌ银弧刀",
	"Ｗ攻击必造成流血",
	"Ｗ暴击率+30",
	"Ｎ",	
	"Ｄ五毒心经",
	"Ｗ程英局觉醒后免疫中毒",	
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ蝴蝴谷帮胡青牛治好腿伤 轻功+50",
	"Ｗ获得玉女剑法 第2格洗玉女剑法1级 ",
	"Ｗ获得玉女心经 第3格洗玉女心经1级，天内洗玉女心经 ",
	"Ｗ获得天罗地网 第5格洗天罗地网1级，天轻洗天罗地网 ",	
	}	
	--仪琳
	TFJS[583] = {"Ｌ小尼姑",
	"Ｗ被攻击伤害-15%，自身伤害-10%",
	"Ｗ获得万花剑法 1格洗万花剑法1级",	
	"Ｎ",
	"Ｄ天域幻音",
	"Ｗ行动结束时友方行动结束清除流血、中毒、冰封、灼烧、内伤并回复最多200点生命值",

	}
	--商剑鸣
	TFJS[722] = {"Ｌ八卦高手",
	"Ｗ八卦掌造成敌方“散功”状态20时序"
	}
	--商夫人
	TFJS[737] = {"Ｌ八卦高手",
	"Ｗ八卦刀造成敌方“虚弱”状态20时序"
	}
	--不戒
	TFJS[593] = {"Ｌ不戒和尚",
	"Ｒ特色指令：不戒",
	"Ｗ帮助队友自宫",
	"Ｗ每次开启消耗体力20，内力1000",
	}		
	--胡夫人
	TFJS[738] = {"Ｌ冰肌玉骨",
	"Ｗ被攻击伤害减半，但不减受伤度"
	}
	--苗若兰
	TFJS[545] = {"Ｌ望雪颦愁",
	"Ｗ被男性攻击时，免疫双击、免疫暴击伤害"
	}
	--拳王
	TFJS['拳'] = {"Ｌ盖世神拳",
	"Ｗ每修炼一个拳法到极，受伤害降低5%（上限7个）",
	"Ｎ",
	"Ｄ降龙极意",
	"Ｗ使用降龙十八掌，40%几率发动极意",
	"Ｎ",
	"Ｄ黯然极意",
	"Ｗ血量低于70%或内伤大于30时，使用黯然销魂掌有几率触发极意",
	"Ｗ血量越低，内伤越高，几率越高，满足条件时暴怒必定触发",
	"Ｗ触发黯然极意必定连击",
	"Ｎ",
	"Ｚ绝技：天道惊雷撼",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，拳掌系数>=120，使用拳掌武功攻击几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ攻击无误伤，攻击效果提升33.3%，大幅提高封穴几率，追加1200气攻",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	TFJS['指'] = {"Ｌ灵犀一指",
	"Ｗ每修炼一个指法武功到极，破防几率提高5%（上限7个）",
	"Ｗ使用六脉神剑的内力消耗减半",
	"Ｎ",
	"Ｚ绝技：点墨山河",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，指法系数>=120，使用指法武功攻击几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ攻击无误伤，不造成怒气，同时清除敌方一半怒气，追加1100气攻",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	TFJS['剑'] = {"Ｌ剑神一笑", 
	"Ｗ每修炼一个剑法到极，集气速度+2（上限7个）",
	"Ｗ使用玄铁剑法时，有几率发动重剑真传",
	"Ｗ可无视自宫需求修炼葵花宝典、辟邪剑法",
	"Ｎ",
	"Ｚ绝技：一剑镇神州",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，御剑系数>=120，使用剑系武功攻击几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ攻击无误伤，锁定攻击战场上大范围敌方目标，追加1500气攻",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	TFJS['刀'] = {"Ｌ傲世狂刀", 
	"Ｗ每修炼一个刀法到极，伤害增加5%（上限7个）",
	"Ｗ使用胡家刀法有40%几率触发极意，暴怒必触发",
	"Ｗ使用火焰刀法和沧溟刀法时，特效触发几率追加二次判定",
	"Ｎ",
	"Ｚ绝技：羽葬煌炎斩",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，耍刀系数>=120，使用刀系武功攻击几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ攻击无误伤，无视绝对气防，追加1500气攻，行动后自身怒气恢复25点（可叠加）",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	TFJS['奇'] = {"Ｌ奇门无双", 
	"Ｗ初始自带15%闪避",
	"Ｗ每修炼一个奇门武功到极，闪避率提高5%（上限7个）",
	"Ｗ打狗棒法『天下无狗』的触发几率提高，追加二次判定",
	"Ｎ",
	"Ｚ绝技：千机龙绝闪",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，奇门系数>=120，使用奇门武功攻击几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ攻击无误伤，必定造成流血及封穴，追加1000气攻",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}

	TFJS['罡'] = {"Ｌ绝世天罡", 
	"Ｗ内力属性为天罡，同时拥有阴、阳、调和三种内力属性的特性",
	"Ｗ可使用内功攻击，内功可修炼至极",
	"Ｗ斗转反击时，无视兵器值需求必定发动离合参商",
	"Ｎ",
	"Ｄ天罡真气",
	"Ｗ使用内功攻击时50%几率触发天罡真气，提升气攻",
	"Ｎ",
	"Ｚ天赋内功",
	"Ｗ学会天赋内功后，进入战斗会自动运行",
	"Ｗ天赋内功不影响正常运功，即可同时运行两种内功",
	"Ｗ手动选择运功时，无法选择九阴/九阳/易筋",
	"Ｗ三神功真气只能触发天赋内功选择的",	
	"Ｎ",
	"Ｚ绝技：化气御九天",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，任意武功攻击40%几率触发————【化气御九天】",
    "Ｗ攻击无误伤，伤害提高30%，兵器值判定必定优势，无视绝对气防，追加1300气攻；",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
    }
    
	TFJS['仁'] = {"Ｌ仁者无敌", 
	"Ｗ特效机率+10",
	"Ｗ道德值大于100增加（道德-100）/100伤害",
	"Ｗ道德值大于100减少（道德-100）/100伤害",
	"Ｎ",
	"Ｄ善恶有报	",
    "Ｗ攻击（道德-40）概率1.5倍伤害或（道德-100）%概率0.5倍伤害",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}	
	TFJS['医'] = {"Ｌ回天圣手", 
	"Ｗ初始医疗200，解毒200，用毒200；医疗上限400，用毒上限400，解毒上限400",
	"Ｗ医疗范围提升至7×7方阵",
	"Ｗ每时序随机恢复自身生命、内力、中毒、内伤",
	"Ｎ",
	"Ｚ绝技：八门聚万象",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，体力大于50点，行动结束后几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ发动之后立即获得再次行动机会，需消耗10点体力",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	TFJS['毒'] = {"Ｌ欲天摩罗",
	"Ｗ初始解毒300，用毒300；用毒上限500，解毒上限500",
	"Ｗ上毒范围提升至7×7方阵，可以给自己上毒",
	"Ｗ每时序随机增加自身中毒程度",
	"Ｗ自身中毒越深，能力反而越强",
    "Ｎ",
	"Ｚ绝技：天人五衰",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，自身中毒100点，攻击时几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ攻击无误伤，本次攻击必定附加五种异常状态",
	"Ｎ",
	"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}

	TFJS["少林弟子"] = {
	"Ｌ少林弟子",
	"Ｗ完成师门任务可以激活三个天赋",	
	}  
	--主角专属介绍
	ZJZSJS = {"Ｒ天赋外功",
	"Ｄ获得方式：拿到七本天书后，场景【华山后山】对话谢无悠",
	"Ｄ可选择一个武功作为天赋外功",
	"Ｎ",
	"Ｒ天赋内功",
	"Ｄ获得方式：拿到十本天书后，场景【华山后山】挑战谢无悠胜利",
	"Ｄ可选择一个内功作为天赋内功",
	}
	
	WPTX2 = {}
    WPTX2[0] = "时序恢复1点内伤，持续50时序"
    WPTX2[1] = "时序恢复2点生命，满实战翻倍，持续100时序"
    WPTX2[3] = "时序恢复8点内力，持续200时序"
    WPTX2[9] = "时序恢复1点中毒，持续50时序"
    WPTX2[10] = "时序恢复1点中毒，持续50时序"
    WPTX2[11] = "提升战场抗毒100点，持续至战斗结束"
    WPTX2[22] = "解除冰封50点并时序恢复1点冰封，持续50时序"
    WPTX2[23] = "解除灼烧20点并时序恢复1点灼烧，持续50时序"
    WPTX2[24] = "解除流血50点并时序恢复1点流血，持续100时序"
    WPTX2[25] = "清除所有基础异常"

