export default {
  name: '经脉',
  list: [
    {
      name: '手三阴经',
      list: [
        {name: '手少阴经', attr: '需405武学点，攻+8 防+4 轻+6，点满额外加50攻'},
        {name: '手太阴经', attr: '需455武学点，攻+15 防+6 轻+9，点满额外加50防'},
        {name: '手厥阴经', attr: '需405武学点，攻+16 防+8 轻+12，点满额外加50轻'},
      ],
    },
    {
      name: '手三阳经',
      list: [
        {name: '手少阳经', attr: '需555武学点，攻+12 防+20 轻+16，点满额外加50攻'},
        {name: '手太阳经', attr: '需505武学点，攻+16 防+16 轻+12，点满额外加50防'},
        {name: '手阳明经', attr: '需455武学点，攻+16 防+12 轻+12，点满额外加50轻'},
      ],
    },
    {
      name: '足三阴经',
      list: [
        {name: '足少阴经', attr: '需505武学点，攻+12 防+16 轻+16，点满额外加50攻'},
        {name: '足太阴经', attr: '需505武学点，攻+12 防+16 轻+16，点满额外加50防'},
        {name: '足厥阴经', attr: '需555武学点，攻+16 防+16 轻+16，点满额外加50轻'},
      ],
    },
    {
      name: '足三阳经',
      list: [
        {name: '足少阳经', attr: '需505武学点，攻+12 防+16 轻+16，点满额外加50攻'},
        {name: '足太阳经', attr: '需505武学点，攻+12 防+16 轻+16，点满额外加50防'},
        {name: '足阳明经', attr: '需555武学点，攻+12 防+20 轻+16，点满额外加50轻'},
      ],
    },
    {
      name: '任督二脉',
      list: [
        {name: '任脉', attr: '需455武学点，攻+16 防+12 轻+12，点满额外加50攻防轻'},
        {name: '督脉', attr: '需455武学点，攻+16 防+12 轻+12，点满额外加50攻防轻'},
      ],
    },
  ],
};
