export default {
  name: '丐帮',
  effect: ['使用打狗棒法能触发【打狗要诀】', '使用降龙十八掌30%几率触发【降龙三叠浪】', '攻击中概率偷盗目标身上的金钱和药物'],
  talent: [
    {
      name: '丐帮弟子',
      effect: ['丐帮武功连击率+10%，暴击率+10%，可额外选择两个天赋'],
    },
  ],
  martial: [
    {
      name: '拳掌',
      list: ['初级：乞儿两式', '中级：莲花落', '高级：铜锤手', '绝学：降龙十八掌'],
    },
    {
      name: '奇门',
      list: ['初级：呼延枪法', '中级：中平枪法', '高级：疯魔棍法', '绝学：打狗棒法'],
    },
    {
      name: '内功',
      list: ['初级：莲花功', '高级：擒龙功'],
    },
    {
      name: '轻功',
      list: ['初级：莲花身法', '绝学：逍遥游'],
    },
  ],
};
