export default {
  name: '古墓派',
  join: '',
  effect: [],
  talent: [],
  martial: [
    {
      name: '拳掌',
      list: ['初阶：美女拳法', '绝学：黯然销魂掌'],
    },
    {
      name: '指腿',
      list: ['中阶：三无三不手'],
    },
    {
      name: '剑法',
      list: ['中阶：玉女剑法', '绝学：玄铁剑法 玉女素心剑'],
    },
    {
      name: '奇门',
      list: ['中阶：银拂尘功 玉蜂针 冰魄银针 银索金铃'],
    },
    {
      name: '内功',
      list: ['初阶：古墓心法', '高阶：玉女心经', '绝学：浮游功'],
    },
    {
      name: '轻功',
      list: ['初阶：古墓身法', '绝学：天罗地网'],
    },
  ],
};
