export default {
  name: '华山派',
  effect: ['使用剑法几率三连击，且连击伤害不减，连击时命中提升20%'],
  talent: [
    {
      name: '华山弟子',
      effect: ['华山派武功连击率+10%，暴击率+10%，可额外选择两个天赋'],
    },
  ],
  martial: [
    {
      name: '剑法',
      list: [
        '中级：太岳三清峰  宁氏一剑   玉女十九剑',
        '高级：狂风快剑  夺命三仙剑  华岳三神峰',
        '绝学：独孤九剑  西岳神剑',
      ],
    },
    {
      name: '拳掌',
      list: [
        '中级：伏虎拳',
        '高级：劈石破玉拳  混元掌  玉碎掌',
      ],
    },
    {
      name: '内功',
      list: [
        '初级：华山心法',
        '中级：紫霞神功',
        '高级：混元功',
        '绝学：五岳剑诀',
      ],
    },
    {
      name: '轻功',
      list: [
        '初级：华山身法',
        '绝学：神行百变',
      ],
    },
  ],
};
