export default {
  name: '江湖散人',
  join: '畅想默认江湖散人，可使用介绍信加入其他门派',
  effect: ['可在扬州武馆学习江湖武功'],
  talent: [],
  martial: [
    {
      name: '拳掌',
      list: [
        '初阶：闪电貂手',
        '中阶：满洲摔跤  春蚕掌法  铁掌',
        '高阶：碧针清掌  奔雷手',
        '绝学：野球拳',
      ],
    },
    {
      name: '指腿',
      list: ['初阶：蓝砂手', '中阶：袖中指', '高阶：岳王散手', '绝学: 九阴白骨爪'],
    },
    {
      name: '刀法',
      list: [
        '初阶：柴刀十八路  南山刀法  回风拂柳刀',
        '中阶：雁行刀',
        '高阶：井月八法  夫妻刀法  屠龙刀法',
        '绝学: 西瓜刀法  胡家刀法',
      ],
    },
    {
      name: '剑法',
      list: [
        '初阶：雷震剑法',
        '高阶：苗家剑法  铁剑诀 连城剑法',
        '绝学: 越女剑法  神山剑法  斩流剑术  青莲剑法',
      ],
    },
    {
      name: '奇门',
      list: [
        '初阶：呼延十八鞭  海叟钓法',
        '中阶：大剪刀  五虎棍法',
        '高阶：阴阳倒乱刃  白蟒鞭法  枣核钉',
        '绝学：小李飞刀 犽月流空',
      ],
    },
    {
      name: '内功',
      list: ['中阶：神照功', '绝学：九阴神功  九阳神功  太玄神功  九霄仙息  天魔功  阴阳无极功'],
    },
    {
      name: '轻功',
      list: ['绝学：迷踪步 蛇行狸翻  飞天神行'],
    },
  ],
};
