export default {
  name: '明教',
  join: '待开放',
  effect: [],
  talent: [],
  martial: [
    {
      name: '拳掌',
      list: ['高阶：寒冰绵掌'],
    },
    {
      name: '指腿',
      list: ['中阶：鹰爪功', '绝学：大九天手 大阴阳手'],
    },
    {
      name: '刀法',
      list: [
        '初阶：六合刀法',
        '中阶：修罗刀 五虎断门刀 狂风刀法',
        '高阶：天王刀法 阴风刀 屠龙刀法',
        '绝学：天刀九问 沧溟刀法',
      ],
    },
    {
      name: '奇门',
      list: ['绝学：圣火令法'],
    },
    {
      name: '内功',
      list: [
        '初阶：明教心法',
        '中阶：地火功 (NPC处可直接一脉圣火神功)',
        '高阶：乾坤大挪移',
        '绝学：圣火神功',
      ],
    },
    {
      name: '轻功',
      list: ['初阶：圣火身法', '绝学：幻尘身法'],
    },
  ],
};
