export default {
  name: '日月神教',
  join: '帮任我行打败东方不败后接受任我行的邀请可加入',
  effect: [],
  talent: [],
  martial: [
    {
      name: '指腿',
      list: ['绝学：葵花点穴手'],
    },
    {
      name: '剑法',
      list: ['初阶：一字电剑', '高阶: 泼墨披麻剑', '绝学：辟邪剑法'],
    },
    {
      name: '奇门',
      list: [
        '初阶: 丹青破穴',
        '中阶：棋盘招式 裴将军帖',
        '高阶: 持瑶琴 葵元七绝针',
        '绝学: 阴葵灭魂针',
      ],
    },
    {
      name: '内功',
      list: ['初阶：日月心法', '中阶: 小星罗功', '高阶：吸星大法', '绝学：日月玄功 葵花神功'],
    },
    {
      name: '轻功',
      list: ['初阶：日月身法', '绝学：魅影空蝉'],
    },
  ],
};
