export default {
  name: '少林派',
  effect: ['受到攻击概率进入防御状态', '【易筋经真谛】概率固定60%'],
  talent: [
    {
      name: '悲天悯佛',
      condition: '入般若堂完成铜人巷任务',
      effect: ['般若掌攻击范围变为点，威力翻倍', '生命值低于50%拥有绝对气防'],
    },
    {
      name: '天佛降世',
      condition: '完成南北少林任务',
      effect: ['战斗中可以复活一次，复活后免疫内伤，免疫暴击伤害'],
    },
  ],
  martial: [
    {
      name: '拳掌',
      list: ['初阶：罗汉拳', '中阶：韦陀掌', '高阶：大力金刚掌 千手如来掌', '绝学：须弥山神掌 般若掌法'],
    },
    {
      name: '指腿',
      list: [
        '初阶：天竺佛指',
        '中阶：去烦恼指  一指禅  多罗叶指  大慈大悲手',
        '高阶：龙爪手  大智无定指  拈花指',
        '绝学：大力金刚指  无相劫指',
      ],
    },
    {
      name: '剑法',
      list: ['高阶：达摩剑法'],
    },
    {
      name: '刀法',
      list: ['初阶：慈悲刀法', '中阶：降魔刀法'],
    },

    {
      name: '奇门',
      list: ['初阶：普渡杖法', '中阶：韦陀棍法', '高阶：袈裟伏魔功', '绝学：金刚伏魔圈  伏魔杖法'],
    },
    {
      name: '内功',
      list: ['初阶：少林心法', '中阶：罗汉伏魔功  少林九阳功', '高阶：狮子吼  金刚不坏体  神足经', '绝学：金刚狮子吼  易筋神功'],
    },
    {
      name: '轻功',
      list: ['初阶：少林身法', '绝学：一苇渡江'],
    },
  ],
};
