export default {
  name: '天机宫',
  join: '将介绍信送给天机宫里边房间的明镜',
  effect: ['25%概率免疫以自己为中心的九宫格内敌人的攻击'],
  talent: [
    {
      name: '天机弟子',
      effect: ['天机宫武功连击率+10%，暴击率+10%，可额外选择两个天关天赋'],
    },
  ],
  martial: [
    {
      name: '拳掌',
      list: ['初阶：天机掌法', '中阶：百花错拳', '高阶：五行六合掌', '绝学：碧海惊涛掌'],
    },
    {
      name: '指腿',
      list: ['中阶：穿花蝶影手', '高阶：流云飞袖  东鳞西爪功', '绝学：灵枢灵玄指'],
    },
    {
      name: '剑法',
      list: ['中阶：三分剑术  玄女剑法', '高阶：归藏八剑  猿公剑法', '绝学：太乙分光剑'],
    },
    {
      name: '刀法',
      list: ['高阶：庖丁解牛刀'],
    },
    {
      name: '内功',
      list: ['初阶：天机心法', '中阶：小周天功', '高阶：大周天功  灵犀分水功', '绝学：鲸息功'],
    },
    {
      name: '轻功',
      list: ['初阶：天机身法', '绝学：十方步'],
    },
  ],
};
