export default {
  name: '天龙寺',
  effect: ['六脉神剑可以触发六脉奥义', '皇家血脉增加体质2点', '增加耗内点数一半的真实伤害'],
  talent: [
    {
      name: '天龙弟子',
      effect: ['天龙寺武功连击率+10%，暴击率+10%，可额外选择两个天赋'],
    },
  ],
  martial: [
    {
      name: '指腿',
      list: ['初阶：段家指法', '中阶：玄天指', '高阶：一阳指', '绝学：六脉神剑'],
    },
    {
      name: '拳掌',
      list: ['中阶：五罗轻烟掌'],
    },
    {
      name: '内功',
      list: ['初阶：天龙心法', '中阶：古针禅功', '高阶：枯荣禅功', '绝学：大长和诀'],
    },
    {
      name: '轻功',
      list: ['初阶：天龙身法', '绝学：龙行虎步'],
    },
  ],
};
