export default {
  name: '武当派',
  effect: ['【太极奥义】固定60%概率触发', '主运太极神功时，时序增加蓄力值，太极蓄力值清除时只清除一半', '使用太极拳和太极剑后自动防御'],
  talent: [
    {
      name: '武当弟子',
      effect: ['武当派武功连击率+10%，暴击率+10%，可额外选择两个天赋'],
    },
  ],
  martial: [
    {
      name: '拳掌',
      list: ['初阶：绵掌', '中阶：无极玄功拳', '高阶：震天铁掌', '绝学：太极拳'],
    },
    {
      name: '剑法',
      list: ['初阶：武当剑法', '中阶：柔云剑法  绕指柔剑', '高阶：神门十三剑', '绝学：太极剑'],
    },
    {
      name: '内功',
      list: ['初阶：武当心法', '中阶：武当九阳功  龟息功', '高阶：纯阳无极功', '绝学：太极神功'],
    },
    {
      name: '轻功',
      list: ['初阶：武当身法', '绝学：梯云纵横'],
    },
  ],
};
