export default {
  name: '鹿鼎记',
  normal: [
    {
      map: '扬州-天上人间（江南）',
      event: [
        {
          list: ['与右上房间的韦小宝对话，韦小宝入队', '获得【一指禅】'],
          reward: ['韦小宝[队友] 入队', '一指禅[指法秘籍]'],
        },
      ],
    },
    {
      map: '沧州-有间客栈（北部）',
      event: [
        {
          list: ['韦小宝在队，触发剧情后进入战斗：', 'VS 海大富 （可败）', '胜利后获得【化骨绵掌】'],
          reward: ['化骨绵掌[拳掌秘籍]'],
        },
      ],
    },
    {
      map: '北京（北部）',
      event: [
        {
          list: ['左边房间进门触发剧情，进入战斗：', 'VS 大内高手*4'],
          reward: [],
        },
        {
          list: ['客栈对话钱老板，花500两购得[茯苓花雕猪]'],
          reward: ['茯苓花雕猪[剧情道具]'],
        },
        {
          list: [
            '对禁卫使用[茯苓花雕猪]，进入皇宫',
            '右上房间，进门触发剧情，进入战斗：',
            'VS 鳌拜（可败）',
            '剧情后获得[皇宫通行令]',
            '*对战鳌拜如果失败将无法进入秘道抄家，但不影响拿天书',
          ],
          reward: ['皇宫通行令[剧情道具]'],
        },
        {
          list: [
            '出皇宫后，进入左上鳌拜府，对话椅子背后的柜子，发现秘道',
            '开启宝箱获得：',
            '[银两]*5000 [火枪] [金丝背心]【金刚不坏体】【神行百变】',
          ],
          reward: [
            '银两*5000',
            '金丝背心[防具]',
            '金刚不坏体[内功秘籍]',
            '火枪[武器]',
            '神行百变[轻功秘籍]',
            '韦小宝奖励：',
            '第一格武功洗火枪极',
            '第二格武功洗神行百变1级',
            '天赋外功洗为火枪',
            '天赋轻功洗为神行百变',
          ],
        },
      ],
    },
    {
      map: '台湾（海外）',
      event: [
        {
          list: ['韦小宝在队，进门触发剧情，进入战斗：', 'VS 冯锡范+阿珂+郑克爽', '剧情后得[半部四十二章经]【凝血神爪】'],
          reward: ['半部四十二章经[剧情道具]', '凝血神爪[指法秘籍]'],
        },
      ],
    },
    {
      map: '神龙教（海外）',
      event: [
        {
          list: ['与看门小兵对话触发战斗：', 'VS 神龙教徒*8'],
          reward: [],
        },
        {
          list: ['进入屋内触发战斗：', 'VS 洪教主+苏荃+神龙教众', '胜后，韦小宝离队，获得[四十二章经]'],
          reward: ['四十二章经[剧情道具]'],
        },
      ],
    },
    {
      map: '小村（江南）',
      event: [
        {
          list: ['到北丑房间里的蜡烛处使用[四十二章经]，鹿鼎山开启'],
          reward: [],
        },
      ],
    },
    {
      map: '鹿鼎山（北部）',
      event: [
        {
          list: ['VS一大群大雪怪', '开启宝箱获得：', '银两*1000、千年灵芝、【百胜刀法】《鹿鼎记》'],
          reward: ['银两*1000', '千年灵芝[丹药]', '百胜刀法[刀法秘籍]', '鹿鼎记[十四天书之一]'],
        },
      ],
    },
    {
      map: '扬州-天上人间（江南）',
      event: [
        {
          list: [
            '与韦小宝对话，可收韦小宝、阿珂、苏荃入队',
            //'*可以在韦小宝处购买[霹雳弹]和[千年灵芝]*2'
          ],
          reward: ['韦小宝[队友] 加入', '阿珂[队友] 加入', '苏荃[队友] 加入'],
        },
      ],
    },
  ],
};
