export default {
  name: '特殊',
  list: [
    {
      id: 752,
      name: '顾惜朝',
      talent: [9934, 752, 9933],
    },
    {
      id: 497,
      name: '陆渐',
      talent: [497, 9749],
    },
    {
      id: 578,
      name: '寇仲',
      talent: [9742, 578, 9952],
    },
    {
      id: 505,
      name: '徐子陵',
      talent: [505, 9978, 9979],
    },
    {
      id: 652,
      name: '萧秋水',
      talent: [652, 9725, 9953],
    },
    {
      id: 579,
      name: '司空摘星',
      talent: [579, 9740],
    },
    {
      id: 500,
      name: '西门吹雪',
      talent: [500, 9748, 9941],
    },
    {
      id: 498,
      name: '李寻欢',
      talent: [498, 9804],
    },
    {
      id: 637,
      name: '黄裳',
      talent: [9954, 637, 9729],
    },
    {
      id: 577,
      name: '达摩',
      talent: [9995, 577, 9939, 9963, 9940],
    },
    {
      id: 635,
      name: '梁萧',
      talent: [9731, 635, 9732],
    },
    {
      id: 501,
      name: '谢云流',
      talent: [9953, 501, 9975],
    },
    {
      id: 596,
      name: '谢无悠',
      talent: [9806, 596, 9746],
    },
    {
      id: 504,
      name: '诡剑',
      talent: [9977, 9976, 504],
    },
    {
      id: 507,
      name: '梅长苏',
      talent: [507, 9969],
    },
    {
      id: 721,
      name: '酒神',
      talent: [9841, 721, 9965],
    },
    {
      id: 546,
      name: '聂风',
      talent: [546, 9948, 9949],
    },
    {
      id: 610,
      name: '花满楼',
      talent: [610, 9944, 9942],
    },
    {
      id: 514,
      name: '五陆柒',
      talent: [9918, 514, 9919],
    },
    {
      id: 515,
      name: '电饭锅',
      talent: [515],
    },
    {
      id: 502,
      name: '雄霸',
      talent: [9723, 9722, 502],
    },
  ],
};
