export default {
  name: '战报',
  exclusive: '',
  list: [
    {
      id: 'shi',
      name: '势',
      level: 4,
      content: `
1.07V25fix40 百周地狱 单通 1资质 任飞燕 明教 阳刀
（新手向战报）
 
关于天赋 和天赋格子 ：目前 开局1天赋角色 ，开局3个 天赋格子
开局2天赋角色 4个天赋格子， 3天赋及以上 ，5个天赋格子

家里给异性队友 对应喜好物品增加好感度，100好感度结婚，200好感度双儿处
休息可以生孩子 ，可以选择一次天赋 ， 并且额外获得一个天赋格子，
所以 初始3天赋格子和4天赋格子 可以再增加1个天赋格子， 5天赋的格子的不会在增加，门派弟子 升神话可以额外获得一格子，所以门派弟子还不错
3天赋及以上开局不能选择天赋 ，1天赋的最终只能达到4天赋格子
因为选择 畅享任飞燕 天赋并不强， 但是好在初始2天赋 拥有4个天赋格子，生孩子以后可以达到5天赋   初始档， 最推荐的天赋还是白驹过隙 
这个畅享人物属于弱鸡畅想，刀法也不算强，但是1资质是 流程会比高资质顺，因为左右更好拿，明教目前也是强力门派。

流程 开始

1. 对话神秘少女 选择 全搜， 并且开家里宝箱
2. 扬州武馆学习 鱼叟钓法 ，（后续程英居打败李莫愁 拿到银索金铃 ，可合成秘籍绝处逢生），并且直接练满 ，并运功 
3. 如果走射雕邪， 可以 蒙古包收郭靖 ，然后进行到洪七公居， 如果走倚天邪可以在到朱府进行剧情 ，以上就是清道德。  之后去江陵天宁寺，功德箱选择 慈悲
无论道德多低 ，都能到65   
4. 开局不战斗可获得的队友 装备 道德 获取
古墓收小龙女，装备金丝手套 ， 
唐诗山洞收狄云 道德+2
大理 客栈收 温青青 道德 +1
家里给祖千秋 翡翠杯 ，道德+1  
家里和北丑对话，给他5两银子，获得铁铲，对西部农村NPC 使用，教孩子武功 道德+1 ，不收钱道德 +1 不要选错
龙门客栈 商店买 皮衣 （减冰封，满级免疫冰封）装备。

5. 家里商人处把银两全部买食材。 然后在旁边的厨灶 全部练腊八粥 ，吃掉包里的 所有腊八粥， 蟠桃和 千年灵芝 ，之后了获得了银两也全部先把内力吃满  

6. 去青城派（也可以去少林）找弟子练功，，战斗前 在游戏设置里 战斗速度选择 快 ，然后存档 读档 就可以 增加战斗速度了。  此处也可以免费开关 心魔 和天气
第一次 进战斗 选择 撤退  ，可以回满内力。
然后就在青城派住下了， 一直刷 ，最好打一次  存一下档 。 
当武功10级以后武功到登峰造极， 会出现心魔，打败心魔 可以获得额外 100武学点和10000修炼点，100武学点是硬上限， 不打心魔武学点应该最多只有2998 。武学点用来升级经脉，除了前期练功弟子，基本上NPC 战斗都能获得武学点，但是心魔多打也没用，因为并不需要点那么多经脉，开局打几个还是有性价比， 难打的心魔放弃。 外功心魔 需要靠攻击次数，内功是挨打次数，轻功是移动步数    

心魔特性， 属性 装备 武功 天赋 都是根据主角来的 ，其中心魔出现 会 自动装备 最强的外功，但是内功是 按照主角当前内功装备  并且心魔不会吃药。也没有 门派特性

所以当 本回合 出心魔的时候，退出游戏重新 读取存档，  卸掉 天赋  和装备 ，装备 最弱的 的内功。 游戏中装备无法直接卸载，但可以给其他队友装备  ，主角的装备就卸载了。    外功心魔可以回家去打木桩 。内功心魔靠挨打到极

出心魔以后 战斗中选择状态啦 ，点击 天赋栏  和 装备栏可以装上 天赋 和装备 ，  打败心魔需要注意 最终死于流血等DEBUFF的 心魔 是没有奖励的。必须物理最后一击

7. 然后继续  无尽的打青城弟子 ，目标是200贡献点可以在扬州学神照经，前期还是非常值得 ，也是作为畅享的 福利。  畅享另外一个福利 是 可以在云岭洞直接找 喵姐 获取迷踪步。加入门派以后无法直接获得    青城弟子一次8点贡献，需要打25次  。 任务状态栏，最下面可以设置战斗自动类型  和 功力层数 ，  所以欺负青城弟子只需要自动就可以解放双手了。 其他啥都不学 去挑战  恒山看门弟子，结果开自动失败了。 如果愿意放弃 神照 经  那么可以跳过这个过程。
200贡献达成以后，在去扬州武馆学习神照经  ，升级满 并运功
并且开始 考虑经脉，先考虑 轻功的 足少阳经 ， 即便 后续武学点够了 最后的经脉都都先不点， 因为 这个10% 的轻功是加的面板属性 ，例如400点轻功 就是 加40点轻功，你到900点的时候点了会加90，一般考虑相对后期点。或者卡剧情 。  经脉中的百分比加成 ，就是九阴 九阳和轻功的最终奇穴+10% 是加面板属性的，其他都是 额外加成 ，而非面板 可以 直接点 。  目前奇门 200的奇穴 是任何系都额外增加攻击力 必点。
这个时候考虑关闭心魔，因为神照心魔此时相当难打 ，回血太快。能打死，但浪费时间，要打挺久 

8. 继续开始走剧情，笑傲 福州客栈 ，战斗开自动过 ， 进入福威镖局与镖师对话 。2 
9. 衡阳城 打青城四兽， 战斗开自动过。。  前期 的苦尽甘来
10. 华山派对话岳灵珊， 去思过崖 打令狐冲 ，可败 。选择体验翔实剧情

11. 华山派 ，剧情打成不忧 。  成不忧会三连，攻击很高 ，但是这个时候的成不忧 ，我们只要能命中他 ，就能秒杀他升一流，而我们有白驹过隙和神照经  存个档随便过。 因为我们跳过升二流 ，此时可以选可以两个天赋  。二流选择 过目不忘 ，升级武功三围 翻倍 。选完之后点确定，然后点下一步 。 一流我选了万法自然。   这两个天赋 ，过目不忘是个人认为是必选 ，选了这个天赋最终三围可以满 。万法自然可以 增加下回合的集气位置，还不错 ，但是也可以选别的
升二流也可以去沧州打 范兴汉， 吃点药就轻松过了。
12.    
13. 装备上过目不忘 ，之后凡是要学和练武功 都要装备上过目不忘。然后再回到扬州武馆，找师傅学最后一个武功 ，轻功提纵术 ，之后到400轻功就可以迷踪步 一脉相承 

14. 加入明教，对杨逍 用介绍信，然后向冷谦学武功。 然后学习 六合刀法 明教心法 和圣火身法 ，但这么看 为了终极省格子 提纵术 和一脉迷踪步 也可以不学，但是学了 前期会更顺了。 初级轻功一级+5 ，绝学轻功一级+10 ，就是150点轻功，加上过目不忘就是300点。  +圣火身法 又是100点， 咱学满直接+400点轻功 。 毕竟最终多少还有一个叫无极丹的东西
门派选择阳刀一脉 六合刀法=>五虎断门刀=>=》屠龙刀法，然后单独学圣火令刀法 
门派轻功直接可以一脉，门派内功 ，因为地火功可以一脉圣火神功，那么直接跳过高阶的大光明心经 
当然还有提纵术可以一脉 迷踪步
这个时候内功先不要升级 ，然后可以吧外功 ，轻功的心魔 打一下 ，适度打几个心魔。 因为这个时候 打心魔也比较容易  。后四个武功全部一脉以后
此时面板属性   ，并且点轻功和刀法的经脉  ，轻功最后一个奇穴暂时不点。

15. 破庙 挺身而出   ，装备白马
16. 龙门客栈帮叮当抢酒 ， 道德 75 旁边收虚竹 。
详解虚竹线收益： 去擂鼓山破棋局可以获得天山六阳掌，小无相功，棋盘招式，化功大法，连环腐尸毒，神木王鼎，寒袖拂穴，七宝指环，白虹掌力，八荒六合功，天山折梅手  
但是以上对于 阳内 刀法的我而言，一点用都没有， 那么 咱直接送虚竹回少林 获得 少林九阳功 道德+10  ， 

17.  85道德可以 做的事情 ，
去武当对话张三丰  拿绕指柔剑法，无极玄功拳，龟息功，神门剑谱
去少林 对话方证 拿燃木刀法 ，去天台山 拿慈悲刀法（75道德） ，
但以上基本没用，只有龟息功可以点 足厥阴经 奇穴，但这个奇穴也可以用龙象点 
18. 沧州剧情， 此时可以更为轻松的 打败范兴汉，  然后飞雪剧情 ，进行到睡觉前 道德+1  。 沧州客栈买 大剪刀  （后续点了奇门200奇穴可以加攻击力） +屠龙刀法   。作为明教弟子， 屠龙刀法可以 一脉相承 五虎断门刀  。需要的修炼点较多， 建议升级到7到8级就去 过剧情 ，靠战斗或者空挥升级挥更快一些 。
19. 长乐帮 拿 罗汉伏魔功 ， 加上之前的少林九阳功 。 
罗汉伏魔功 需要修炼点多，同样考虑升到7到8级 去丐帮挂自动休息 挨打升级
 此时基本成型

20.  蒙古包收郭靖 ，北京 欧阳克选战斗， 洪七公居 剧情  后去桃花岛招亲 ，打赢郭靖 得 千年灵芝 ，服下。 顺便 看一下对联 
21. 程英居打李莫愁 ，学银索金铃 ， 合成秘技 绝处逢生 
22. 绝情谷 剧情， 战公孙止众人
23. 沙漠蜘蛛洞 ， 和老顽童对话 获得 左右互搏 。   战斗力提升 
24. 蒙古包 帮江南奇怪打梅超风
25. 独孤剑冢  打 大蛇。   拿玄铁剑法 和 玄铁剑
26. 华山金蛇山洞 拔剑， 打和红药  
27. 金陵城 对话袁承志 ，对话阿九，选择调查，右上房间拿到信给阿九
28. 金龙帮 连战， 剧情后对 焦婉儿 得金龙鞭
29. 五仙教 ，战何铁手众人。 
30. 凤阳开书剑剧情， 往里走之后进入蝴蝶谷 ，帮胡青牛夫妇 打金花婆婆，勇于嗑药，回家收 胡青年 王难姑，拿到医术和毒经 就把二人离开队伍。 现在就可以把药材都 练黑玉断续膏了， 
这个时候 装备上  过目不忘 ，修炼 金花婆婆给的 幻尘身法 一脉掉圣火身法。毒经也修炼一下 ，可以点毒经脉 第一个奇穴 
31. 扬州 丽春院收韦小宝，  帮田伯光  打 余沧海 胜利 升阶豪侠， 天赋随意选 。此战难度不小， 血少就吃药，黑玉当糖吃。
32. 重阳宫 ，走射雕邪  抢杨过的天书  ，得 龙象般若功 ，  此战血少可以去人群中吃天王保命丹。  第一个绝学内功到手 修炼。  作为绝学需要修炼点极多，我是升到8级，然后去 丐帮开自动休息挂机了。 这个阶段已经没有必要在打心魔了，可以关闭。
这个时候 属性非常不平衡，因为阳内秘技 加防御多，攻击才617 ， 经脉点满足厥阴经 

33. 华山后山 打玉真子。 然后去勃泥岛 ，对话袁承志  ，得碧血剑 。然后让其离队吧。 第一本天书到手 。 
34. 沙漠废墟  继续白马剧情，此战主要怼着木灵子输出 。胜利后 进入密道 劈开巨石 ，获得天数 白马啸西风
35. 恒山派 ，对话定闲 ，   打败团战中的晓风师太升宗师，我选了七星海棠  
回光明顶 ，圣火神功一脉相承地火功，  并且学习 圣火令刀法。在此之后 心魔就完全没 必要了。  有钱就去买扬州商店的灵芝  
激活刀法大招 奇穴 
36. 破庙 点击丁典的坟， 然后 打宝象   。  接着去龙门客栈触发剧情，  到雪山  不帮血刀老祖，战血刀老祖 。 战后和狄云对话，对水盆使用唐诗选集 ，去天宁寺 触发大战  。 佛像后拿天书， 出门打败戚长发 获得神照经秘籍
37. 去药王庙挖坟，打寇仲和徐子陵  。打徐子陵 穿皮衣免疫冰封。 长生诀一脉神照经 。   足阳明经 点到第一个奇穴即可 
38.  晋阳 中条山 对话宋缺， 再打一次寇仲获得天刀九问 并修炼 ，终极武功 
39. 华山打后山 打谢无悠， 选天赋外功  天刀九问
40. 乌鞘岭 开启 鸳鸯刀剧情， 然后凉州客栈剧情 ，出门对话 ，打败任飞燕夫妇 ，去小树林 继续剧情，深入到紫竹庵 。触发战斗。
41. 晋阳 萧府 剧情  ，去北边 中条山 收 萧中慧 袁冠南 ，出海去鸳鸯岛 。打败 萧半和（100道德以下去打更容易），得中庸 。  天书 鸳鸯刀
目前 主运天刀九问 龙象般若功 迷踪步   ，天赋白驹过隙 +七星海棠 
42. 沧州 同时进行鹿鼎记 和飞雪剧情 ，(带韦小宝） 进客栈触发剧情  。参考流程攻略不详细叙述。 之前 飞雪剧情 进行到 第一次睡觉前。 那么就睡觉 出门对话打苗人凤 =>商家堡=>沧州客栈剧情后回房休息后战斗，再战苗人凤  ，战后休息，去客栈外面坟前对话苗人凤=>商家堡=>苗人凤居=> 衡阳成药王庄=>阎基居=>药王庄 给 程灵素七星海棠,邀请加入=>苗人凤居 给眼药 ，剧情后 打赢苗人凤 得飞狐外传  
43. 北京城  左下房间帮茅十八， 客栈买猪  。 右上房间 进行剧情 ，大战后袁紫衣入队，进皇宫 打鳌拜  ，出皇宫 鳌拜府 密室 =>=台湾 =>神龙教=>回家北丑旁边蜡烛烧四十二章经 
44.  鹿鼎山 打雪怪  得鹿鼎记     ，玉笔山庄山洞 打雪怪 得雪山飞狐    。自此 7本天书到手  。
45.  走侠客行 正线。  长乐帮 给贝海石 玄冰碧火酒   ，选不去灭雪山派 =>紫烟岛=>长乐帮对话石破天=>凌霄城 =>长乐帮石破天入队=>侠客岛剧情 战龙木岛主 得太玄经 和 侠客行   。 尝试 李白 ，可以磨死 
46. 进行神雕邪剧情 绝情谷 ，战斗后看石碑=>古墓 密道剧情=>江陵客栈=>黑龙潭=>百花谷=>黑龙谭=>百花谷=>绝情谷=>襄阳大战 得飞龙骓  ，神雕侠侣
47. 倚天剧情一直没想好正邪， 最后还是考虑 走正吧。 朱府 选择告诉 张无忌 =>昆仑派对话=>龙门客栈打灭绝=>光明顶密道战成昆=>光明顶战六大派=>冰火岛=>绿柳山庄=>武当派=>万安寺=>龙门客栈收赵敏=>灵蛇岛=>光明顶=>成昆居=>光明顶交人头，得倚天屠龙记  ， 可以挑战 光明圣火阵 激活圣火令特效
48. 昆仑仙境 ，战金轮众人 ，  战 阿青  。

49. 少林寺  战斗酒僧 ，九阳神功 一脉 少林九阳功 记得装备过目不忘 。龙门客栈买一个 天内丹， 天赋内功 选九阳神功，这一步也可以 没学九阳钱完成 点手阳明经   。 运九阳神功 
50. 铁掌山小路 拿大燕皇帝谱系表 ，开始进行天龙邪剧情 。
51. 无量山 山洞打蛤蟆，出洞打四大恶人 =>大理天龙寺，左上房间拿溪山行旅图=>苏州燕子坞 给慕容复  玉玺和皇帝谱系表 选确定 =>丐帮剧情=>聚贤庄剧情=>少林寺大战 藏经阁对话扫地 书架一次 打 扫地 达摩。 =>天龙寺灭门，打天龙三兄弟 ，书架拿六脉神剑，， 两个千年灵芝吃掉。 两个地灵丹 为之后学九阴做准备

52. 继续射雕剧情 ，明霞岛 =>嘉兴牛家村 连战欧阳锋 =>铁掌山 =>一灯居 =>洪七公居 =>桃花岛 =>回家收郭靖 黄蓉 =>重阳宫大战 => 华山绝顶帮洪七公
使用上下任意半部九阴 合成九阴真经 ， 吃地灵丹 改阴内， 带上过目不忘，学习九阴真经   
还有两个格子 比较富足，暂且考虑刀法三连 鸳鸯刀+夫妻刀法
53. 书剑李沅芷线， 之前 凤阳已经去过了， 杭州客栈对话丐帮弟子=>杭州六合塔 选沅芷线 =>龙门客栈=>从回族部落进清军大营=>回族部落 =>乌鞘岭=>回族部落=>凉州客栈 ，商店李沅芷入队，门口打阿凡提 =>回族部落对话=>龙门客栈=>武当收张召重=> 南少林大战 书剑拿 书剑恩仇录
54. 就剩下笑傲江湖了， 但是一直没去华山论剑   ，  就华山后山  打阿凡提（绝对先手） ，扫地僧（永久减少伤害20%），东方不败（集气+8）  。其实很早就可以去论剑， 基本上6本天书 升宗师以后就 差不多就有实力去论剑了 。比如 走的倚天正，也完全可以 先在昆仑仙境打阿青升神话 ，就可以更稳健。。
所以虽然选的弱鸡人物， 但是流程还是相当保守

继续之前笑傲剧情， 华山思过崖 =>回华山派 对话陆大有=>药王庙=>洛阳金刀王家 ，绿竹巷对话令狐冲，出洛阳 在进洛阳 对话令狐冲 =>开封 对话平一指=>少室山下 剧情，回大地图，在进少室山 对话令狐冲 触发大战=>杭州梅庄 剧情 =>福州福威镖局 选择取消  不相信令狐冲 =>少室山下=>黑木崖 战东方众人 ，战葵花尊者=>华山对话岳不群=>嵩山派比武=>华山下 最终战  得笑傲江湖 
55. 武道大会  地灵丹吃掉了没有学夫妻刀法 那么最终学了沧溟刀法。 内功还是九阳更加稳妥，主要看 白驹过隙和 七星海棠（天王保命 10时序无敌）  迷踪步 明教秘技 来存活 。 人群中吃天王保命丹  
56. 旧版大会 胜利   
人物确实比较弱，但是明教挺强 。 

尝试众神之战 20神话 。 最后因为 这个斗酒僧 共享 一个不断的加血 一个和我奋斗，所以还是没打过 ，但是差的不多。 稍微再规划一下 基本问题不大 最后 复盘，  本周目选的是弱鸡角色，  但是 没有结婚生孩子拿天赋， 格子也有剩余 ，早点学鸳鸯刀 ， 刀法系数应该能更快到400 。 所以是有余地的， 换成门派弟子或者天赋好点的角色  游戏难度会降低不少
      `,
    },
  ],
};
