<template>
  <v-scroll class="home-wrap">
    <h4 class="home-title">金书群侠传1.07简易攻略</h4>
    <pre class="pre-log">
      -------正式版V2.3-----8-10.fix8-----
      1，战斗设置里增加一个风筝攻击（测试）
      2，修复自动战斗菜单中 选择原地攻击，没有自动战斗也不会移动的问题
      3，修复没有内力也会攻击的问题
      4，华山论剑奖励 扫地奖励改为：伤害固定减少20%
      5，修复护盾值会出现小数点的问题，修复九阳神功护盾结算伤害时伤害大于0，而不会产生护盾值，只会生成护盾特效的问题
      6，修复波斯圣女天赋
      7，调整龙木二岛主的主运内功为太玄神功，攻击武功为太玄神功（需重开）
      8，调整苗人凤的主运内功为镇岳诀，陈正德的主运内功为大周天功（需重开）
      9，小村神秘少女处增加模拟人物战斗（不产生武学点和修炼点）
      10，天赋魔帝.吸星增加吸星大法自运，修复吸星大法触发吸内时特效文字显示错误的问题
      11，修复内功光环特效不生效的问题（其实是忘写了）
      12，修复少林木人巷挑战没有须弥山神掌会卡位置问题
      13，调整了战斗快捷键按键

      -------正式版V2.3-----8-5.fix7-----
      1，修复逆转乾坤自动战斗挪移敌方攻击的位置会随机，现在再也不会打到自己了。但是也偶而会触发另一种效果反弹（明教要崛起了？）
      2，修复原金刚伏魔说明错误有误的问题，天赋名改为抱残守缺
      3，修复燕子三抄水、迷踪步闪避攻击不会自己移动的问题
      4，修复读取大地图的存档物品显示异常的问题
      5，修复主角免疫封穴的问题

      -------正式版V2.3-----8-3.fix6-----
      1，修复心魔关闭失败的问题
      2，调整世尊降魔的伤害
      3，修复攻击方针有误的问题

      -------正式版V2.3-----8-3.fix5-----
      1，修復太玄神功激活状态有错误的问题
      2，修复物品图不显示的问题
      3，PC增加物品键E和M键马车
      4，修复手机战场操作移动没有连按效果
      5，修复按F1马车传送进地图会出黑屏的问题
      6，修复太极奥义不触发的问题，修正秘技太极奥义描述不详细的问题
      7，修复商店显示异常的问题

      -------正式版V2.3-----8-3-----
      1，修復太玄神功激活状态有错误的问题
      2，修复物品图不显示的问题
      3，PC增加物品键E和M键马车
      4，修复手机战场操作移动没有连按效果
      5，修复按F1马车传送进地图会出黑屏的问题
      6，修复太极奥义不触发的问题，修正秘技太极奥义描述不详细的问题
      7，修复商店显示异常的问题

      -------正式版V2.3-----8-2-----
      1，修復內功特效【死神之吻】說明有誤的問題
      2，修复手机版存档和读档图标错误的问题
      3，修复读档偶在特定情况下会显示储存进度的文字显示错误
      4，修复自动战斗招式方针bug

      -------正式版V2.3-----8-1-----
      1,更新手机版一些内容，更新了按键，区别了PC版和其他平台的按键，手机版支持平版和手柄
        现在手机版的存档也可以跟PC通用了
      2，加强九阳神功，削弱九阳挑战，阳内半血可拿奖励。
      3，修复江陵挑战可以多次洗武功的问题
      4，轻功登萍渡水门派和描述异常的问题
      5，在主菜单增加设置功能（原音效开关，可以在游戏中切换战斗速度，头顶显示血条，天气对战斗的影响，心魔，夜幕，切换传送方式等）
      6，修复一些初阶内功拥有绝学内功的特效问题（后续待查，有发现请及时上报）
      7，无量山段延庆主运内功调整为枯荣禅功
      8，修正虚竹第五格洗折梅手，胡斐第一格洗胡刀的天赋描述
      9，加强刀剑归真，概率出多次连击，最多4连
      10，补充战斗buff说明
      11，人物状态页面增加一个自动战斗方针
      12，修复主运会复活的内功不复活的问题，修复挪移武功不会挪移的问题
      13，调整忘情天书最后一个特效为【天机秘术】，调整鲸息功最后一个特效为【周流六虚】，调整长诀最后一个特效为【仙人抚顶】
      14，再次增强太玄神功，加强【太玄反震】和【混沌太玄】，

      -----正式版V2.2补丁2-----2025-6-14-----
      1，修复五岳的掌门天赋问题
      2，调整内轻特效封喉的伤害
      3，调整气贯五岳的伤害浮动范围
      4，修复气攻异常问题
      5，取消少林弟子入门自动增加的两个天赋
      6，修复斗转自运功奇穴跳出问题，修复自运功某些人物跳出问题
      7，替换怀旧音乐包 ，不喜欢可以用老版的sound文件替换

      -----正式版V2.2补丁1-----2025-6-12-----
      1，修复一些描述错误问题
      3，目前只可用十八罗汉阵，其他阵法没有实装
      4,，修复武功耗内异常问题
      5，修复主运鲸息功的时候，怒气值自动增加会超过100，并且没有爆气效果，集气速度不增加，攻击也不能触发绝招。
      6，**浩然正气场上总buff数超过一定数量，触发浩然效果时，会直接跳出游戏。（待查，有人因为这个原因跳出，请马上把debug发群里或私聊发我）
      7，修复一些跳出问题
      8，修改太玄神功/太极神功/忘情天书/瞬息千里的特效
      9，每5时序自动回复1点冰封/灼烧/中毒/内伤/流血，扣除相应的生命或内力
      10，修复一些天赋自动运功无效的问题
      11，修复一些状态伤害异常的问题
      12，调整黄赏的一个天赋

      -----正式版V2.2-----2025-5-10-----
      1，更改存档面板，增加三两个自动存档，(完成)
      2，增加队友游历，队友可以游历增加属性和打通奇穴(完成)
      3，增加NPC自动游历，每一天会有50~100个NPC自动游历，游历结束会增加属性获得物品，一流境界以上NPC会概率打通奇穴（优先与人物使用武功、内属、资质、医、毒等属性高度相关），极少概率领悟秘技和天赋，还有可能突破境界(完成)
      4，内功重做，内功特效分级，绝学内功部分有特殊效果(完成90%)
      5，削减移动距离，不装备轻功最大移动为6格，装备轻功后为8格，特殊人物天赋不受限，冰封影响移动，每25点冰封减少移动步数1，上限4（中毒和内伤不再影响移动）（完成）
      6，修复了集气速异常的问题，调整了集气速度计算（完成）
      7，宗师及神话境界人物攻击无误伤，作为大佬还有误伤不合理。
      8，加强葵花辟邪的盲目效果为特殊效果，不可反弹，不可清除，盲目状态100%MISS，特殊人物（眼瞎者不受此状态影响）
      9，修复混沌太玄解锁条件

      -----正式版V2.1补丁5-----2024-12-3-----
      1，修复成昆战斗跳出问题，修复少林达摩院学武功跳出，

      -----正式版V2.1补丁5-----2024-12-1-----
      1，修复少林寺弟子挑战铜人阵会卡住的问题
      2，修复已知跳出问题
      3，官兵统一归入门派六扇门
      4，修复鹿鼎记剧情拿不到完整四十二章经问题

      -----正式版V2.1补丁4-----2024-11-24-----
      1，修复任务指引小和尚历险记跳出问题
      2，闯天关时在北丑处可以看到可获得的天赋
      3，修复杂学修炼者错误的问题，修复查看酒神跳出的问题

      -----正式版V2.1补丁3-----2024-11-23-----
      1，调整吃药效果
      2，调整飞狐剧情药王庙战斗改为 VS 袁紫衣+凤天南
      3，修复一些跳出问题
      4，补一些人物立绘和头象
      5，游戏加入任务追踪（目前不完整）
      6，萧玲正名为李清露，收李秋露入队有奖励
      7，新增武当派真武七截阵挑战（可重复），开放木人铜人可重复挑战（奖励只有一次）佛山新增挑战黄飞鸿（获得无影脚）
      8，调整门派武功学习条件，获得对应的门派贡献后需要对应的境界才可学习（绝学宗师及以上（后续会开放门派挑战获得），高阶豪侠以上，中阶二流以上，低阶不限）
      9，修复经脉键盘操作异常问题，修复境界提升满五个天赋还会弹窗的问题
      10，调整大周天功大宗师特效：无视敌方30%防御
      11，提高战斗中获得的修炼点和门派贡献

      -----正式版V2.1补丁2-----2024-11-14-----
      1，修复五毒峨眉明教学武功异常问题
      2，增加古墓学武功师傅（需重开）
      3，修复境界提升天赋选择不可放弃的问题
      4，图鉴里在门派菜单增加门派武功和门派人物
      5，调整一些人物的门派归属
      6，修复贯通经脉没有额外属性加成的问题

      -----正式版V2.1补丁1-----2024-11-13-----
      1，修复部分武功和天赋会导致NPC集气异常问题
      2，修复开局主角会出现随机武功的问题
      3，修复门派学内功会跳出的问题
      4，修复少林门派学武菜单
      5，调整战斗数值显示字体
      6，修复门派武功不需要门派贡献可以学全部武功的问题

      -----正式版V2.1补丁1-----2024-11-13-----
      1，修复部分武功和天赋会导致NPC集气异常问题
      2，修复开局主角会出现随机武功的问题
      3，修复门派学内功会跳出的问题
      4，修复少林门派学武菜单
      5，调整战斗数值显示字体
      6，修复门派武功不需要门派贡献可以学全部武功的问题

      -----正式版V2.1-----2024-11-12（需重开）-----
      1，修复马车切换的问题
      2，真武剑定为武当掌门信物，需获得太极神功后才可获得
      3，增加五毒，明教，峨眉师傅
      4，调整一些江湖武功的门派归属
      5，优化门派武学界面
      6，奇穴加入天罡内属判定（天罡内属无视内属要求）
      7，降低游戏戏度，大副削弱NPC
      8，重新赋予武功系数在伤害中的作用，+-系数差的真实伤害，内功+-内力差/10的伤害最高666
      9，完成对应剧情后：张无忌实至名归成教主，虚主实至名归成宫主，狄云成血刀掌门，星宿弟子灭丁春秋成星宿掌门(畅想享同等待遇)
      10，修复一些bug
      11，增加提升境界时的奖励，菜鸟（攻防轻+10，门派贡献+50），三流（五系+10，门派贡献+50），二流（攻防轻+15，门派贡献+50），一流（五系+15，攻防轻+15，门派贡献+50），豪侠（攻防轻+30，门派贡献+50），宗师（攻防轻+40，门派贡献+50），神话（攻防轻+50，五系+30，门派贡献+50）
        按人物分阶随机赋予天赋，人物提升境界如果天赋位没满，会随机获得天赋，可选择。
        三流~二流（低于两个天赋，可随机选择一个2级天赋），二流~一流~豪侠（低于三个天赋，可随机选择一个3级天赋），豪侠~宗师~神话（低于四个天赋，可随机选择一个4级天赋）

      -----正式版V2.0补丁10-----2024-11-5-----
      1，修复吃药后药品效果不正确的问题
      2，天宁寺捐寺捐款恢复到最多只能捐到道德65
      3，增加一个传送功切换，对话双儿》特别功能》传送方式，可切换地图和文字传送

      -----正式版V2.0补丁9-----2024-11-5-----
      1，修复水笙误伤跳出的问题
      2，调整误伤伤害下限
      3，斗转概率跳出BUG，物转星移奇穴效果BUG
      4，修复商店物品数量购买不减的问题
      5，优化门派逍遥和少林的男女选择问题
      6，调整孩子成长
      7，调高武功系数成长值
      8，增加一个图鉴按钮，含游戏基本资料，包括剧情攻略（新增）
      9，修复结婚后睡觉概率跳出问题

      -----正式版V2.0补丁8-----2024-10-30-----
      1，修复武当派接取龙门血案剧情后无法学武功的问题（有武当弟子可在任务里接取）
      2，修复慕容复承伤异常的问题
      3，修复无极丹无效果问题
      5，修复护盾动切换显示异常的问题
      6，修复天关查看获得的天赋列表会跳出的问题

      -----正式版V2.0补丁7-----2024-10-29-----
      1，修复队友心魔武功异常导致的跳出问题
      2，修复周目商店异常的问题，增加几种物品到周目商店
      3，修复成就页面不显示通关记录的问题
      4，修复开局天赋BUG，优化开局天赋选择（增加重选功能）
      5，门派武功使用秘籍也可以一脉相承

      -----正式版V2.0补丁6-----2024-10-25-----
      1，修复一些跳出BUG和菜单错误

      -----正式版V2.0补丁5-----2024-10-24-----
      1，修复一些跳出BUG和菜单错误
      2，扬州新增一个武馆，武馆可以给江湖散人学绝学以下的武学。

      -----正式版V2.0补丁3-----2024-10-23-----
      1，修复一些跳出BUG和一些经脉问题
      2，测试：队友有门派也可以回师门学武功了（只开放了少林，武当，逍遥，全真，丐帮，天龙，华山，血刀，密宗）
      3，修复离经易道奇穴敌方行动不发动的问题。

      -----正式版V2.0补丁2-----2024-1-22-----
      1，修复一些跳出BUG和修复一些奇穴满足条件无法激活的问题

      -----正式版V2.0补丁2-----2024-10-21-----
      1，修复一些跳出BUG
      2，修复一些奇穴满足条件无法激活的问题

      -----正式版V2.0补丁1-----2024-10-19-----
      1，修复畅想洗武功没有招式的问题
      2，修复手动战斗跳出的问题

      2024-10-18（部分更新内容需重开才能体验）暂时停更新内容只修BUG
      -----正式版V2.0 -----------
      1，修复部分药品食物说明错误的问题。
      2，实装全部奇穴。
      3，修复滚动信息条不显示的问题。
      4，增加高级NPC开局会点亮部分奇穴，在游戏过程中，部分高级NPC也会随机激活一些奇穴（未完成）。
      5，完善灵犀分水功，拿到鲸息功后天机宫挑战云殊获得（比梁萧好打多了）
          攻击时必造成冰封。
          追加敌方冰封程度的伤害。
          增加自身冰封程度/5点集气。
          受到伤害时，恢复自身冰封程度2倍的生命。
          受到伤害时，20%概率由战场所有目标分担自己所受的此次伤害。
      6，修复一些斩杀武功和招式无效的问题。修复须弥山神掌描述错误的问题。
      7，优化新开游戏的等待时长。（在此歌颂伟大的喵姐）
      8，昆仑仙境的桃树每一年都会长一个蟠桃
      9，调整畅想人物的初始五系成长值。
      10，调整必中不生效的问题。
      11，修复一些其他BUG

      -----正式版V1.02补丁28 2024-10-10------
      1，修复跟乔峰对话跳出BUG，修复初级轻功看说明会跳出BUG
      2，优化武功秘籍内容过长，没有翻页提示的问题。
      3，统一护盾。不再区别内功护盾。
      4，完善奇穴说明（有建议及时提）。
      5，调整地灵丹攻效为修改内力性质
      6，修复刀剑绝技跳出BUG
      7, 修复新建角色进游戏需要等待的问题（在此歌颂伟大的喵姐）

      -----正式版V1.02国庆版------
      修修补补的国庆假期到此结束，特殊奇穴没有赋于效果，修补了操作上的一些BUG，优化了一些UI，更多BUG需要群友提供给我，时间实在有限
      1，增强狄云赤心连城天赋
            '真名神照','主运神照功时拥有绝对气防（一脉后主运长生诀同样有效）.神照功/长生诀复活无需运功，效果强化，恢复百分比为100%，并且立即行动，使用武功绝招只需要60点怒气，轻功+20。 
            '赤心连城','学会连城剑法必连击，如本次攻击造成伤害低于150，则追加一次连击（一轮追加上限3次），修炼血刀大法无惩罚，不会降低生命上限，学会血刀大法必暴击。*【福缘际遇】雪山剧情，洗第二、三格武功。
      2，开放部分经脉特效，增加NPC经脉
      3，开放招式绝招，每一招的最后一招需怒气值100使用（部分天赋有减需求），造成大范围大量伤害且增加大量气攻。
      4，新增丐帮浑天气功，获取方式（非丐帮弟子在丐帮战胜乔峰，注意，乔峰失踪后就无了）
      5，优化了一些操作，修复了一些BUG，美化了一些界面

      -----正式版V1.02补丁27------
      1,调整九剑第七招和第九剑的效果
      2，修正北冥神功【气吞山河】描述和效果错误的问题
      3，修正江陵9日比武的奖励与描述不符的问题，每月19号也增加一场比武
      4，修复小村木桩事件错误的问题
      5，修复素质三连的问题，可全武功触发三连，概率为50%（满怒100%触发）
      6，修复混元一气特效说明

      -----正式版V1.02补丁26------
      1，在家睡觉增加时间选择（一天，五天，一月，五月，一年，五年）
      2，修复无字天书不可兑换的问题

      -----正式版V1.02补丁25------
      1，新增主角修改名字（在选择周目界面）
      2，新增自创武功，目前只支持自创外功（自创内功待定）
          条件1：打通任督二脉
          条件2：自创武功的系的系数>=200
          条件3：获得无字天书，无字天书在燕子坞书阁处用残章兑换（兑换价格200+50000银子）
      3，修复血量在部分场景显示异常的问题

      -----正式版V1.02补丁24（需重开，不影响旧存档的正常游戏）------
      1，开放蜘蛛洞可以无限刷武学点（进出场景刷新）
      2，每月的初九日，将在江陵城举行比武，战胜参赛选选手将获得巨额修炼点数和武学点，还有稀有药品等大奖，且有概率洗一次第一格武功（限一次，洗的武功是比赛对手的武功之一，可选择。）
      3，重新调整部分物品效果（受上限9999）：最大生命【天山雪莲+100，玉笛+50，叫化鸡+20】，最大内力【大蟠桃+200，腊八粥+100，好逑汤+20】千年人参随机三围+10，

      -----正式版V1.02补丁23------
      1，开放有秘技个数为10个，第11个秘技即使显示也不会生效

      -----正式版V1.02补丁22 （需重开，不影响旧存档的正常游戏）------
      1，更换所有秘籍的图片显示
      2，修复小李飞刀练不出秘技的BUG
      3，开放新版内功特效的组成方式及说明方式（未完成，有兴趣选手可联系我接手完成，已经完成模式的初步框架）
      4，加入血刀门杀血刀老祖后，将直升血刀门掌门
        加入星宿派杀丁春秋后，将直升星宿派掌门
        畅想虚竹灵鹫宫大战后将直升逍遥派掌门	
        加入华山派杀岳不群后将直升华山派掌门
        掌门人有更高的门派武功连爆和威力加成，获得掌门印记，战场上敌方的本门弟子自动反水。

      -----正式版V1.02补丁21------
      1，双儿处增加主角易容功能

      -----正式版V1.02补丁19------
      1，修复鲸息功BUG
      2，写入境阶减伤，受到的伤害【传说减50%，宗师减40%，一流减30%，二流减20%，三流减10%】，敌我都有效。
      3，减伤公式计算，比如武功1减伤50%，天赋1减伤50%，共计减伤1 - （0.5*0.5） = 75%，减伤上限为80%。
      4，恐惧后不能反击也不能先手反击，锁足定身后不能闪避
      5，修复一些BUG

      -----正式版V1.02补丁18------
      1，重写暴击触发效果，不再由攻击方触发，由防御方触发，判定机制【攻击方暴击率-防御方抗暴】
      2，内力和体力不足，不可以攻击。
      3，修复集中指令的问题

      -----正式版V1.02补丁17------
      1，修复招式必中没有实装的问题
      2，调整秘技剑胆琴心效果，越靠近敌人，攻击时增加的命中越多；受到攻击时，敌人越近减少的命中越多。
      3，调整独孤九剑招式，破X式对使用X的敌人增伤15%；受到敌方攻击时会发动敌武功类型的破x式，化解15%的伤害。
      4，修复武功招式必中触发异常问题

      -----正式版V1.02补丁16------
      1，修复同一武功在多个秘技组合中出现时有时无法激活秘技的BUG
      2，修复神行百变与说明不相符

      -----正式版V1.02补丁15------
      1，新增秘技【定神门】：神门十三剑+五行六合掌+阴阳倒乱刃+灵枢定玄指，刀剑连击概率+10，拳指暴击概率+10%，攻击时定身概率+100%，攻击封穴+5点。
      2，新增秘技【玄虚劲】：无极玄功拳+玄虚刀法+玄天指。自身破绽时受到攻击时免疫伤害，且集气位置+200，减少50%受到的气攻。
      3，天机宫书架增加灵枢定玄指秘籍（需战斗）
      4，修复一些已知BUG。

      -----正式版V1.02补丁12------
      1，修复武当三宝获取有误问题。
      2，修复屠狮大会后回武当拿太极拳剑跳出问题。

      -----正式版V1.02补丁11------
      1，修复飞雪闯王宝藏获取银两有误。
      2，修复畅想人物不能拜入密宗。
      3，修复没有介绍信不能开局搜刮。
      4，修改武当三宝，原太极拳奖励改为无极玄功拳，原太极剑改为神门十三剑。①倚天正线带无忌回武当如果已经获得太极神功则获得太极拳、太极剑。②没有获得太极拳太极剑则需屠师大会完成后回武当张三丰送太极拳、太极剑（需拿到太极神功）。

      -----正式版V1.02补丁10------
      1，修复畅想人物加入少林不可选择院派的问题。
      2，修复任我行日月魔帝主动攻击触发吸星大法概率问题。
      3，增加生子奖励，生孩子后，主角最大内力+500，体质+1。老婆最大内力+1000，体质+1。
      4，初始天赋将由天关闯关获得的天赋决定，初始天赋少于3个的将可以选择一个周目天赋。

      -----正式版V1.02补丁09------
      1，测试阵法系统，我方参战人员已经掌握的阵法可以选择，敌方在掌握的阵法中随机一种阵法，特殊战斗阵法固定，阵法拥有不同战场加成。门派加入阵法可学习，学习条件同绝学。
      2，修复七弦剑气天赋用别的武功不触发的问题
      3，修复天书人物天龙八部畅想中出现备用人物的问题
      4，闯王宝藏增加奖励（千年灵芝1，钱20000）
      5，畅想现在可以通过介绍信加入十大门派了。
      6，修复距离增伤异常的问题

      -----正式版V1.02补丁08------
      1，修复自慕容复，慕容博畅想没有激活斗转，畅想周伯通不带左右的问题
      2，修复使用药品恢复生命加成没有随实战的增加而增加的问题（最高增加3倍）
      3，修复一脉中没武当心法和太极神功的问题
      4，修复大王二王反击跳出问题
      5，修复经脉加成会超出上限的问题
      6，修复白展堂战斗跳出

      -----正式版V1.02补丁07------
      1，修复目前发现的问题

      -----正式版V1.02补丁06------
      1，美化游戏商店
      2，扬州商店增加玉灵散出售
      3，修复斗转后招式有误
      4，修复华山跳转华山下会卡地图
      5，招式再动，在行动过一次后，再次触发概率会随着触发的次数降低
      6，修复选择队友界面默认是主角的问题
      7，修复招式说明有误

      -----正式版V1.02补丁05------
      1，补漏修复上次没有完成修复的金刚不坏效果
      2，夜幕将可以在神秘少女那里关闭和开启了。
      3，增加人物状态面板内力属性显示。

      -----正式版V1.02补丁04------
      1，修复【虎虎生风】不生效、【罗汉金身】、【金刚不坏】、【以柔克刚】等秘技不生效问题
      2，修复洗武功时洗武功的格子无武功时，洗完后位置错位的问题
      3，修复一脉相承武功不能激活秘技
      4，修复少林第三个天赋无法获取问题
      5，修复部分武功说明。
      6，新增新秘技【万象天引】
      7，天赋列表隐藏几个特殊天赋
      8，修复逍遥派可以通过按键选择男性的问题

      -----正式版V1.02补丁03------
      1，修正部分战场光环加成有误
      2，修正丐帮不触发少林大战

      -----正式版V1.02补丁01------
      1，调整主运天罗地网概率触发必中。
      2，苗家庄挑战苗人凤后给飞狐外传天书和苗家剑法，藏王宝藏为雪山飞狐
      3，恢复大部分组合技，全部归纳到秘技里
      4，隐藏一些专属天赋
      5，凌波微步独立计算20%概率闪避，每次被敌人命中，都会增加200闪避值（可无限叠加,触发闪避后清除）
      6，修复葵花邪线不可修炼的BUG
      7，修复长平眷恋会直接加在主角身上的BUG
      8，增加十大门派的门派特点，鼠标放在人物界面门派LOGO处可以查看。
      9，修复郑克爽天赋异常问题
      --0610补充--
      10，血刀门门派特性战斗跳出BUG
      11，星宿暴毒跳出问题

      -----正式版012补丁------
      1，增加青城，少林，全真可无限挑战的单人战斗
      2，修复不用秘籍学武功会损失一级属性的问题
      3，修复左右资质概率跟描述一样
      4，修复打狗要诀跳出
      5，门派轻功可以一脉相承了
      6，增加实战显示，增加一个秘技系统显示，秘技效果和激活只完成了左右，中庸，斗转和一些杂学，组合未完成
      补充补丁
      7，虚竹，林平之，狄云剧情会改变其门派
      8，中庸不能修炼的问题
      9，商家堡不再提前可以触发飞狐外传
      10，修复代霸受过天赋偶而闪退的问题
      11，修复门派丐帮在天龙丐帮剧情后不可出门的BUG

      -----正式版010补丁------
      1，调整部分战斗难度
      2，修正血饮魔刀攻击范围和距离的问题
      3，增加血海魔功主运效果和说明
      4，暂停门派绝学挑战（后续有奖励再加）
      5，修改战斗经验由敌人的分阶来决定，高级敌人越多经验越高，修炼经验除家里木桩外所有地方不再限制。
      6，修复部分剧情BUG
      7，修复部分跳出BUG
      8，解封天机宫弟子碧海惊涛掌六奇劲，
        解封及增强武当派弟子开太极及太极蓄力效果同原张三丰一样。
        解封丐帮弟子降龙三叠浪和打狗奥义要诀。解锁血刀弟子血战八方。
      9，基于生命上已经增加，开放体质上限为20点，增加吃药效果随实战而增加，最高为原来的三倍。

      -----正式版006补丁（需重开,不重开可能存在部分BUG，不想重开只需要把SCRIPT文件夹里的文件覆盖原文件就可以。）--------
      1，增加十大门派学习武功和相关剧情。
      2，宋青书莫声谷剧情正邪两线皆可做了。
      3，增加血刀，天机，密宗的绝技传授人，增加十大门派武功传授人。
      7，修复郭靖不能离队BUG
      5，调整一些武功为十大门派一些武功。部分门派开局可以选择两系中的一系发展。
      6，主界面增加地图马车按键。
      7，修复部分秘籍修炼跳出问题。
      补充补充
      8，修复门派学武不能一脉相承问题
      9，显示门派贡献（门派学武门槛），战斗升阶都会获得一定的门派贡献。
      10，修复迷踪步异常问题
      11，修复一脉相承武功后，没有更换使用的武功造成战斗跳出的问题。

      -----正式版004补丁--------
      1，修复战斗中意外怀孕的问题
      2，修复中庸，左右修炼跳出的问题
      3，修复一些LQBZ的BUG
      4，不用秘籍门派学武也可以一脉相承了。

      --正式版003补丁---
      1，修复修炼秘籍属性异常问题
      2，修复部分反击不会判定攻击目标
      3，修复部分天赋光环作用目标异常
      4，修复一些跳出问题

      --0527补丁修复问题--
      1，基本完成结婚生子系统。
      3，机器猫老师优化天气效果，下雪和下雨效果对应天气。
      4，扬州增加西域商人（出售获得的物品），出现时间看滚动消息条。
      5，优化周目商店操作。
      6，战场显示调整，人物头顶原来的体力条改变怒气槽。体内血条右边的数字为人物集气速度。
      7，修复一些跳出debug
      8，整体下调游戏难度，降低敌方三围值。
      9，修复天宁寺不可捐道德的问题
      10，修复无秘籍武功升级不加属性问题，修复战斗中升级武功不加属性问题。
      11，修复对话跳出问题。
      12，完成娶老婆生孩子剧情。
      13，完成十大门派入门初级剧情。
      14，修复战斗中杀气会被杀到集气条之外的BUG。
      15，修复部分战斗模型位移问题。

      --0525补丁修复问题--
      1，补全人物菜单全部按键操作
      2，优化奇穴界面卡顿及难以选择问题
      3，修复一些跳出debug
    </pre>
  </v-scroll>
</template>

<script></script>

<style lang="less">
.home-wrap {
  background: #fff;

  .home-title {
    padding: 30px 0 10px;
    text-align: center;
    font-size: 20px;
  }
}
</style>
