export default {
  name: '白马啸西风',
  list: [
    {
      name: '李文秀',
      talent: [
        {
          name: '白马侠女',
          effect: ['装备白马时集气加成效果翻倍', '每修炼一个奇门武功到极，集气速度+2（上限7个）'],
        },
        {
          name: '心秀天铃',
          effect: ['使用奇门武功，有(天书数*2+实战/25)%的几率发动“心秀天铃·星月争辉”，追加800点气攻，如已有14本天书，则触发此特效必破气防'],
        },
      ],
      fortune: [],
    },
    {
      name: '瓦耳拉齐',
      talent: [
        {
          name: '一指镇江南',
          effect: ['指系武功威力+200'],
        },
      ],
      fortune: [],
    },
    {
      name: '陈达海',
      talent: [
        {
          name: '青蟒剑',
          effect: ['金蛇剑法威力+200'],
        },
      ],
      fortune: [],
    },
  ],
};
