export default {
  name: '飞狐外传',
  list: [
    {
      id: 'huFei',
      name: '胡斐',
      talent: [
        {name: '雪山飞狐', effect: ['集气速度提升8点', '特色指令【飞狐】：无视障碍物移动，在战场上来去自如，消耗10点体力']},
        {name: '魂系一刀', effect: ['胡家刀法到极增加10点耍刀技巧，增加胡家刀法极意40%']},
        {name: '傲世狂刀', effect: ['刀法威力+200，增加自身20%耍刀系数的攻击和防御']},
      ],
      fortune: ['获得《雪山飞狐》天书后，找苗人凤可洗第二格武功苗家剑法'],
    },
    {
      id: 'chengLingSu',
      name: '程灵素',
      talent: [
        {
          name: '灵枢素问',
          effect: [
            '医疗能力上限400点',
            '用毒能力上限500点',
            '攻击时附带【七心海棠】，敌方全体中毒20点，并扣除7%当前血量，随机给友方全体增加随机药品BUFF',
            '攻击时即使杀死敌方，也不会中断连击',
          ],
        },
      ],
      fortune: [],
    },
    {
      id: 'miaoRenFeng',
      name: '苗人凤',
      talent: [{name: '金面佛', effect: ['攻击时高概率附带灼烧', '每100点御剑系数增加苗家剑法攻击范围1格']}],
      fortune: ['闯王宝藏获得四象步法时，可选择洗第二格武功和天赋轻功为飞天神行'],
    },
    {
      id: 'yanJi',
      name: '阎基',
      talent: [{name: '跌打医生', effect: ['医疗上限300', '用毒上限300', '让田归农的攻击中附加带毒', '击退敌方后可获得银两']}],
      fortune: [],
    },
    {
      id: 'tianGuiNong',
      name: '田归农',
      talent: [{name: '天龙掌门', effect: ['无视兵器值需求装备[闯王军刀]', '装备[闯王军刀]，攻击时必定附加流血效果']}],
      fortune: ['飞狐外传邪线击败苗人凤和胡斐后，攻击+30、防御+30、轻功+30，第一格武功洗苗家剑法1极，第二格武功洗胡家刀法1级'],
    },
    {
      id: 'yuanZiYi',
      name: '袁紫衣',
      talent: [{name: '紫衣银鞭', effect: ['每修炼一个奇门武功到极，减伤提高4%（上限7个）']}],
      fortune: [
        '倚天正线光明顶胜灭绝第一格白莽鞭法，天外洗白莽鞭法',
        '倚天邪线胜三渡第一格洗金刚伏魔圈，天外洗金刚伏魔圈',
        '飞雪拿到飞天神行，第三格洗飞天神行1级，天轻洗飞天神行',
      ],
    },
    {
      id: 'tangPei',
      name: '汤沛',
      talent: [
        {name: '汤大侠', effect: ['攻击(100-道德)%概率1.2倍伤害']},
        {name: '甘霖惠七省', effect: ['行动结束时恢复我方全体最多5%生命（上限100点）']},
      ],
      fortune: [],
    },
    {
      id: 'shangBaoZhen',
      name: '商宝震',
      talent: [
        {name: '八卦高手', effect: ['八卦门武功连击率+10%，暴击率+10%']},
        {name: '商家堡主', effect: ['使用八卦掌后八卦刀追加300点伤害', '使用八卦刀后八卦掌必定三连']},
      ],
      fortune: [],
    },
    {
      id: 'wangJianJie',
      name: '王剑杰',
      talent: [
        {name: '八卦高手', effect: ['八卦门武功连击率+20%，暴击率+20%']},
        {name: '隔壁大王', effect: ['八卦刀威力1.5倍，受到攻击后有30%概率用八卦刀反击']},
      ],
      fortune: [],
    },
    {
      id: 'wangJianYing',
      name: '王剑英',
      talent: [
        {name: '八卦高手', effect: ['八卦门武功连击率+20%，暴击率+20%']},
        {name: '隔壁二王', effect: ['八卦掌威力1.5倍，受到攻击后有30%概率用八卦掌反击']},
      ],
      fortune: [],
    },
    {
      id: 'liuHeZhen',
      name: '刘鹤真',
      talent: [
        {name: '韦陀高手', effect: ['韦陀掌威力+400']},
        {name: '韦陀双鹤', effect: ['使用韦陀掌概率触发“鹤啸九天”：', '周身六格内目标概率混乱，被攻击的目标集气位置倒退300']},
      ],
      fortune: [],
    },
    {
      id: 'saiShangE',
      name: '赛尚鄂',
      talent: [
        {name: '御林军', effect: ['己方人数越多，攻击力和防御力越高']},
        {name: '满洲勇士', effect: ['满洲摔跤威力翻倍，概率使目标无法移动一回合']},
      ],
      fortune: [],
    },
    {
      id: 'fengNanTian',
      name: '凤南天',
      talent: [
        {name: '佛山一霸', effect: ['被攻击概率让队友承担75%伤害']},
        {name: '三才归元', effect: ['如果格挡，免疫伤害(减伤上限为80%)并进行反击']},
      ],
      fortune: [],
    },
  ],
};
