export default {
  name: '鹿鼎记',
  list: [
    {
      name: '韦小宝',
      talent: [
        {
          name: '洪福齐天',
          effect: ['特色指令：口才，使一名敌方进入沉睡状态，此状态无法集气，不会自行解除，受到攻击会醒来'],
        },
        {
          name: '机敏无双',
          effect: ['战斗开始前50时序，受到伤害不超过50点'],
        },
      ],
      fortune: ['鹿鼎记鳌拜府密室剧情，洗第一二格武功，能装备火枪'],
    },
    {
      name: '阿珂',
      talent: [
        {
          name: '金枝玉叶',
          effect: ['敌方全体防御力降低15%'],
        },
      ],
      fortune: [],
    },
    {
      name: '苏荃',
      talent: [
        {
          name: '媚眼如丝',
          effect: ['敌方全体攻击效果降低15%'],
        },
      ],
      fortune: [],
    },
    {
      name: '海大富',
      talent: [
        {
          name: '阴阳怪气',
          effect: ['使用化骨绵掌削弱敌方体力内力'],
        },
      ],
      fortune: [],
    },
    {
      name: '鳌拜',
      talent: [
        {
          name: '巴图鲁',
          effect: ['主运金刚不坏体，必定发动“金刚不坏特效”'],
        },
        {
          name: '满洲勇士',
          effect: ['满洲摔跤威力双倍，使敌人无法移动一回合'],
        },
        {
          name: '十三太保横练',
          effect: ['免疫破绽，免疫杀气，受到伤害降低13%'],
        },
      ],
      fortune: [],
    },
    {
      name: '冯锡范',
      talent: [
        {
          name: '一剑无血',
          effect: ['攻击时目标必流血且造成双倍流血效果，如果目标有流血状态，直接结算伤害，且恢复自身同等血量'],
        },
      ],
      fortune: [],
    },
    {
      name: '洪安通',
      talent: [
        {
          name: '神龙教主',
          effect: ['使用任何武功高连击、高暴击'],
        },
        {
          name: '豹胎易筋丸',
          effect: ['在敌方要服用的药品中加入豹胎易筋丸，使其加血效果变为减血'],
        },
      ],
      fortune: [],
    },
  ],
};
