export default {
  name: '射雕英雄传',
  list: [
    {
      id: 'guoJing',
      name: '郭靖',
      talent: [
        {
          name: '大器晚成',
          effect: ['左右互搏发动概率固定为80%', '作为队友时，最后10级的升级属性提高'],
        },
      ],
      fortune: [
        '射雕桃花岛招亲事件，洗第一、二、三格武功降龙十八掌、空明拳、九阴神功，并学会左右互搏',
        '射雕正线桃花岛收郭靖时，可以重新选择内力属性',
      ],
    },
    {
      id: 'huangRong',
      name: '黄蓉',
      talent: [
        {name: '带刺玫瑰', effect: ['装备软猬甲时，反弹30%所受到的伤害']},
        {
          name: '奇门遁甲',
          effect: [
            '战斗开始前可布置奇阵，不同颜色的地面有不同效果：',
            '红色——造成的伤害提高20%',
            '绿色——受到的伤害减少20%',
            '蓝色——攻击时追加2000点气攻',
            '紫色——被攻击时有30%概率闪避',
          ],
        },
        {name: '兰心蕙质', effect: ['修炼武功秘籍时，兵器值成长翻倍']},
      ],
      fortune: [],
    },
    {
      id: 'huangYaoShi',
      name: '黄药师',
      talent: [
        {
          name: '东邪',
          effect: [
            '攻击时高概率造成封穴',
            '集气速度+10',
            '自身在场时，敌方人物35%概率随机移动，敌方移动步数-2',
          ],
        },
        {
          name: '碧海潮生',
          effect: ['攻击时发动碧海潮生曲,第一击100%概率杀全体敌人内力500，连击时发动概率40%'],
        },
      ],
      fortune: [],
    },
    {
      id: 'ouYangFeng',
      name: '欧阳锋',
      talent: [
        {
          name: '走火入魔',
          effect: [
            '集气时有小概率跳跃（集气值随机增加）',
            '学会逆运后，被攻击必定进入【真·逆运经脉-走火入魔】状态',
            '走火状态必定暴击，攻击/防御效果提高10%，加力/护体/出招概率大幅提高',
            '走火状态无法休息，如体力低于20点，则停止走火',
          ],
        },
        {name: '蟾震九天', effect: ['蛤蟆功.蟾震九天效果加强，会根据蓄力值追加伤害']},
        {name: '西毒', effect: ['所有攻击无误伤', '攻击时无视敌方毒抗强制上毒30点']},
      ],
      fortune: [
        '射雕明霞岛剧情后，第二格武功洗逆运经脉，天赋内功洗为逆运经脉',
        '射雕支线华山绝顶剧情后，第三格武功洗灵蛇杖法',
      ],
    },
    {
      id: 'yiDeng',
      name: '一灯',
      talent: [
        {
          name: '先天一阳',
          effect: [
            '战斗中首次被击退可复活一次，恢复70%生命值，部分状态，并立即行动',
            '复活后，集气速度+5',
          ],
        },
        {name: '不动明王', effect: ['复活后，完全免疫敌方连击的伤害']},
        {
          name: '南帝',
          effect: [
            '使用一阳指，给敌方追加“无明业火”状态，持续30时序',
            '处于“无明业火”状态的人攻击时，会损失50%内力消耗量的生命（无法致死）',
            '攻击时高概率造成封穴',
          ],
        },
      ],
      fortune: [],
    },
    {
      id: 'hongQiGong',
      name: '洪七公',
      talent: [
        {
          name: '北丐',
          effect: ['使用降龙十八掌，40%概率发动【降龙.极意】', '使用降龙十八掌攻击无误伤'],
        },
        {name: '奇门无双', effect: ['奇门威力+200，增加自身40%奇门系数的攻击和防御']},
      ],
      fortune: [
        '射雕支线华山绝顶剧情后，第三格武功洗九阴神功，天赋内功洗为九阴神功，内力属性变为阴内',
      ],
    },
    {
      id: 'wangZhongYang',
      name: '王重阳',
      talent: [
        {
          name: '中神通',
          effect: [
            '全真剑法威力翻倍',
            '使用全真剑法，60%概率发动重阳剑气，追加777气攻',
            '攻击时高概率造成封穴',
            '攻击时概率给目标添加“同归”状态',
            '处于“同归”状态的人攻击时，会损失伤害同等的生命',
          ],
        },
        {name: '一气化三清', effect: ['消耗内力时，概率使少量内力值转化为怒气值、体力、生命值']},
        {
          name: '重阳再现',
          effect: [
            '战斗中首次被击退可复活一次，恢复70%生命值，部分状态，并立即行动',
            '复活后，集气速度+5',
          ],
        },
      ],
      fortune: [],
    },
    {
      id: 'linZhaoYing',
      name: '林朝英',
      talent: [
        {
          name: '姑射仙姿',
          effect: [
            '被攻击时必发动“轻云蔽月”，免疫攻击10时序，冷却时间50时序',
            '攻击时概率发动“流风回雪”，本次攻击必定造成冰封',
          ],
        },
        {name: '惊才绝艳', effect: ['特效触发概率+8点，被攻击集气不会少于300']},
      ],
      fortune: [],
    },
    {
      id: 'ouYangKe',
      name: '欧阳克',
      talent: [
        {
          name: '白驼少主',
          effect: [
            '暴怒时，使用白驼雪山掌可触发灵蛇拳，击中的敌人集气进入波动状态20时序（1/3概率集气倒退）',
          ],
        },
      ],
      fortune: [],
    },
    {
      id: 'zhouBoTong',
      name: '周伯通',
      talent: [
        {name: '顽童武痴', effect: ['每行动一次，攻击效果提升5%，最高提升30%']},
        {name: '空明武道', effect: ['攻击时，有(25+实战/20)%概率使敌方无法触发内功护体']},
      ],
      fortune: [],
    },
    {
      id: 'qiuQianRen',
      name: '裘千仞',
      talent: [{name: '铁掌水上漂', effect: ['使用任何武功高连击，高暴击', '移动步数+5']}],
      fortune: [],
    },
    {
      id: 'qiuChuJi',
      name: '丘处机',
      talent: [
        {
          name: '长春子',
          effect: [
            '华山观武后全真剑法威力翻倍',
            '主运先天功，全真剑法概率变化七星剑法 增加150点真实伤害',
          ],
        },
        {
          name: '一言止杀',
          effect: ['行动前如果满怒气且体力值大于25点触发，全体敌方50%概率一回合恐惧'],
        },
        {name: '七星聚会', effect: ['七子之中每人每次行动后为其余六人增加集气位置200']},
      ],
      fortune: [],
    },
    {
      id: 'maYu',
      name: '马钰',
      talent: [
        {name: '丹阳子', effect: ['华山观武后全真剑法威力翻倍，先天功气血，内力恢复双倍']},
        {name: '七星聚会', effect: ['七子之中每人每次行动后为其余六人增加集气位置200']},
      ],
      fortune: [],
    },
    {
      id: 'sunBuEr',
      name: '孙不二',
      talent: [
        {name: '清净散人', effect: ['全真剑法威力翻倍']},
        {name: '七星聚会', effect: ['七子之中每人每次行动后为其余六人增加集气位置200']},
      ],
      fortune: [],
    },
    {
      id: 'meiChaoFeng',
      name: '梅超风',
      talent: [{name: '铁尸魔煞', effect: ['华山观武后，九阴白骨爪威力增加50%']}],
      fortune: [],
    },
    {
      id: 'keZhenE',
      name: '柯镇恶',
      talent: [
        {name: '飞天蝙蝠', effect: ['自动主运飞天神行']},
        {name: '江南七怪', effect: ['江南七怪每在场一人，我方攻防轻+50，且彼此分担伤害']},
      ],
      fortune: [],
    },
    {
      id: 'shangGuanJianNan',
      name: '上官剑南',
      talent: [
        {name: '铁掌宗师', effect: ['铁掌威力+500']},
        {name: '傲视神罡', effect: ['攻击必暴击，拳掌武功必破防30%']},
        {name: '千秋侠烈', effect: ['生命值低于50%，伤害1.25倍，低于25%伤害1.5倍。']},
      ],
      fortune: [],
    },
    {
      id: 'yueYun',
      name: '岳云',
      talent: [
        {name: '决胜千里', effect: ['每回合50%概率发动：敌方集气-150，我方集气+150']},
        {
          name: '岳家将',
          effect: [
            '岳家枪法和岳王散手威力+300',
            '岳家枪法攻击必命中，必连击',
            '岳王散手攻击必暴击，必封穴',
          ],
        },
        {name: '精忠报国', effect: ['生命低于50%减伤15%，生命低于25%减伤30%']},
      ],
      fortune: [],
    },
    {
      id: 'fengHeng',
      name: '冯蘅',
      talent: [
        {name: '岛主夫人', effect: ['桃花岛武学威力+200', '特效发动概率+10']},
        {name: '过目不忘', effect: ['修炼武功秘籍时，属性值成长翻倍']},
      ],
      fortune: [
        '桃花岛招亲后，第2格洗九阴神功1级，天内洗九阴神功',
        '射雕正线牛家村3格洗弹指神通，天外洗弹指神通',
        '射雕邪线云岭山洞3格洗九阴白骨爪，天外洗九阴白骨爪',
      ],
    },
    {
      id: 'yangKang',
      name: '杨康',
      talent: [{name: '小王爷', effect: ['每个武功到极减少5%所受伤害与杀气（上限35%）']}],
      fortune: [],
    },
    {
      id: 'aQing',
      name: '阿青',
      talent: [
        {
          name: '越女剑仙',
          effect: [
            '使用越女剑法攻击无误伤',
            '每次行动前解除自身所有异常',
            '自带“九霄仙息”护体，概率增加自身御剑系数×5点气防',
            '战场中增加自身御剑系数值的攻防',
          ],
        },
        {name: '天元剑气', effect: ['使用剑系武功攻击时，敌方防御减少75%']},
        {name: '剑心通明', effect: ['剑法攻击必中']},
      ],
      fortune: [],
    },
  ],
};
