export default {
  name: '笑傲江湖',
  list: [
    {
      name: '令狐冲',
      talent: [
        {
          name: '九剑传人',
          effect: ['被风清扬指点后，进入战斗初始集气值1000，移动格数+3'],
        },
        {
          name: '一通万法',
          effect: ['每个武功到极，三围与五系+10'],
        },
      ],
      fortune: [
        '笑傲思过崖剧情，第一格武功洗独孤九剑，天赋外功洗为独孤九剑',
        '笑傲梅庄剧情之后，第二格武功洗吸星大法，天赋内功洗为吸星大法',
      ],
    },
    {
      name: '任盈盈',
      talent: [
        {
          name: '日月圣姑',
          effect: ['每时序回复自身5点中毒'],
        },
        {
          name: '七弦剑气',
          effect: ['攻击时几率（使用持瑶琴必定）发动“七弦无形剑气”，对敌方全体造成50点伤害'],
        },
      ],
      fortune: [],
    },
    {
      name: '林平之',
      talent: [
        {
          name: '辟邪剑客',
          effect: ['初始集气900', '使用辟邪剑法攻击招式无需气'],
        },
        {
          name: '血海飘香',
          effect: ['根据本轮造成的伤害提高下一轮的集气位置，上限400'],
        },
      ],
      fortune: ['笑傲福威镖局正邪分支后，洗第一二格武功，天赋内功洗为葵花神功'],
    },
    {
      name: '岳灵珊',
      talent: [
        {
          name: '小师妹',
          effect: ['笑傲福威镖局正邪分支后，洗第一二三四五格武功'],
        },
        {
          name: '慧中灵剑',
          effect: ['每修炼一门剑法，攻击效果提升5%，初始集气+50'],
        },
      ],
      fortune: ['笑傲福威镖局正邪分支后，洗第一二三四五格武功'],
    },
    {
      name: '东方不败',
      talent: [
        {
          name: '葵花秘法',
          effect: ['葵花神功为天赋内功时自动运功且必刺目', '真·葵花移形概率30%', '葵花点穴手攻击时追加1000气攻，且必定造成封穴'],
        },
        {
          name: '唯我不败',
          effect: ['自带绣花针', '攻击无误伤', '暴怒时触发，状态解除前不会受到伤害'],
        },
        {
          name: '风云再起',
          effect: ['集气速度提升6点', '50%几率追加一次连击（暴怒必触发），且连击时伤害、气攻不减'],
        },
      ],
      fortune: [],
    },
    {
      name: '岳不群',
      talent: [
        {
          name: '君子剑',
          effect: ['使用剑法几率三连击', '华山觉醒后自带五岳剑诀'],
        },
      ],
      fortune: [],
    },
    {
      name: '莫大',
      talent: [
        {
          name: '七弦剑气',
          effect: ['攻击时几率（使用持瑶琴必定）发动“七弦无形剑气”，对敌方全体造成50点伤害'],
        },
        {
          name: '衡山掌门',
          effect: ['衡山派武学连击率+40%，暴击率+40%，威力+500', '华山觉醒后自带五岳剑诀'],
        },
        {
          name: '潇湘夜雨',
          effect: ['攻击范围+1，攻击时几率发动笑傲江湖追加气攻'],
        },
      ],
      fortune: [],
    },
    {
      name: '定闲',
      talent: [
        {
          name: '恒山掌门',
          effect: ['恒山派武学连击率+40%，暴击率+40%，威力+500', '华山觉醒后自带五岳剑诀'],
        },
      ],
      fortune: [],
    },
    {
      name: '左冷禅',
      talent: [
        {
          name: '嵩山掌门',
          effect: ['攻击时高几率附带冰封', '华山觉醒后自带五岳剑诀'],
        },
      ],
      fortune: [],
    },
    {
      name: '天门',
      talent: [
        {
          name: '泰山掌门',
          effect: ['攻击时高几率附带灼烧', '华山觉醒后自带五岳剑诀'],
        },
      ],
      fortune: [],
    },
    {
      name: '余沧海',
      talent: [
        {
          name: '青城掌门',
          effect: ['松风剑法威力翻倍，华山觉醒后松风剑法威力翻倍，必连击，必暴击'],
        },
      ],
      fortune: [],
    },
    {
      name: '蓝凤凰',
      talent: [
        {
          name: '五毒教主',
          effect: ['攻击伤害提升10%', '用毒能力上限400'],
        },
      ],
      fortune: [],
    },
    {
      name: '任我行',
      talent: [
        {
          name: '日月魔帝',
          effect: ['吸星大法吸体力效果提高', '使用任何武功高暴击', '攻击时高几率造成封穴'],
        },
        {
          name: '魔帝·吸星',
          effect: [
            '【天关BOSS翻倍】',
            '每3时序恢复一点内伤',
            '距离越远所受到的伤害与杀气越低（与远距离伤害衰减叠加）',
            '敌方与自身距离越近，集气速度越低（最远10格，超出10格不受影响）',
            '攻击与被攻击时必定触发吸星大法',
            '吸星大法效果固定增加200，当敌方内力不足时，则造成损失内力一半的生命损失，当自身满内时，吸收内力的一半化作真气护体，上限为最大生命的30%',
          ],
        },
      ],
      fortune: [],
    },
    {
      name: '平一指',
      talent: [
        {
          name: '杀人名医',
          effect: ['每击退一名敌人集气速度+3点、医疗能力+50（最多5个有效）', '医疗能力上限500'],
        },
      ],
      fortune: [],
    },
    {
      name: '田伯光',
      talent: [
        {
          name: '采花大盗',
          effect: ['攻击女性时吸取内力体力'],
        },
        {
          name: '长风万里',
          effect: ['移动距离增加2格，免疫锁足'],
        },
      ],
      fortune: [],
    },
    {
      name: '祖千秋',
      talent: [
        {
          name: '酒神迷踪',
          effect: ['被攻击时有30%几率发动“酒神迷踪步”闪避'],
        },
      ],
      fortune: [],
    },
    {
      name: '风清扬',
      talent: [
        {
          name: '剑道通神',
          effect: ['初始集气位置+990', '暴怒时使用独孤九剑攻击，追加1000点气功和10时序的静止状态，可叠加'],
        },
        {
          name: '无我无剑',
          effect: ['被攻击前先手反击，独孤求败先手反击后几率打断对方攻击'],
        },
        {
          name: '九剑真传',
          effect: [
            '独孤九剑攻击时50%概率发动四种特效',
            '荡剑式：集气+200',
            '撩剑式：伤害+30%',
            '倒剑式：强制杀气150',
            '离剑式：伤害不随距离递减',
            '被攻击时发动破X式：减少受到伤害20%，攻击下回合集气位置-200',
          ],
        },
      ],
      fortune: [],
    },
    {
      name: '成不忧',
      talent: [
        {
          name: '夺命三仙',
          effect: ['使用剑法连击时变为三连击'],
        },
      ],
      fortune: [],
    },
    {
      name: '封不平',
      talent: [
        {
          name: '狂风快剑',
          effect: ['使用剑法攻击，下回合集气+100'],
        },
      ],
      fortune: [],
    },
    {
      name: '方证',
      talent: [
        {
          name: '千手如来',
          effect: ['使用拳法攻击时，攻击范围增加一格', '自动运行易筋经', '免疫敌方三大吸功的吸内效果'],
        },
        {
          name: '少林掌门',
          effect: ['无视条件修炼少林寺武学'],
        },
        {
          name: '菩提金身',
          effect: ['受到的连击和暴击伤害减少20%'],
        },
      ],
      fortune: [],
    },
    {
      name: '向问天',
      talent: [
        {
          name: '天王老子',
          effect: ['吸血10%', '每时序流失3点生命'],
        },
        {
          name: '越战越勇',
          effect: ['增加伤害和减少受到的伤害，气血越少增加的越多，最少15%，最多35%'],
        },
      ],
      fortune: [],
    },
    {
      name: '解风',
      talent: [
        {
          name: '风激云扬',
          effect: ['降龙十八掌命中率+200'],
        },
        {
          name: '丐帮帮主',
          effect: ['学习打狗棒法与降龙十八掌无视内力属性和系数条件'],
        },
      ],
      fortune: [],
    },
    {
      name: '曲非烟',
      talent: [
        {
          name: '曲径幽通',
          effect: ['持瑶琴威力翻倍，攻击时30%概率触发“曲径幽通”必中'],
        },
        {
          name: '曲夕烟隙',
          effect: ['30%概率触发“曲夕烟隙”混乱目标，使目标随机移动'],
        },
      ],
      fortune: [],
    },
    {
      name: '不戒和尚',
      talent: [
        {
          name: '不戒和尚',
          effect: ['特色指令【不戒】：帮助队友自宫，每次开启消耗体力20，内力1000'],
        },
      ],
      fortune: [],
    },
    {
      name: '宁中则',
      talent: [
        {
          name: '华山玉女',
          effect: ['紫霞神功必发动紫霞剑气', '剑法攻击必触发"玉女十九剑" 增加自身连击率，暴怒必连'],
        },
        {
          name: '娇美人妻',
          effect: ['被攻击时，消耗攻击方5-10点体力'],
        },
      ],
      fortune: ['获得五岳剑诀后，第二格洗五岳剑诀'],
    },
    {
      name: '仪琳',
      talent: [
        {
          name: '小尼姑',
          effect: ['被攻击伤害-15%，自身伤害-10%'],
        },
        {
          name: '天域幻音',
          effect: ['友方行动结束清除流血、中毒、冰封、灼烧、内伤状态，并最多回复200点生命'],
        },
      ],
      fortune: ['获得万花剑法 1格洗万花剑法1级'],
    },
  ],
};
