export default {
  name: '倚天屠龙记',
  list: [
    {
      id: 'zhangWuJi',
      name: '张无忌',
      talent: [
        {name: '九阳明尊', effect: ['没触发内功加力，护体时，补偿九阳神功加力，护体']},
        {
          name: '运转乾坤',
          effect: [
            '乾坤大挪移反弹效果强化至反弹40%伤害（无需运功）',
            '乾坤大挪移可同时反弹给两个人',
            '学会乾坤后，被攻击时，有（35+天书数）%的几率触发，可以选择：',
            'A.在两格范围内对敌方的攻击落点进行挪移（消耗300点内力）',
            'B.按ESC键取消挪移，本次被攻击必定发动乾坤反弹50%伤害（无需运功）',
            '触发『逆转乾坤』后，敌方的误伤伤害将大幅提高',
            '怒气值100时，『逆转乾坤』触发几率提升10%',
          ],
        },
      ],
      fortune: [
        '朱府剧情第一格洗九阳神功',
        '光明顶领悟仁阳佛光',
        '光明顶密道获得乾坤大挪移时，洗第二格武功',
        '灵蛇岛剧情领悟圣火明尊',
        '武当山见张三丰后，洗第三四格武功',
      ],
    },
    {
      id: 'zhaoMin',
      name: '赵敏',
      talent: [
        {name: '绍敏郡主', effect: ['被攻击时，攻击方会损失其造成伤害30%的血量']},
        {
          name: '机智多谋',
          effect: ['在场时，我方全体获得如下光环：', '处于蓄力状态时，增加自身20%减伤（蓄力必定成功）', '处于防御状态时，有20%几率闪避'],
        },
      ],
      fortune: ['神雕邪线，襄阳城战蒙哥后第二格武功洗天魔功，天赋内功洗为天魔功'],
    },
    {
      id: 'zhouZhiRuo',
      name: '周芷若',
      talent: [{name: '芷兰毓秀', effect: []}],
      fortune: ['倚天邪线少林剧情，可选择洗第一格武功', '倚天邪线少林剧情，洗第二格武功，天赋内功洗为九阴神功'],
    },
    {
      id: 'xiaoZhao',
      name: '小昭',
      talent: [{name: '波斯圣女', effect: ['敌全体移动减三格', '无视资质学习乾坤大挪移']}],
      fortune: [],
    },
    {
      id: 'yinLi',
      name: '殷离',
      talent: [{name: '千蛛万毒', effect: ['攻击强制上毒20点，根据目标中毒值回复生命']}],
      fortune: [],
    },
    {
      id: 'zhangSanFeng',
      name: '张三丰',
      talent: [
        {
          name: '太极宗师',
          effect: ['连击伤害杀气借力打力不减', '攻击无误伤', '太极拳连击时亦享受借力打力效果', '太极奥义发动几率无视资质固定为85%'],
        },
        {
          name: '通微显化',
          effect: [
            '被攻击几率发动无根无形减伤30%',
            '攻击时几率发动万法自然，下回合集气+500',
            '移动格数至少为8格',
            '攻击时几率触发化朽为奇，追加武功威力的气攻',
          ],
        },
        {name: '百年童男', effect: ['纯阳无极功自动运功', '永远保持阳内']},
      ],
      fortune: [],
    },
    {
      id: 'mieJue',
      name: '灭绝',
      talent: [
        {name: '灭天绝地', effect: ['使用任何武功高连击，必暴击', '移动格数+3']},
        {name: '谁与争锋', effect: ['装备[倚天剑]时，全部剑法威力+200', '使用九阴白骨爪，攻击时无视敌方50%防御']},
      ],
      fortune: [],
    },
    {
      id: 'heTaiChong',
      name: '何太冲',
      talent: [
        {
          name: '昆仑掌门',
          effect: [
            '特色指令【铁琴】：使全场敌人受到其身上琴音层数×50点伤害，并清除其身上的琴音状态',
            '昆仑派武学连击率+40%，暴击率+40%，威力+500',
          ],
        },
        {name: '铁琴铮铮', effect: ['攻击时，有60%几率给敌方附加1-3层琴音状态（上限为20层）', '每层琴音状态降低敌方1%集气速度']},
      ],
      fortune: [],
    },
    {
      id: 'tangWenLiang',
      name: '唐文亮',
      talent: [
        {name: '崆峒掌门', effect: ['崆峒派武学连击率+40%，暴击率+40%，威力+500']},
        {name: '崆峒五老', effect: ['七伤拳一震七伤反噬减少一半']},
      ],
      fortune: [],
    },
    {
      id: 'yangXiao',
      name: '杨逍',
      talent: [{name: '光明左使', effect: ['每次攻击，使敌方受到的伤害提高2%，上限40%']}],
      fortune: [],
    },
    {
      id: 'fanYao',
      name: '范遥',
      talent: [{name: '光明右使', effect: ['每次受到攻击，增加自身1%的减伤，上限20%']}],
      fortune: [],
    },
    {
      id: 'daiQiSi',
      name: '黛绮丝',
      talent: [
        {name: '紫衫龙王', effect: ['每次行动都有20%几率魅惑敌人一回合']},
        {name: '倾国倾城', effect: ['被攻击时几率由战场上随机参加人物替代伤害']},
        {name: '波斯圣女', effect: ['敌全体移动减三格', '无视资质学习乾坤大挪移']},
      ],
      fortune: [],
    },
    {
      id: 'yinTianZheng',
      name: '殷天正',
      talent: [{name: '白眉鹰王', effect: ['鹰爪功威力增加50%']}],
      fortune: [],
    },
    {
      id: 'xieXun',
      name: '谢逊',
      talent: [
        {
          name: '金毛狮王',
          effect: [
            '狮子吼发动条件放宽为敌方内力低于自身即可',
            '受到的伤害减少15%',
            '七伤拳“一震七伤”发动几率100%，且一震七伤额外造成7点内伤',
          ],
        },
        {name: '狮王咆哮', effect: ['攻击时几率消耗体力10点和2000内力，使全场敌人进入恐惧状态20时序']},
      ],
      fortune: [],
    },
    {
      id: 'weiYiXiao',
      name: '韦一笑',
      talent: [
        {name: '青翼蝠王', effect: ['集气速度提升10点', '华山观武后，寒冰绵掌威力增加50%']},
        {name: '吸血蝙蝠', effect: ['攻击时，恢复造成伤害10%的血量（单次攻击吸血上限200点）']},
      ],
      fortune: [],
    },
    {
      id: 'huQingNiu',
      name: '胡青牛',
      talent: [
        {name: '蝶谷医仙', effect: ['医疗上限500点', '可向队友用药', '全场友军使用药品效果上升30%']},
        {
          name: '群体治疗',
          effect: ['体力大于15，内力大于300时，攻击几率对周围五格范围内的队友进行治疗，时序回内伤并按比例回血，持续20时序'],
        },
      ],
      fortune: [],
    },
    {
      id: 'wangNanGu',
      name: '王难姑',
      talent: [
        {name: '蝶谷毒仙', effect: ['用毒能力上限500', '攻击时带毒10~50点']},
        {name: '群体上毒', effect: ['体力大于15，内力大于300时，攻击几率对周围五格范围内的敌人时序中毒，持续50时序']},
      ],
      fortune: [],
    },
    {
      id: 'chengKun',
      name: '成昆',
      talent: [
        {name: '混元霹雳手', effect: ['集气速度+10点', '使用任何武功高几率连击，高几率封穴']},
        {name: '幻音魔相', effect: ['攻击时50%几率使七格内敌人集气混乱5时序']},
      ],
      fortune: [],
    },
    {
      id: 'kongWen',
      name: '空闻',
      talent: [{name: '四大神僧', effect: ['使用大力金刚掌时自动进入蓄力状态']}],
      fortune: [],
    },
    {
      id: 'kongXing',
      name: '空性',
      talent: [{name: '四大神僧', effect: ['使用龙爪手时自动进入等待状态']}],
      fortune: [],
    },
    {
      id: 'liuYunShi',
      name: '流云使',
      talent: [{name: '圣火三使', effect: ['40%几率集气位置向前跳跃20~40']}],
      fortune: [],
    },
    {
      id: 'zhuJiuZhen',
      name: '朱九真',
      talent: [{name: '雪岭双姝', effect: ['战场上可发现食材']}],
      fortune: [],
    },
    {
      id: 'songQingShu',
      name: '宋青书',
      talent: [
        {name: '武当精英', effect: ['武当派武功连击率+10%，暴击率+10%']},
        {name: '玉面孟尝', effect: ['战场上我方女性角色越多其攻击效果越高']},
      ],
      fortune: [],
    },
    {
      id: 'huangShanNv',
      name: '黄衫女',
      talent: [
        {name: '翩若惊鸿', effect: ['学会天罗地网后，每次攻击增加1~2层“疾风”，每层+2.5%集气，最多10层', '被男性目标攻击伤害减少10%']},
        {
          name: '古墓后人',
          effect: [
            '无需主运九阴神功可触发九阴神爪极意',
            '九阴白骨爪华山觉醒威力+50%，七书九阴神爪极意40%概率三连，暴怒触发三连',
            '华山后山觉醒后暴怒触发“广寒清辉”，必冰冻5时序',
          ],
        },
      ],
      fortune: [],
    },
    {
      id: 'heBiWeng',
      name: '鹤笔翁',
      talent: [
        {name: '玄冥二老', effect: ['使用玄冥神掌，必定发动极意']},
        {name: '蓑羽凶鹤', effect: ['暴怒时攻击随机附加负面状态', '战斗中首次被击退可复活一次，立即行动']},
      ],
      fortune: [],
    },
    {
      id: 'luZhangKe',
      name: '鹿杖客',
      talent: [
        {name: '玄冥二老', effect: ['使用玄冥神掌，必定发动极意']},
        {name: '漠北苟王', effect: ['免疫男性非连击伤害', '被女性攻击时追加666点伤害']},
      ],
      fortune: [],
    },
    {
      id: 'douJiuSeng',
      name: '斗酒僧',
      talent: [
        {name: '九阳至尊', effect: ['内力上限9999', '九阳神功必加力护体', '可使用九阳神功攻击', '反弹40%伤害']},
        {name: '氤氲紫气', effect: ['受到的气攻与伤害减少30%，免疫连击']},
      ],
      fortune: [],
    },
    {
      id: 'heZuDao',
      name: '何足道',
      talent: [
        {
          name: '昆仑三圣',
          effect: [
            '琴音：攻击时为敌全体添加1~4层琴音BUFF,最多30层',
            '棋势：攻击目标附带天数书量×10的伤害',
            '百鸟朝凤：每次攻击时给自身添加2~3层曲风BUFF，曲风BUFF>20层，消耗20层曲风给敌全体造成附加琴音层数×10的伤害',
          ],
        },
        {name: '何足道哉', effect: ['气血越少连击、暴击越高']},
      ],
      fortune: ['获得九阳神功，天内洗九阳神功', '获得两仪剑法，第1格洗两仪剑法', '获得两仪刀法，第2格洗两仪刀法'],
    },
    {
      id: 'jueYuan',
      name: '觉远',
      talent: [
        {name: '少林高僧', effect: ['少林派武学连击率+20%，暴击率+20%']},
        {name: '天域幻音', effect: ['友方行动结束清除流血、中毒、冰封、灼烧、内伤状态，并最多回复200点生命']},
        {name: '仁阳佛光', effect: ['内力上限9999，可使用九阳神功攻击']},
      ],
      fortune: [],
    },
    {
      id: 'baiYuan',
      name: '白猿',
      talent: [
        {name: '剑术通神', effect: ['剑法威力+200，增加自身20%御剑系数的攻击和防御']},
        {name: '神剑仙猿', effect: ['等待时自动蓄力（无法触发龙象蓄力等效果）', '使用剑系武功时必连击', '猿公剑法威力+500']},
        {name: '闪电惊鸿', effect: ['初始集气1000，每次攻击后自身集气+200']},
      ],
      fortune: [],
    },
    {
      id: 'duE',
      name: '渡厄',
      talent: [
        {name: '少林护法', effect: ['少林派武学连击率+40%，暴击率+40%']},
        {name: '金刚伏魔', effect: ['造成的伤害恢复队友或自己的生命', '额外追加200点伤害']},
      ],
      fortune: [],
    },
    {
      id: 'moNi',
      name: '摩尼',
      talent: [
        {name: '魔道天行', effect: ['我方全体攻击伤害×120%，敌方全体攻击伤害×90%']},
        {
          name: '运转乾坤',
          effect: [
            '乾坤大挪移反弹效果强化至反弹40%伤害（无需运功）',
            '乾坤大挪移可同时反弹给两个人',
            '学会乾坤后，被攻击时，有（35+天书数）%的几率触发，可以选择：',
            'A.在两格范围内对敌方的攻击落点进行挪移（消耗300点内力）',
            'B.按ESC键取消挪移，本次被攻击必定发动乾坤反弹50%伤害（无需运功）',
            '触发『逆转乾坤』后，敌方的误伤伤害将大幅提高',
            '怒气值100时，『逆转乾坤』触发几率提升10%',
          ],
        },
        {name: '魔道祖师', effect: ['明教武功连击率+40%，暴击率+40%，威力+400']},
        {name: '圣火明尊', effect: ['攻击必灼烧，灼烧大于25点必点燃', '点燃后可造成小范围伤害']},
      ],
      fortune: [],
    },
    {
      id: 'moShengGu',
      name: '莫声谷',
      talent: [
        {name: '武当高手', effect: ['武当派武功连击率+20%，暴击率+20%']},
        {name: '武当七侠', effect: ['使用太极拳或太极剑攻击后，自动进入防御状态']},
        {name: '以暴制暴', effect: ['受到暴击伤害，自身下次攻击必暴击一次', '受到连击伤害，自身下次攻击必连击一次']},
        {name: '以眼还眼', effect: ['生命值大于10%时，每次攻击减少自身5%的生命，对目标附加5%最大生命的伤害']},
      ],
      fortune: [],
    },
    {
      id: 'zhangCuiShan',
      name: '张翠山',
      talent: [
        {name: '武当高手', effect: ['武当派武功连击率+20%，暴击率+20%']},
        {name: '武当七侠', effect: ['使用太极拳或太极剑攻击后，自动进入防御状态']},
        {name: '得意门生', effect: ['被攻击时几率按自身暴击率的一半降低伤害']},
        {name: '银勾铁划', effect: ['攻击时几率按自身连击率的一半提高伤害']},
      ],
      fortune: [],
    },
    {
      id: 'zhangZhong',
      name: '张中',
      talent: [{name: '五散人', effect: ['明教武学和江湖武学连击率+20%，暴击率+20%', '特色指令【天变】：可改变天气']}],
      fortune: [],
    },
  ],
};
